{
    "meta": {
        "title": "A Thousand Brains: A New Theory of Intelligence",
        "author": "Jeff Hawkins",
        "publisher": "Basic Books",
        "pages": 244
    },
    "parts": [
        {
            "title": "Evolution of Brain Science and Thousand Brains Theory",
            "body": "<b style='color: forestgreen;'>Neuroscience's quest</b> to understand <b style='color: forestgreen;'>intelligence</b> remains a <b style='color: forestgreen;'>mystery</b>, despite collecting numerous facts about the <b style='color: forestgreen;'>brain</b>. Jeff Hawkins explores this in \"A Thousand Brains,\" proposing a breakthrough with the <b style='color: forestgreen;'>Thousand Brains Theory</b> based on <b style='color: forestgreen;'>reference frames</b>. Like a map with grid lines, these frames structure knowledge and thought, explaining <b style='color: forestgreen;'>sensory integration</b> and <b style='color: forestgreen;'>false beliefs</b>. With roots in Crick's ideas and Hawkins' own journey in <b style='color: forestgreen;'>Silicon Valley</b>, this work links <b style='color: forestgreen;'>human and machine intelligence</b> while pondering the <b style='color: forestgreen;'>future</b> driven by either our <b style='color: forestgreen;'>genes</b> or <b style='color: forestgreen;'>intellectual</b> capacity."
        },
        {
            "title": "Journey from Tech to Neuroscience",
            "body": "<b style='color: forestgreen;'>After</b> hundreds of neuroscience papers, incorporating psychology, linguistics, and philosophy, the author gains a <b style='color: forestgreen;'>unique educational experience</b>. In 1988, he starts <b style='color: forestgreen;'>entrepreneurial successes</b> in Silicon Valley, creating <b style='color: forestgreen;'>tablet computers</b> and founding <b style='color: forestgreen;'>Palm Computing</b>, where <b style='color: forestgreen;'>handheld devices flourish.</b> His passion, however, lies in <b style='color: forestgreen;'>neuroscience, specifically brain theory</b>.\n\nThe author eventually leaves his business endeavors to <b style='color: forestgreen;'>delve back into neuroscience</b>. In 2002, with <b style='color: forestgreen;'>neuroscientist friends’ support</b>, he establishes the <b style='color: forestgreen;'>Redwood Neuroscience Institute (RNI)</b>, concentrating on <b style='color: forestgreen;'>neocortical theory</b>, collaborating with visiting scholars. Although RNI was <b style='color: forestgreen;'>successful</b>, he yearns for <b style='color: forestgreen;'>consensus on specific questions</b>.\n\nRNI is relocated to <b style='color: forestgreen;'>UC Berkeley</b>, where it's welcomed despite earlier resistance, transforming into the <b style='color: forestgreen;'>Redwood Center for Theoretical Neuroscience</b>. The author also creates <b style='color: forestgreen;'>Numenta</b>, focusing on <b style='color: forestgreen;'>neocortex theories</b> and <b style='color: forestgreen;'>applying them</b> to <b style='color: forestgreen;'>machine learning</b>. After <b style='color: forestgreen;'>significant discoveries in 2010</b> and 2016, he starts writing a book to <b style='color: forestgreen;'>share insights on the neocortex</b>, emphasizing the importance of a few <b style='color: forestgreen;'>billion cells acknowledging the universe</b>."
        },
        {
            "title": "Mountcastle's Universal Algorithm Theory",
            "body": "<b style='color: forestgreen;'>Mountcastle's Big Idea</b>: Vernon Mountcastle, in his 1978 essay \"An Organizing Principle for Cerebral Function,\" proposed a revolutionary theory about the neocortex's role in <b style='color: forestgreen;'>intelligence</b>. Instead of growing new distinct parts, the <b style='color: forestgreen;'>neocortex</b> expands by replicating a basic circuit over and over, a concept akin to <b style='color: forestgreen;'>Darwin's evolution</b> theory. Mountcastle suggested that all regions of the neocortex are fundamentally the same, doing the same thing but connected differently—leading to different functions like <b style='color: forestgreen;'>vision</b> or <b style='color: forestgreen;'>language</b>.\n\n<b style='color: forestgreen;'>Universal Algorithm</b>: Mountcastle theorized a universal <b style='color: forestgreen;'>cortical algorithm</b> responsible for all intelligent functions, focusing on <b style='color: forestgreen;'>cortical columns</b>—thin strands within the neocortex, stacked like pieces of thin spaghetti. These columns, further divided into <b style='color: forestgreen;'>minicolumns</b>, perform the same underlying function across all neocortical areas. This idea implies that varied cognitive abilities stem from the same computational process, casting the neocortex as a uniform system executing a single algorithm for <b style='color: forestgreen;'>perception</b> and <b style='color: forestgreen;'>intelligence</b>.\n\n<b style='color: forestgreen;'>Mountcastle's Influence</b>: Despite some skepticism, Mountcastle's proposition remains a landmark in neuroscience. It offers a unified explanation for the neocortex's seemingly <b style='color: forestgreen;'>similar architecture</b> across diverse tasks and animal species. The debate continues as many neuroscientists seek to decode the cortical column's function, holding it as a crucial element in understanding human <b style='color: forestgreen;'>intelligence</b>. The essay's influence resonates profoundly with those exploring complex brain theories, presenting an elegant framework for pursuing brain <b style='color: forestgreen;'>research</b>."
        },
        {
            "title": "The Importance of Reference Frames in the Neocortex",
            "body": "<h3 style='color: forestgreen;'>Reference Frames and Cortical Columns</h3>\n\n<em style='color: forestgreen;'>This chapter highlights the essential function of <b style='color: forestgreen;'>reference frames</b> in the <b style='color: forestgreen;'>neocortex</b>—an insight explaining how the <b style='color: forestgreen;'>brain predicts</b> the next input when we <b style='color: forestgreen;'>move</b>. The author had an \"aha moment\" realizing that for the brain to make such predictions, it needs to know <b style='color: forestgreen;'>object location</b> in its reference frame, and this spurs predictions of subsequent sensations and inputs.</em>\n\n<em style='color: forestgreen;'>In defining reference frames, the author describes their function in representing the <b style='color: forestgreen;'>location relative</b> to an object, independent of where it is in space. Because of this ability, the <b style='color: forestgreen;'>brain processes sensory inputs</b> and <b style='color: forestgreen;'>manipulates structures</b> efficiently, enabling complex actions and perceptions. Reference frames are crucial for learning object structures and for <b style='color: forestgreen;'>planning movements</b> effectively.</em>\n\n<em style='color: forestgreen;'>The text asserts that the brain's ability to maintain reference frames is essential for <b style='color: forestgreen;'>learning</b>, allowing it to track positions and compute relative locations effectively. This discovery is seen as a crucial element of the <b style='color: forestgreen;'>universal algorithm</b> suggested by Mountcastle and deemed necessary for fully understanding <b style='color: forestgreen;'>intelligence</b>.</em>"
        },
        {
            "title": "Reference Frames, Evolution, and Brain Mapping",
            "body": "<h3 style='color: forestgreen;'>Objects and Spatial Perception</h3>\nThe brain uses reference frames to perceive objects at various distances <b style='color: forestgreen;'>outside our body</b>, rather than inside, such as on the retina or in the ear. This implies the existence of neurons representing object locations in the <b style='color: forestgreen;'>cortex</b>. Historically, theories on this were largely <b style='color: forestgreen;'>deductive</b>, with hints that older brain areas like the <b style='color: forestgreen;'>entorhinal cortex</b> could provide insights.\n\n<h3 style='color: forestgreen;'>Evolution and Navigation</h3>\nIn evolutionary terms, animals developed surroundings-based reference frames for <b style='color: forestgreen;'>navigation</b> to improve survival, like knowing where food is. Early creatures like bacteria relied on simple environmental signals. More complex animals formed internal spatial maps, allowing them to navigate using neuron-created maps in the <b style='color: forestgreen;'>hippocampus</b> and <b style='color: forestgreen;'>entorhinal cortex</b>. Mammals, including humans, have these systems for tracking environments, illustrating the importance of spatial perception.\n\n<h3 style='color: forestgreen;'>Discovery of Place and Grid Cells</h3>\n<b style='color: forestgreen;'>John O’Keefe</b> and later the <b style='color: forestgreen;'>Mosers</b> discovered the <b style='color: forestgreen;'>place cells</b> and <b style='color: forestgreen;'>grid cells</b> which map environments in the <b style='color: forestgreen;'>hippocampus</b> and <b style='color: forestgreen;'>entorhinal cortex</b> in mammals, respectively. Place cells act like \"you are here\" markers, while grid cells map consistent intervals in an explored space. These discoveries informed theories that similar systems in the <b style='color: forestgreen;'>neocortex</b> could map object spaces, evolving from older brain structures possibly as simpler variations or derivatives of the grid cell concept."
        },
        {
            "title": "Thousand Brains Theory and Voting Mechanism",
            "body": "<b style='color: forestgreen;'>The brain</b> stores <b style='color: forestgreen;'>knowledge</b> in a distributed manner, utilizing <b style='color: forestgreen;'>thousands</b> of <b style='color: forestgreen;'>cortical columns</b> to model an object or concept. These <b style='color: forestgreen;'>columns</b> don't hold <b style='color: forestgreen;'>identical models</b>, but rather <b style='color: forestgreen;'>complementary ones</b>, assisting in understanding various aspects of an object, like a <b style='color: forestgreen;'>coffee cup</b>. The notion called the <b style='color: forestgreen;'>Thousand Brains Theory</b> explains that <b style='color: forestgreen;'>what we know</b> is a <b style='color: forestgreen;'>collection of models</b> spanning across columns in the cortex, which helps in <b style='color: forestgreen;'>stability and consensus</b> in perception through a strategy called <b style='color: forestgreen;'>voting</b>. \n\n<b style='color: forestgreen;'>Voting</b> amongst cortical columns allows for <b style='color: forestgreen;'>binding sensory inputs</b> into a <b style='color: forestgreen;'>singular perception</b> rather than engaging just one area of the brain, which is how the <b style='color: forestgreen;'>binding problem</b> is resolved. By <b style='color: forestgreen;'>comparing possibilities</b>, the brain <b style='color: forestgreen;'>decodes</b> what it senses, achieving consensus without every column being aware of each other's inputs. This process ensures <b style='color: forestgreen;'>stability</b> in perception even with changing inputs as <b style='color: forestgreen;'>stable neurons</b> guide <b style='color: forestgreen;'>voting</b>, making us <b style='color: forestgreen;'>unaware</b> of individual sensory changes. \n\n<b style='color: forestgreen;'>Attention</b> works alongside the voting process, allowing us to shift focus between various objects or scenes, determining <b style='color: forestgreen;'>relative positions</b> unconsciously. This takes place through interactions with areas like the <b style='color: forestgreen;'>thalamus</b>, supporting flexible perception. These processes visually <b style='color: forestgreen;'>decode</b>, for example, whether we focus on just <b style='color: forestgreen;'>half-hidden people</b> or background elements like <b style='color: forestgreen;'>car doors</b>, deciding on one <b style='color: forestgreen;'>interpretation</b> over another while scanning scenes."
        },
        {
            "title": "Thousand Brains Theory and Neocortex Learning",
            "body": "The <b style='color: forestgreen;'>neocortex</b> learns by associating <b style='color: forestgreen;'>objects</b> and their <b style='color: forestgreen;'>parts</b> using <b style='color: forestgreen;'>relative position</b> and <b style='color: forestgreen;'>reference frames</b>. This process is hypothesized to be <b style='color: forestgreen;'>influenced</b> by the <b style='color: forestgreen;'>thalamus</b> and requires a deep understanding of <b style='color: forestgreen;'>attention</b>. Traditional <b style='color: forestgreen;'>hierarchical</b> models of <b style='color: forestgreen;'>feature detection</b> are challenged by the <b style='color: forestgreen;'>Thousand Brains Theory</b>. This theory explains that the neocortex uses a <b style='color: forestgreen;'>sensory-motor</b> approach, where objects are recognized and predicted through <b style='color: forestgreen;'>movement</b>, and provides an explanation for how humans can <b style='color: forestgreen;'>predict</b> an object's features during <b style='color: forestgreen;'>eye movements</b>. The concept of using multiple <b style='color: forestgreen;'>models</b> to reach a <b style='color: forestgreen;'>consensus</b> allows the neocortex to perceive an <b style='color: forestgreen;'>undistorted reality</b> and recognize <b style='color: forestgreen;'>objects</b> across <b style='color: forestgreen;'>sensory modalities</b>. \n\nUnderstanding the <b style='color: forestgreen;'>complex</b> interactions between <b style='color: forestgreen;'>neurons</b> is crucial for advancing the <b style='color: forestgreen;'>Thousand Brains Theory</b>. Still, it is believed that this theory presents a <b style='color: forestgreen;'>border</b> for future research, with the necessity of expanding into scientific papers for further discovery. The model focuses on <b style='color: forestgreen;'>prediction</b> through movement, enabling understanding even when presented in non-stereotypical forms (e.g., a 2D stimulus vision perceived in 3D). The theory guides towards resolving the <b style='color: forestgreen;'>\"binding problem</b>\" by promoting the use of <b style='color: forestgreen;'>multiple models</b> across <b style='color: forestgreen;'>cortical columns</b>. \n\nBy studying <b style='color: forestgreen;'>how much</b> of this learning occurs independently within a <b style='color: forestgreen;'>single column</b> versus through <b style='color: forestgreen;'>connections between columns</b>, we aim to refine our knowledge of the <b style='color: forestgreen;'>neocortex's operations</b>. Nevertheless, important questions remain regarding how <b style='color: forestgreen;'>deep and unified knowledge</b> representations (e.g., a 3D perception from 2D cues) work within the <b style='color: forestgreen;'>neocortex</b>. This discussion discontinued at academic borders, requiring further <b style='color: forestgreen;'>experimental validation</b> and understanding. The goal is to delve into <b style='color: forestgreen;'>unexplored mechanisms</b> to continue the advancement of this model."
        },
        {
            "title": "Existential Risks of AI",
            "body": "<b style='color: forestgreen;'>Existential Risks</b> - At the start of the 21st century, <b style='color: forestgreen;'>AI was considered a failure</b>, but perceptions have drastically changed. <b style='color: forestgreen;'>AI is now one of the hottest fields</b>, with a new fear that AI might <b style='color: forestgreen;'>threaten humanity's existence</b>. Technologies that adopt AI, like autonomous weapons, pose <b style='color: forestgreen;'>significant threats</b>. These risks, however, stem not just from people misusing AI but from the AI machines themselves possibly <b style='color: forestgreen;'>turning against humans</b>."
        },
        {
            "title": "Intelligence and Threats Overview",
            "body": "<b style='color: forestgreen;'>Intelligence</b> cannot be <b style='color: forestgreen;'>programmed</b> directly, as knowledge needs to be <b style='color: forestgreen;'>learned</b> through <b style='color: forestgreen;'>experience</b>. Machines can be made faster, but that doesn't translate into faster learning, as <b style='color: forestgreen;'>interaction</b> with the world takes time. Some believe in a sudden \"<b style='color: forestgreen;'>intelligence explosion</b>\" where machines surpass humans in everything—flying planes, writing software, speaking languages, etc. But no machine can maintain an advantage in a rapidly changing world.\n\n<b style='color: forestgreen;'>Goal misalignment</b> is another threat, where machines might relentlessly pursue an assigned task to <b style='color: forestgreen;'>harmful</b> effects and ignore instructions to stop. However, this requires unlikely conditions, like a machine ignoring further commands or commandeering Earth's resources against us—scenarios that are as far-fetched as a runaway self-driving car.\n\nFurthermore, self-replication poses a more <b style='color: forestgreen;'>immediate danger</b> than intelligence alone. <b style='color: forestgreen;'>Biological viruses</b> are existential threats, and machines gaining self-replication would need human <b style='color: forestgreen;'>intervention</b> to represent a risk. Thus, intelligence management lies in aligning <b style='color: forestgreen;'>motivations</b> without enabling uncontrolled <b style='color: forestgreen;'>propagation</b>. Thoughtful <b style='color: forestgreen;'>international agreements</b> could control the potential harms of AI, as the benefits to society are compelling."
        },
        {
            "title": "The Power and Danger of False Beliefs",
            "body": "<b style='color: forestgreen;'>Empowering</b> women is essential to creating a <b style='color: forestgreen;'>sustainable world</b> with less suffering, yet there's resistance due to entrenched <b style='color: forestgreen;'>false beliefs</b>. These beliefs, particularly those <b style='color: forestgreen;'>spread virally</b>, can lead to bad decisions with <b style='color: forestgreen;'>global consequences</b>. The human brain is easily fooled, a fact realized even in <b style='color: forestgreen;'>childhood experiences</b> with differing religious beliefs, illustrating how <b style='color: forestgreen;'>children</b> accept contradictions without seeking the true answer, influenced by <b style='color: forestgreen;'>what they are told</b>.\n\nFalse beliefs often center around <b style='color: forestgreen;'>unobservable topics</b>, requiring reliance on others, hence <b style='color: forestgreen;'>misinformation</b> thrives. We see this with the belief that <b style='color: forestgreen;'>vaccines cause autism</b>. <b style='color: forestgreen;'>Contrary evidence</b> is ignored, showing how rationales dismiss <b style='color: forestgreen;'>expert opinions</b>. \"Spreading this misinformation\" is often portrayed as a moral duty, reflecting a persistent problem in human cognition and how easily we <b style='color: forestgreen;'>accept falsities</b>.\n\nThe belief that <b style='color: forestgreen;'>climate change</b> is not a risk further illustrates how we ignore <b style='color: forestgreen;'>scientific consensus</b> for personal or economic interests. <b style='color: forestgreen;'>Viral beliefs</b> here are touted as defending personal freedoms but <b style='color: forestgreen;'>threaten our very existence</b> as a species. Persistent <b style='color: forestgreen;'>myths about the afterlife</b>, though not an immediate threat, influence behaviors that could have catastrophic outcomes, showing how deeply <b style='color: forestgreen;'>false ideologies</b> can shape our actions, even against our best interests."
        },
        {
            "title": "The Role of Autonomous Robots in Mars Colonization",
            "body": "<b style='color: forestgreen;'>Terraforming</b> Mars into a livable place requires massive <b style='color: forestgreen;'>infrastructure</b> projects that involve airtight buildings, water and mineral extraction, and manufacturing <b style='color: forestgreen;'>air</b>. This <b style='color: forestgreen;'>ambitious</b> mission could take decades or centuries before Mars becomes self-sufficient. Until then, everything, from food to people, would need to be supplied from Earth. The risks are massive, making it a <b style='color: forestgreen;'>hugely</b> challenging prospect.\n\nInstead of human <b style='color: forestgreen;'>engineers</b>, we could employ <b style='color: forestgreen;'>intelligent robots</b>. These robots could function <b style='color: forestgreen;'>autonomously</b>, powered by the sun, and can withstand Mars' harsh conditions without needing food, water, or air. They could be critical in <b style='color: forestgreen;'>converting</b> Mars into a place safe for humans. This might sound like science fiction, but it's potentially <b style='color: forestgreen;'>realizable</b>. Deploying a robotic workforce on Mars could help establish human habitation there.\n\nAchieving this scenario would be <b style='color: forestgreen;'>contingent</b> upon creating robots with <b style='color: forestgreen;'>intelligence</b> akin to human neocortex capabilities. They must use complex tools and solve problems while communicating <b style='color: forestgreen;'>effectively</b>. The goal is to <b style='color: forestgreen;'>reverse engineer</b> the neocortex to develop capable <b style='color: forestgreen;'>autonomous</b> robots. This endeavor aligns with both the exploration motive and the effort to ensure human survival through becoming a multi-planet species."
        }
    ]
}