{
    "meta": {
        "title": "American Crusade: Our Fight to Stay Free",
        "author": "Pete Hegseth",
        "category": "Non-Fiction",
        "publisher": "Center Street",
        "pages": 283
    },
    "parts": [
        {
            "title": "Our American Crusade: Rallying Against the Left",
            "body": "<b style='color: forestgreen;'>\"Our American Crusade\"</b> delves into the deep <b style='color: forestgreen;'>political divide</b> in America after the <b style='color: forestgreen;'>2016 election</b>, drawing on a historical narrative to rally support against <b style='color: forestgreen;'>leftist ideologies</b> blamed for undermining the nation's <b style='color: forestgreen;'>soul and institutions</b>. The author calls for an <b style='color: forestgreen;'>American Crusade</b>, likening it to historical <b style='color: forestgreen;'>crusades and revolutions</b> as a defense against what is perceived as an existential threat posed by the Left. The piece contrasts two immigrant perspectives, highlighting a divergence in <b style='color: forestgreen;'>patriotism and gratitude</b> towards America. It emphasizes <b style='color: forestgreen;'>extreme loyalty</b> and champions <b style='color: forestgreen;'>Trump’s presidency</b> as critical for preserving America's essence.**"
        },
        {
            "title": "Understanding Americanism and Nationalism",
            "body": "Initially, <b style='color: forestgreen;'>Pete Hegseth</b> dismissed <b style='color: forestgreen;'>Donald Trump's</b> \"America first\" slogan as isolationism, reminding him of the <b style='color: forestgreen;'>America First Committee</b> before <b style='color: forestgreen;'>WWII</b>. <b style='color: forestgreen;'>Hegseth</b> believed it lacked foreign policy substance. Yet, with <b style='color: forestgreen;'>Trump's</b> nomination, <b style='color: forestgreen;'>Hegseth's</b> stance changed, recognizing \"America first\" as pivotal for <b style='color: forestgreen;'>US</b> actions, ensuring <b style='color: forestgreen;'>US strength</b> amidst global threats. <b style='color: forestgreen;'>Trump's</b> presidency emphasized evaluating actions through an <b style='color: forestgreen;'>America-first</b> lens, challenging elitists while resonating with patriots.\n\n<b style='color: forestgreen;'>Americanism</b> emerges as <b style='color: forestgreen;'>Hegseth's</b> antidote to leftism, centering on the <b style='color: forestgreen;'>US founding ideals</b>. <b style='color: forestgreen;'>Americanism</b> is defined as allegiance to individual freedom and equal justice, aligning with <b style='color: forestgreen;'>American nationalism</b>. The enemies of <b style='color: forestgreen;'>America</b> attack these ideas, perverting nationalism as <b style='color: forestgreen;'>racist</b> to undermine <b style='color: forestgreen;'>national sovereignty</b>. Exploring history and inherent human flaws, <b style='color: forestgreen;'>Hegseth</b> stresses <b style='color: forestgreen;'>Americanism</b> as the cornerstone of progress, from historical <b style='color: forestgreen;'>civil rights advancements</b> to modern technological developments. The challenges lie in preserving core principles, crucial against <b style='color: forestgreen;'>leftist</b> cultural and policy attacks."
        },
        {
            "title": "Founding Documents and Ideals vs. Leftist Agenda",
            "body": "## American Ideals vs. Leftist Reality\n\nThe <b style='color: forestgreen;'>difference</b> between the <b style='color: forestgreen;'>Declaration of Independence</b> and the <b style='color: forestgreen;'>Constitution</b> is crucial. While both are linked, the <b style='color: forestgreen;'>Declaration</b> provides America’s <b style='color: forestgreen;'>soul,</b> proclaiming principles like <b style='color: forestgreen;'>God-given</b> rights and the <b style='color: forestgreen;'>right to alter</b> government. In contrast, the <b style='color: forestgreen;'>Constitution</b> offers the <b style='color: forestgreen;'>structure</b> to uphold those ideals. <b style='color: forestgreen;'>Leftists</b> disregard the <b style='color: forestgreen;'>Declaration</b>, seeking a <b style='color: forestgreen;'>“living Constitution”</b> that can justify their control and suppress freedoms like the <b style='color: forestgreen;'>Second Amendment</b>. American founders ensured <b style='color: forestgreen;'>checks</b> against majority rule to protect individual rights. Contrastingly, leftists crave \"<b style='color: forestgreen;'>democracy</b>\" to quickly reshape society."
        },
        {
            "title": "Cultural Shift in Political Dynamics",
            "body": "<b style='color: forestgreen;'>Current cultural conflict</b> in the US Democratic party signals a <b style='color: forestgreen;'>struggle between older political power</b>, represented by figures like <b style='color: forestgreen;'>Nancy Pelosi</b>, and the <b style='color: forestgreen;'>rising influence of leftist figures</b> like <b style='color: forestgreen;'>AOC and Bernie Sanders</b>. While Pelosi has <b style='color: forestgreen;'>votes in Congress</b>, she lacks the appeal of the <b style='color: forestgreen;'>younger audience</b> who resonate with socialist rhetoric. This is seen as a <b style='color: forestgreen;'>cultural shift</b> where today's political establishment might not represent the <b style='color: forestgreen;'>soul of tomorrow</b>.\n\nThe conversation on <b style='color: forestgreen;'>leftism versus individual freedom</b> highlights the belief that <b style='color: forestgreen;'>collectivism and outdated welfare policies</b> don't work, exemplified by the <b style='color: forestgreen;'>Soviet Union's collapse</b>. Critics argue that a <b style='color: forestgreen;'>government-centered approach</b> stifles personal initiative and that <b style='color: forestgreen;'>true empowerment lies</b> in personal freedom and entrepreneurship. The <b style='color: forestgreen;'>failures of socialistic systems</b> point out that despite good intentions, <b style='color: forestgreen;'>overreliance on government</b> leads to inefficiencies and fosters a <b style='color: forestgreen;'>state of dependency</b>."
        },
        {
            "title": "NATO's Role and Criticism in Afghanistan",
            "body": "When I served in <b style='color: forestgreen;'>Afghanistan</b> under a <b style='color: forestgreen;'>NATO mission</b>, I was with the <b style='color: forestgreen;'>International Security Assistance Force (ISAF)</b>. Wearing an <b style='color: forestgreen;'>American flag</b> on one shoulder and an <b style='color: forestgreen;'>ISAF patch</b> on the other became a joke; as other troops from <b style='color: forestgreen;'>fifty countries</b> rarely engaged in combat compared to <b style='color: forestgreen;'>US troops</b>. At <b style='color: forestgreen;'>ISAF headquarters in Kabul</b> it was clear this was \"<b style='color: forestgreen;'>the United States’s war</b>\" with little support from allies. Their <b style='color: forestgreen;'>political limitations</b> on the battlefield meant others did not or could not fight. NATO seemed more like a <b style='color: forestgreen;'>defense arrangement for Europe</b>, funded largely by the <b style='color: forestgreen;'>US</b>, rather than a true alliance. \n\nIn <b style='color: forestgreen;'>Afghanistan</b>, it felt like <b style='color: forestgreen;'>America</b> was alone in combat, and the larger <b style='color: forestgreen;'>NATO alliance</b> did little when <b style='color: forestgreen;'>Russia</b>, led by <b style='color: forestgreen;'>Putin</b>, invaded <b style='color: forestgreen;'>Crimea</b>. Today's <b style='color: forestgreen;'>NATO</b> seems like a distraction, with <b style='color: forestgreen;'>European countries</b> not interested in rebuilding <b style='color: forestgreen;'>militaries</b> post-<b style='color: forestgreen;'>World War II</b>. <b style='color: forestgreen;'>Critics</b> argue it's still essential in dealing with an aggressive <b style='color: forestgreen;'>Russia</b>, claiming <b style='color: forestgreen;'>NATO</b> is vital for like-minded countries. But the perception on the ground was its limitations and the disparity in <b style='color: forestgreen;'>combat contributions</b>."
        },
        {
            "title": "Socialism: Misleading Promises vs. Capitalism",
            "body": "<b style='color: forestgreen;'>Socialism</b> is equated to taxing hard-working individuals more, redistributing their earnings to others via <b style='color: forestgreen;'>government control</b>. The <b style='color: forestgreen;'>author</b> argues that socialism could allure young people due to misleading notions of \"economic justice\". Schools might not highlight <b style='color: forestgreen;'>capitalism's merits</b> while presenting <b style='color: forestgreen;'>socialist ideas</b> favorably, driving a false narrative of fairness interpreted by politicians and educators. \n\nA <b style='color: forestgreen;'>discussion</b> with <b style='color: forestgreen;'>Gunner</b> uses <b style='color: forestgreen;'>rubber duckies</b> to illustrate issues like excessive production and overpricing affecting supply and demand. The talk evolves into <b style='color: forestgreen;'>political economy</b>, observing how <b style='color: forestgreen;'>governments</b> impact businesses and ultimately skew a free-market system towards <b style='color: forestgreen;'>socialism</b>."
        },
        {
            "title": "Elitism and Political Correctness",
            "body": "<h3 style='color: forestgreen;'>Elitism and Political Correctness</h3>\nVice President-elect Pence called Pete Hegseth to arrange a meeting with President-elect Trump, considering him for a role as <b style='color: forestgreen;'>Secretary of Veterans Affairs</b>. Despite Pete's previous criticism of Trump, his advocacy for veterans' issues had caught Trump's attention. During the meeting at Trump Tower, Trump humorously referenced Pete's earlier support for <b style='color: forestgreen;'>Marco Rubio</b>, nicknaming him \"Little Marco.\" Pete then complimented Trump on his nickname for Elizabeth Warren, <b style='color: forestgreen;'>\"Pocahontas\"</b>, and Trump explained his reasoning as a marketer. Trump's comments and approach highlight his strategy against <b style='color: forestgreen;'>political correctness</b>, which he believes limits free speech and maintains power for an elite class."
        },
        {
            "title": "Reclaiming Control from Elites",
            "body": "The <b style='color: forestgreen;'>elites</b> are seen as those who think they are better than others, using complex language to confuse and control. The <b style='color: forestgreen;'>media</b> and <b style='color: forestgreen;'>tech oligarchies</b> are criticized for promoting <b style='color: forestgreen;'>left-wing</b> ideologies and silencing <b style='color: forestgreen;'>conservatives</b>. This section highlights the <b style='color: forestgreen;'>hypocrisy</b> of the <b style='color: forestgreen;'>elites</b>, who want control through <b style='color: forestgreen;'>political correctness</b>. When people are silenced or censored, like on <b style='color: forestgreen;'>social media</b>, it's viewed as controlling speech to maintain elite power. The speaker encourages <b style='color: forestgreen;'>laughing</b> at and <b style='color: forestgreen;'>mocking</b> these controls to regain freedom.\n\nThe chapter argues for rejecting <b style='color: forestgreen;'>elitism</b> and political correctness, viewing them as forms of <b style='color: forestgreen;'>authoritarianism</b>. It promotes <b style='color: forestgreen;'>free speech</b> and questioning the narrative pushed by elites, urging people to follow <b style='color: forestgreen;'>Trump's example</b> in standing against elitist values. Emphasizing <b style='color: forestgreen;'>American values</b> and unity is contrasted against the divisive nature of political correctness. The text calls for empowering the \"real elite,\" everyday Americans, against what is perceived as <b style='color: forestgreen;'>elitist ridicule</b>."
        },
        {
            "title": "Understanding Esmatullah's Beliefs & The Threat of Islamism",
            "body": "<b style='color: forestgreen;'>Esmatullah</b> was an interpreter in <b style='color: forestgreen;'>Afghanistan</b> during the author's deployment. Although <b style='color: forestgreen;'>Esmat</b> was a regular <b style='color: forestgreen;'>Muslim</b>, not a <b style='color: forestgreen;'>radical Islamist</b>, he believed that <b style='color: forestgreen;'>Islam</b> would rule the world due to high birth rates. <b style='color: forestgreen;'>Islamism</b>, derived from the <b style='color: forestgreen;'>Quran</b>, is perceived as a significant threat to freedom, being aggressive and evangelical. Many <b style='color: forestgreen;'>Westerners</b> mistakenly view <b style='color: forestgreen;'>Islam</b> as a \"religion of peace,\" overlooking the aggressive nature of <b style='color: forestgreen;'>Islamism</b>. In reality, while <b style='color: forestgreen;'>peaceful Muslims</b> exist, <b style='color: forestgreen;'>Islamism</b> seeks the domination of <b style='color: forestgreen;'>Islamic</b> ideals globally.\n\n<b style='color: forestgreen;'>Islamism</b> uses the beliefs of moderate <b style='color: forestgreen;'>Muslims</b> to spread its <b style='color: forestgreen;'>radical agenda</b>. Despite the presence of non-radical <b style='color: forestgreen;'>Muslims</b>, <b style='color: forestgreen;'>Islamism</b> is deeply rooted in the core teachings of <b style='color: forestgreen;'>Islam</b>, making it difficult to separate from the <b style='color: forestgreen;'>moderate interpretation</b>. Islamists aim to impose <b style='color: forestgreen;'>Islam</b> on others, a mission reflecting <b style='color: forestgreen;'>Muhammad’s</b> life and Quranic teachings. This poses a challenge as Islam doesn't have a \"New Testament\" equivalent, meaning no substantial reform shift akin to <b style='color: forestgreen;'>Christianity's transformation</b>. Therefore, <b style='color: forestgreen;'>Islamism</b> is not just religious but also a political system incompatible with any other. With <b style='color: forestgreen;'>Saudi Arabian</b> funding, groups like the <b style='color: forestgreen;'>Muslim Brotherhood</b> advance <b style='color: forestgreen;'>Islamist missions</b>, posing significant challenges to Western freedoms."
        },
        {
            "title": "The Evolution and Defense of Western Civilization",
            "body": "This passage delves into the concept of <b style='color: forestgreen;'>western civilization</b> through the prism of <b style='color: forestgreen;'>Christianity's</b> evolution and the <b style='color: forestgreen;'>ongoing battles</b> it has faced. Initially, Christianity spread peacefully but, due to <b style='color: forestgreen;'>persecution</b>, took a militaristic stance under <b style='color: forestgreen;'>Constantine the Great</b>. The text contrasts <b style='color: forestgreen;'>Christianity</b> and <b style='color: forestgreen;'>Islam</b>, noting that while Christianity initially propagated through love and faith, <b style='color: forestgreen;'>Islam</b> spread through <b style='color: forestgreen;'>jihad and warfare</b>. By the <b style='color: forestgreen;'>11th century</b>, the imminent threat from <b style='color: forestgreen;'>Islam</b> led to the <b style='color: forestgreen;'>Crusades</b> as a defensive measure to protect <b style='color: forestgreen;'>Christian faith and territories</b>.\n\nThe piece also argues that leftists today would argue for \"diplomacy\" much like peaceful negotiations, ignoring the <b style='color: forestgreen;'>historical necessity</b> of the <b style='color: forestgreen;'>Crusades</b>. Leftists are portrayed as unwilling to accept the value of what <b style='color: forestgreen;'>Crusaders</b> accomplished for the <b style='color: forestgreen;'>modern world</b>, such as preserving <b style='color: forestgreen;'>Western civilization</b> and ultimately enabling phenomena like the <b style='color: forestgreen;'>Protestant Reformation</b> and the <b style='color: forestgreen;'>Renaissance</b>. This sets the stage for the \"American Crusade,\" encouraging readers to fight for <b style='color: forestgreen;'>Christian and American values</b>."
        }
    ]
}