{
    "meta": {
        "title": "Anthropologies and Futures: Researching Emerging and Uncertain Worlds",
        "author": "Juan Francisco Salazar, Sarah Pink, Andrew Irving, Johannes Sjöberg",
        "publisher": "Bloomsbury Academic",
        "pages": 275
    },
    "parts": [
        {
            "title": "Futures Anthropologies Manifesto",
            "body": "The <b style='color: forestgreen;'>\"Futures Anthropologies Manifesto\"</b> is an effort by the European Association of Social Anthropologists to reimagine anthropology's role in addressing future challenges. Written at a 2014 conference, this <b style='color: forestgreen;'>10-point manifesto</b> highlights how anthropologists can <b style='color: forestgreen;'>embrace uncertainty</b>, transcend traditional boundaries, and <b style='color: forestgreen;'>engage with complex futures</b> through collaboration and innovation. It calls for a shift from focusing solely on the past to also considering potential futures, emphasizing a move towards <b style='color: forestgreen;'>participatory and ethical interventions</b>. This approach seeks to maintain anthropology's critical core while opening it up to a more active role in contemporary world-making."
        },
        {
            "title": "Imaginative Spaces and Temporal Connections",
            "body": "<h3 style='color: forestgreen;'>Imaginative Spaces and Connections</h3>\n\nThis section delves into how our <b style='color: forestgreen;'>imaginative faculties</b> create connections between images, like seeing two photographs and constructing a <b style='color: forestgreen;'>narrative</b> that fills the gaps. Aristotle's idea that <b style='color: forestgreen;'>thinking combines imagination and judgment</b> suggests a <b style='color: forestgreen;'>narrative bridge</b> built through our capacity to <b style='color: forestgreen;'>associate events</b> over time. This process not only involves <b style='color: forestgreen;'>creative associations</b> across space and time but also points to how events become <b style='color: forestgreen;'>metaphorically linked</b> in our minds.\n\n<h3 style='color: forestgreen;'>Temporal Connections and Everyday Decisions</h3>\n\nThe focus shifts to how simple <b style='color: forestgreen;'>everyday decisions</b>, like turning left or right, can intertwine with large-scale events, impacting lives and creating a <b style='color: forestgreen;'>complex interplay</b> between <b style='color: forestgreen;'>personal actions</b> and <b style='color: forestgreen;'>global events</b>. This highlights <b style='color: forestgreen;'>anthropology's challenge</b> in understanding the interconnectedness of <b style='color: forestgreen;'>people's futures</b> and global scales. The chapter underscores the need for an <b style='color: forestgreen;'>empirical and ethnographic</b> approach to grasp how actions define possibilities and constraints of lives across the globe.\n\n<h3 style='color: forestgreen;'>Revisiting Sandra's Story</h3>\n\nReturning to the images, the narrative focuses on <b style='color: forestgreen;'>Sandra Kyagaba</b>, an HIV+ activist in Uganda, holding a picture of herself from <b style='color: forestgreen;'>September 11, 2001</b>. Her narrative captures the <b style='color: forestgreen;'>temporal interplay</b> of personal hardship and global crises, symbolizing how <b style='color: forestgreen;'>individual experiences</b> are part of a broader <b style='color: forestgreen;'>historical context</b>. Sandra's story highlights how <b style='color: forestgreen;'>personal narratives</b> reshape over time, intertwining with global events, emphasizing that even <b style='color: forestgreen;'>life histories</b> can involve remembering and <b style='color: forestgreen;'>rethinking past events</b> from the vantage point of unforeseeable futures."
        },
        {
            "title": "Imagination, Memory, and Global Events Connection",
            "body": "<b style='color: forestgreen;'>Andrew Irving</b> discusses the <b style='color: forestgreen;'>role of imagination</b> and <b style='color: forestgreen;'>memory in constructing narratives</b> by examining two photos related to <b style='color: forestgreen;'>September 11</b>, 2001. One shows <b style='color: forestgreen;'>Sandra Kyagaba</b>, an HIV+ Ugandan activist, who holds a picture of her younger self, taken on 9/11, signifying a <b style='color: forestgreen;'>temporal interplay</b> with her <b style='color: forestgreen;'>past and future</b>. The other photo captures the exact moment of the second plane hitting the <b style='color: forestgreen;'>World Trade Center</b>, illustrating the <b style='color: forestgreen;'>global impacts on individual lives</b>.\n\nHe explores the <b style='color: forestgreen;'>embodiment and decision-making processes</b> individuals go through daily, such as simple decisions like turning left or right, and how these actions connect <b style='color: forestgreen;'>individual lives to broader global events</b>. <b style='color: forestgreen;'>Sandra's life journey</b>, detailed through a tracking method called \"<b style='color: forestgreen;'>Life Journeys Method</b>,\" highlights how personal histories entwine with larger narratives, <b style='color: forestgreen;'>bridging past and future</b>. This method involves <b style='color: forestgreen;'>physically retracing life paths</b> and noting new memories and thoughts that arise.\n\nThrough <b style='color: forestgreen;'>Sandra's story</b>, which moves from a <b style='color: forestgreen;'>comfortable childhood</b> to facing <b style='color: forestgreen;'>HIV infection</b>, Irving emphasizes the <b style='color: forestgreen;'>ethnographic connection between actions, contingency, and future</b>. This narrative approach considers how ordinary events and decisions intertwine with <b style='color: forestgreen;'>larger geopolitical happenings</b>, illustrating the <b style='color: forestgreen;'>ethnographic and anthropological avenues</b> available for understanding <b style='color: forestgreen;'>contemporary global connectedness</b> and future possibilities."
        },
        {
            "title": "Sandra's Turning Point: From Despair to Activism",
            "body": "After Sandra discovered she was HIV positive, her situation grew worse as her late boyfriend’s family took her daughter, fearing Sandra’s impending death. Sandra felt devastated and had given up hope until she heard <b style='color: forestgreen;'>Major Rubaramira Ruranga</b> on the radio share how he publicly declared his HIV status and now assists those diagnosed. Inspired, Sandra contacted the major, who helped restore her faith and become an <b style='color: forestgreen;'>HIV/AIDS activist</b> herself.\n\nOn <b style='color: forestgreen;'>11 September 2001</b>, while attending a women’s conference and sharing her story, Sandra met <b style='color: forestgreen;'>Emily Bass</b>, an organizer and journalist from New York. Emily comforted Sandra but wasn’t aware of the bad news that Sandra's <b style='color: forestgreen;'>CD4 count</b> was critically low. This unexpected intersection later led to Emily’s family deciding to fund Sandra’s antiretroviral medication, saving her life, highlighting how life’s contingency can radically alter futures.\n\nThis narrative exemplifies how the introduction of <b style='color: forestgreen;'>antiretroviral treatments</b> revolutionized HIV/AIDS lives, often depending on geopolitical status. Despite having life-saving treatments in the West, African countries faced economic barriers. Sandra’s experience underscores the disparity and how small decisions, like <b style='color: forestgreen;'>turning left</b>, could lead to monumental changes in life."
        },
        {
            "title": "Narratives of Autistic Futures: Insights and Advocacy",
            "body": "<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Contributions of Autistic Narratives in Envisioning Futures</b></h3>\n\nThe <b style='color: forestgreen;'>Autistic Self Advocacy Network (ASAN)</b> plays a vital role in expanding autistic futures through their <b style='color: forestgreen;'>publication \"Loud Hands: Autistic People, Speaking\".</b> Bascom highlights how autistic individuals often face \"<b style='color: forestgreen;'>abuse and silencing</b>\" frequently heard as \"Quiet hands\" in education sectors. \"Loud Hands\" signifies resisting these barriers by communicating in inherently <b style='color: forestgreen;'>autistic ways</b> and asserting the dignity of <b style='color: forestgreen;'>autistic voices.</b> This project aligns with creative visions focused on a <b style='color: forestgreen;'>\"radically inclusive future\"</b> fueled by increasing numbers and <b style='color: forestgreen;'>engagement</b> within the autistic community and its supporters.\n\n<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Parental and First-Person Accounts in Disability Narratives</b></h3>\nParental memoirs, such as Ron Suskind’s <b style='color: forestgreen;'>\"Life Animated,\"</b> offer profound insights into familial journeys with autism, showcasing unique <b style='color: forestgreen;'>communication pathways</b> through memorized <b style='color: forestgreen;'>Disney scripts.</b> These narratives grant autistic individuals and their families <b style='color: forestgreen;'>alternative futures</b> filled with acceptance and kinship. Similarly, first-person accounts like <b style='color: forestgreen;'>Temple Grandin’s</b> and <b style='color: forestgreen;'>Donna Williams’</b> writings have sparked wider awareness, encouraging people with ASD to articulate <b style='color: forestgreen;'>their stories,</b> thus shaping future perceptions of <b style='color: forestgreen;'>autism and disability.</b>\n\n<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Exploring Multiple Futures through Literature and Networks</b></h3>\nWorks by <b style='color: forestgreen;'>autistic advocates</b> contribute to societal understanding by bridging the gap between narratives and numbers. These narratives offer a fresh lens on <b style='color: forestgreen;'>future-making that challenges mainstream disability discourses</b>. With the support of <b style='color: forestgreen;'>expanding disability publics,</b> they aim for a future where autism is <b style='color: forestgreen;'>embraced</b> within society as a <b style='color: forestgreen;'>\"new normal,\"</b> strongly backed by powerful narratives and demographic realities. Thus, envisioning <b style='color: forestgreen;'>autistic futures</b> becomes a dynamic process intertwined with ongoing political and narrative evolution."
        },
        {
            "title": "Pyrenean Rewilding and Future Ethnographies",
            "body": "<h3 style='color: forestgreen;'>Pyrenean Rewilding and Ontological Landscapes: A Future Ethnographic Approach</h3>\n\nThe <b style='color: forestgreen;'>Pyrenean pastoralists</b> face conflicts due to the <b style='color: forestgreen;'>re-introduction of bears and wolves</b>. Conservationists argue for rewilding to <b style='color: forestgreen;'>combat biodiversity loss</b> during the Anthropocene, a new geological epoch marked by significant human impact on the Earth, including <b style='color: forestgreen;'>global climate change</b> and <b style='color: forestgreen;'>biological extinction</b>. This scenario places humans in a <b style='color: forestgreen;'>shadow of potential catastrophe</b>.\n\n<b style='color: forestgreen;'>Anthropology</b> reaches beyond being just a witness to present issues, urging <b style='color: forestgreen;'>engagement with future challenges</b> of the Anthropocene. A <b style='color: forestgreen;'>future-oriented approach</b> incorporates both ethnographic field subjects and state institutions to engage actively with <b style='color: forestgreen;'>future worldmaking</b>. In the context of the <b style='color: forestgreen;'>French Pyrenees</b>, tensions arise between traditional pastoralists and modernization efforts advocating for eco-tourism and less human-predator conflict.\n\nEthnographic research in the Pyrenees highlights conflicts between <b style='color: forestgreen;'>'traditional' pastoralists and ecologists</b> aiming for landscape rewilding. Conservationists envision a future where these species help <b style='color: forestgreen;'>maintain ecosystem balance</b>, but <b style='color: forestgreen;'>pastoralists argue</b> this threatens their way of life. This conflict is analyzed through <b style='color: forestgreen;'>ethnographic questioning</b>—allowing locals to express their projections into a <b style='color: forestgreen;'>future world</b>, reflecting both <b style='color: forestgreen;'>environmental and socio-political challenges</b>."
        },
        {
            "title": "Amal's Navigating Transnational Custody and Resilience",
            "body": "<b style='color: forestgreen;'>Amal</b>, a woman dealing with the <b style='color: forestgreen;'>kidnapping</b> of her daughter <b style='color: forestgreen;'>Isra</b>, faced <b style='color: forestgreen;'>legal barriers</b> and complex interpersonal dynamics. Despite the attempts to engage Danish <b style='color: forestgreen;'>authorities</b>, she found little support due to jurisdictional limitations. Her journey highlights the challenges of navigating <b style='color: forestgreen;'>international laws</b> governing child custody involving <b style='color: forestgreen;'>multiple nations</b> and cultures. \n\nInstead of direct actions that might oppose her family's wishes, Amal turned to <b style='color: forestgreen;'>patience</b> and <b style='color: forestgreen;'>faith</b> as strategies, showcasing a commitment to <b style='color: forestgreen;'>sabr</b> – an <b style='color: forestgreen;'>Islamic virtue</b> of <b style='color: forestgreen;'>patience</b> and reliance on <b style='color: forestgreen;'>God's plan</b>. This approach was necessary not only to potentially reunite with her daughter but to maintain essential familial relationships and support systems. Within this <b style='color: forestgreen;'>framework</b> of enduring <b style='color: forestgreen;'>hardships</b>, Amal integrated <b style='color: forestgreen;'>religious practices</b> into her coping mechanism, demonstrating how digital technologies provided an avenue to maintain <b style='color: forestgreen;'>connections</b> and express <b style='color: forestgreen;'>yearnings</b> for reunification.\n\nAmal's interactions via digital platforms reveal layers of her lived <b style='color: forestgreen;'>realities and dreams</b>, where technology served as a tool to <b style='color: forestgreen;'>broadcast</b> her emotional <b style='color: forestgreen;'>turmoil</b> and <b style='color: forestgreen;'>hope</b>. Meanwhile, the text explores how the <b style='color: forestgreen;'>imaginal realm</b> distills <b style='color: forestgreen;'>visions</b> and <b style='color: forestgreen;'>emotions</b> beyond conventional space-time, providing a <b style='color: forestgreen;'>spiritual perspective</b> on navigating the uncertainties around the future. Ultimately, Amal's story is both a <b style='color: forestgreen;'>testament</b> to resilience and a critique of <b style='color: forestgreen;'>institutional inefficacy</b> in <b style='color: forestgreen;'>transnational</b> familial disputes."
        },
        {
            "title": "Exploring Futures Anthropology in Antarctica",
            "body": "In this chapter, Salazar introduces an approach to <b style='color: forestgreen;'>ethnographic</b> research focused on exploring <b style='color: forestgreen;'>Antarctica</b> as a site for understanding future <b style='color: forestgreen;'>human habitation</b> in extreme environments. His work involves \n\n1. The making of a <b style='color: forestgreen;'>documentary film</b>, \"Nightfall on Gaia,\" which acts as an example of how <b style='color: forestgreen;'>futures anthropology</b> can be creatively pursued. This film uses a mix of <b style='color: forestgreen;'>fictional and real elements</b> to engage with the <b style='color: forestgreen;'>speculative potential</b> of life on the Antarctic continent.\n\n2. His research emphasizes how transient communities in Antarctica perceive their environment, charting future possibilities through a lens of <b style='color: forestgreen;'>anticipatory and speculative narratives</b>. This approach highlights how <b style='color: forestgreen;'>humans and other species</b> come together in this unique environment, raising crucial questions about collaboration and habitation.\n\n3. Salazar’s work illustrates a method of \"<b style='color: forestgreen;'>speculative fabulation</b>,\" a concept inspired by <b style='color: forestgreen;'>Donna Haraway</b>, which suggests a creative form of <b style='color: forestgreen;'>narrating the possible</b> as a method for discussing real-world implications of extreme environmental <b style='color: forestgreen;'>conditions and future socialities</b>. This involves envisioning <b style='color: forestgreen;'>Antarctic worlds</b> not just as they are, but as they could be, embracing a <b style='color: forestgreen;'>future-oriented anthropology</b> that embodies hope and imagination."
        },
        {
            "title": "Understanding Future Perceptions through Ethno Science Fiction",
            "body": "The chapter discusses how applying <b style='color: forestgreen;'>ethno science fiction</b> as an ethnographic method can help understand how <b style='color: forestgreen;'>British youth</b> perceive future <b style='color: forestgreen;'>environmental threats</b>. This is illustrated through a film project where James, living in a flood-prone neighborhood, imagines his future using <b style='color: forestgreen;'>improvised phone calls</b> to his future selves, exploring themes of climate <b style='color: forestgreen;'>change</b>, social <b style='color: forestgreen;'>transformation</b>, and personal <b style='color: forestgreen;'>aspirations</b>.\n\nEthno science fiction combines <b style='color: forestgreen;'>ethnographic research</b> with <b style='color: forestgreen;'>creative practices</b> like improvisation, allowing people to critically engage with scientific predictions. It challenges traditional methods by focusing on speculative elements to <b style='color: forestgreen;'>trigger imagination</b> and <b style='color: forestgreen;'>possibilities</b>. The approach connects <b style='color: forestgreen;'>fiction with practice</b>, helping individuals explore potential futures and how these visions impact present understanding.\n\nInfluenced by Jean Rouch's <b style='color: forestgreen;'>ethnofictions</b> and <b style='color: forestgreen;'>Peter Watkins'</b> documentary dramas, the method reflects a <b style='color: forestgreen;'>process of dreaming</b> and <b style='color: forestgreen;'>improvisation</b> that draws on real-life experiences and utopias. It allows participants to navigate their lives, balancing the <b style='color: forestgreen;'>dystopian</b> and <b style='color: forestgreen;'>utopian</b> visions through a <b style='color: forestgreen;'>liminal space</b>, which helps in charting personal paths. Thus, it offers a distinct tool to capture <b style='color: forestgreen;'>individual perspectives</b> and possible futures in response to societal and environmental challenges."
        },
        {
            "title": "Exploring Future Imaginations of Migrants",
            "body": "<b style='color: forestgreen;'>Alex</b> is conducting <b style='color: forestgreen;'>research</b> with <b style='color: forestgreen;'>Egyptian migrants</b> in Milan to explore how their perceptions of the <b style='color: forestgreen;'>future</b> influence their <b style='color: forestgreen;'>narratives</b> of lived experiences. An important focus is how the <b style='color: forestgreen;'>future</b> is seen through <b style='color: forestgreen;'>dreams, hopes,</b> and <b style='color: forestgreen;'>fears</b>, becoming tangible in their <b style='color: forestgreen;'>daily actions</b> and <b style='color: forestgreen;'>stories</b>. The <b style='color: forestgreen;'>future</b> gives them a sense of <b style='color: forestgreen;'>direction</b> and is crucial for <b style='color: forestgreen;'>redefining</b> who they are.\n\nOne participant, <b style='color: forestgreen;'>Mahmud</b>, starts imagining a better future when his <b style='color: forestgreen;'>legal status</b> changes, allowing him to work and dream of returning home seen through his <b style='color: forestgreen;'>imagination</b>. These dreams align with his daily <b style='color: forestgreen;'>dedication</b> to build a better future, making hardships like the <b style='color: forestgreen;'>Mediterranean crossing</b> meaningful.\n\nAlex uses <b style='color: forestgreen;'>various methods</b>, including <b style='color: forestgreen;'>creative workshops</b> and <b style='color: forestgreen;'>ethnofiction filmmaking</b>, to show how the imagined <b style='color: forestgreen;'>future</b> takes form and influences the present actions of migrants. These <b style='color: forestgreen;'>methods</b> reveal the <b style='color: forestgreen;'>significance</b> of imaginative processes in their lives and challenge <b style='color: forestgreen;'>static</b> ethnographic methodologies by creatively engaging with <b style='color: forestgreen;'>imaginative possibilities.</b>"
        },
        {
            "title": "Remix and Future-Oriented Anthropology",
            "body": "<b style='color: forestgreen;'>Remix</b> is seen as a way to rethink <b style='color: forestgreen;'>anthropological practice</b> by drawing on <b style='color: forestgreen;'>cool strategies</b> like integration and generating dialogue among various <b style='color: forestgreen;'>disciplines</b>. This approach applies concepts from <b style='color: forestgreen;'>hip-hop</b> culture to academia, suggesting that <b style='color: forestgreen;'>\"remix methodology\"</b> can transform how we understand the <b style='color: forestgreen;'>world</b> by crafting new <b style='color: forestgreen;'>cultural meanings</b> through <b style='color: forestgreen;'>sampling</b> and <b style='color: forestgreen;'>hybridization</b>. This <b style='color: forestgreen;'>method</b> emphasizes <b style='color: forestgreen;'>creative agency</b> and encourages collaboration across different <b style='color: forestgreen;'>disciplines</b> and <b style='color: forestgreen;'>cultures</b>.\n\nDuring remixing, original elements are <b style='color: forestgreen;'>recontextualized</b>, producing <b style='color: forestgreen;'>nuanced meanings</b> with <b style='color: forestgreen;'>possible connections</b>. This process encourages <b style='color: forestgreen;'>adaptive thinking</b> and challenges static <b style='color: forestgreen;'>scientific models</b> by incorporating multiple <b style='color: forestgreen;'>perspectives</b> and reflecting on the <b style='color: forestgreen;'>temporary</b> and evolving nature of <b style='color: forestgreen;'>knowledge</b>. Scholars are thus encouraged to embrace a <b style='color: forestgreen;'>\"third space\"</b> for innovative <b style='color: forestgreen;'>thinking</b> between private and work life, symbolizing a space for <b style='color: forestgreen;'>collaborations</b> that consider creative and speculative aspects of <b style='color: forestgreen;'>future possibilities</b>.\n\nBy integrating <b style='color: forestgreen;'>remix practices</b>, anthropologists are nudged to appreciate <b style='color: forestgreen;'>imaginative methodologies</b> that can heavily influence <b style='color: forestgreen;'>future-oriented studies</b>, inviting <b style='color: forestgreen;'>transdisciplinary</b> research opportunities. This invitation urges us to engage in <b style='color: forestgreen;'>public anthropology</b> and consider how our <b style='color: forestgreen;'>insights</b> can not only reflect but <b style='color: forestgreen;'>intervene</b> in shaping possible futures, essentially acting as catalyst for significant <b style='color: forestgreen;'>social change</b>."
        }
    ]
}