{
    "meta": {
        "title": "Bad News: How Woke Media Is Undermining Democracy",
        "author": "Batya Ungar-Sargon",
        "category": "Mass media and politics",
        "publisher": "Encounter Books",
        "pages": 256
    },
    "parts": [
        {
            "title": "Introduction of \"Bad News\" Summary",
            "body": "In 2018, CNN's Don Lemon hosted a panel about <b style='color: forestgreen;'>white women</b> voting for <b style='color: forestgreen;'>Trump</b>. <b style='color: forestgreen;'>Kirsten Powers</b> called such women <b style='color: forestgreen;'>racist</b> for supporting Trump over <b style='color: forestgreen;'>Hillary Clinton</b>. <b style='color: forestgreen;'>Stephanie Jones-Rogers</b> linked this to a historical context, and <b style='color: forestgreen;'>Alice Stewart</b> opposed the racism label. This discussion reflects a <b style='color: forestgreen;'>moral panic</b> on <b style='color: forestgreen;'>race</b> that has spread from <b style='color: forestgreen;'>academics</b> to the <b style='color: forestgreen;'>mainstream media</b>, painting the US as <b style='color: forestgreen;'>systemically racist</b>. While once a <b style='color: forestgreen;'>blue-collar</b> field, journalism has shifted towards an <b style='color: forestgreen;'>elite</b> status, focusing more on <b style='color: forestgreen;'>identity</b> over <b style='color: forestgreen;'>economic inequality</b>. This shift highlights the media's role in obscuring <b style='color: forestgreen;'>class inequalities</b> using racial discourse, aligning with the interests of the <b style='color: forestgreen;'>affluent liberal elite</b>."
        },
        {
            "title": "Abandonment of Working Class by Media",
            "body": "The <b style='color: forestgreen;'>media powerhouse</b> New York Times was central to formulating a tone that was seen as <b style='color: forestgreen;'>disastrous</b> in the industry. This tone contributed to how <b style='color: forestgreen;'>liberal media</b> disregarded the <b style='color: forestgreen;'>working class</b>, while conservative outlets catered to them, albeit with their own biases. The <b style='color: forestgreen;'>economic struggles</b> and <b style='color: forestgreen;'>cultural concerns</b> of the working class, who value family and faith over resumes, were overlooked. A journalism that addresses this <b style='color: forestgreen;'>class divide</b>, rather than hiding it, is crucial for a functioning democracy. Instead, today's press often sides with <b style='color: forestgreen;'>powerful elites</b> rather than holding them accountable, worsening <b style='color: forestgreen;'>inequality</b> and undermining democracy."
        },
        {
            "title": "The Respectability and Elite Readership of the New York Times",
            "body": "<b style='color: forestgreen;'>Henry Raymond</b>, founder of the <b style='color: forestgreen;'>New York Times</b>, was known for his bourgeois politics of respectability. He made the paper serious, conservative, and focused on legal, commercial, and financial transactions, aiming at the <b style='color: forestgreen;'>middle and upper classes</b>. The Times gained many readers from respectable families and emphasized <b style='color: forestgreen;'>civility</b> and <b style='color: forestgreen;'>dignity</b>, despite Raymond personally opposing laws like the Fugitive Slave Act and keeping his editorial page weak to maintain neutrality. This reflected a preference for <b style='color: forestgreen;'>conservative societal views</b> and respectability over broader populist appeal, paving the way for a specific upper-middle-class readership.\n\n<b style='color: forestgreen;'>Adolph Ochs</b> bought the Times in 1896 and maintained its <b style='color: forestgreen;'>respectability</b> while appealing to the social elite, though being Jewish posed a social barrier. He focused the paper’s content on business and international news, avoiding scandal and tailoring it to <b style='color: forestgreen;'>affluent</b> New Yorkers. Under Ochs’s guidance, the Times thrived, targeting those with expensive tastes, unlike Joseph Pulitzer's readers. This <b style='color: forestgreen;'>model of cultivating elite readership</b> became profitable, attracting similar ventures, such as the New Yorker. The magazine catered to the wealthy urbanites, making clear that it wasn’t for the <b style='color: forestgreen;'>working class</b>, thus securing profitable high-end advertising. This elitism in content and audience prevailed, reinforcing the <b style='color: forestgreen;'>economic divide</b> within journalism."
        },
        {
            "title": "Journalism's Class Shift & Media Polarization",
            "body": "A <b style='color: forestgreen;'>survey</b> in 2018 revealed that around 65% of <b style='color: forestgreen;'>news interns</b> at top outlets like <b style='color: forestgreen;'>Wall Street Journal</b>, <b style='color: forestgreen;'>New York Times</b>, and others, came from highly <b style='color: forestgreen;'>selective schools</b>. This pattern holds for many high-profile journalists too, forming an <b style='color: forestgreen;'>exclusive network</b>. These media organizations once included <b style='color: forestgreen;'>local and accessible reporting</b> but have shifted to cater predominantly to <b style='color: forestgreen;'>higher-class and educated audiences</b>. This has led to a <b style='color: forestgreen;'>disconnect</b> from the general American public and an increased focus on an <b style='color: forestgreen;'>elite perspective</b>. \n\nBy the 1970s, news began targeting more <b style='color: forestgreen;'>specific, affluent audiences</b> rather than the <b style='color: forestgreen;'>working class</b>. This decline in class-based reporting was part of a broader industry shift towards <b style='color: forestgreen;'>market-driven</b> news, influenced heavily by <b style='color: forestgreen;'>advertising demands</b>. Subsequently, significant parts of the <b style='color: forestgreen;'>working class</b> felt <b style='color: forestgreen;'>underrepresented</b>, which media like <b style='color: forestgreen;'>conservative outlets</b> then effectively addressed, filling the void left by mainstream media abandoning these communities. This shift <b style='color: forestgreen;'>exacerbated class divides</b> in media consumption, aligning audience preferences along <b style='color: forestgreen;'>education and class lines</b> as much as political ones."
        },
        {
            "title": "Far-Right Media's Often Misguided Focus on Racism",
            "body": "<b style='color: forestgreen;'>Far-right media</b> like Breitbart caters to the <b style='color: forestgreen;'>Alt-Right</b>, <b style='color: forestgreen;'>linking</b> people of color with <b style='color: forestgreen;'>crime</b>. Fox News has fired staff for overt racism, yet much outrage over its racism claims are often about questioning <b style='color: forestgreen;'>liberal policies</b> or criticizing figures of color. Criticism of Fox's racism sometimes overlooks its perspective that <b style='color: forestgreen;'>no race should receive \"special favors\"</b> from the government. This reflects a <b style='color: forestgreen;'>Republican</b> view and isn't exclusive to racial animosity. Many <b style='color: forestgreen;'>Critiques of Fox</b> suggest a class bias, <b style='color: forestgreen;'>ignoring</b> legitimate issues it highlights about <b style='color: forestgreen;'>class inequality.</b>"
        },
        {
            "title": "Shift in Media Narrative",
            "body": "In today's media landscape, <b style='color: forestgreen;'>race</b> and <b style='color: forestgreen;'>gender</b> dominate discussions, overshadowing class issues. This shift coincided with <b style='color: forestgreen;'>Obama's presidency</b> and the rise of digital news, as seen in data analyzed by <b style='color: forestgreen;'>David Rozado</b> and <b style='color: forestgreen;'>Zach Goldberg</b>. They pointed out a significant <b style='color: forestgreen;'>increase</b> in words like \"racism\" and \"white supremacy\" across major outlets like the New York Times, starting around <b style='color: forestgreen;'>2011</b>. This change is attributed to the <b style='color: forestgreen;'>younger generation</b> of journalists replacing traditional ones, bringing a more <b style='color: forestgreen;'>judgmental and ideological</b> perspective to reporting. At the Times, this shift was encouraged as part of a <b style='color: forestgreen;'>digital strategy</b> that valued social media presence and new digital talent over traditional reportage practices."
        },
        {
            "title": "Rise of Critical Race Theory and White Liberal Wokeness",
            "body": "<b style='color: forestgreen;'>Critical race theory</b> and <b style='color: forestgreen;'>wokeness</b> have become prominent in the mainstream, shaping media and societal discussions on race. Authors like <b style='color: forestgreen;'>Ibram X. Kendi</b> and <b style='color: forestgreen;'>Robin DiAngelo</b> have popularized ideas that <b style='color: forestgreen;'>racism</b> is not just about personal prejudice but is systemic, influencing corporate training and education. The <b style='color: forestgreen;'>media</b> has embraced this framework, creating a culture where race is often the focal point.\n\nDespite claims of progress in racial equality, <b style='color: forestgreen;'>liberal whites</b> have exhibited greater support for diversity and awareness of <b style='color: forestgreen;'>racial discrimination</b> than people of color themselves. This divergence is highlighted in studies showing <b style='color: forestgreen;'>white liberals</b> perceive more racism in society, even amid declining direct experiences of racism by minority groups. This phenomenon is driven in part by the media and <b style='color: forestgreen;'>critical race theory</b>'s focus on structural racism, leading to a \"Great Awokening\" among white liberals."
        },
        {
            "title": "Bari Weiss and the Struggles at the New York Times",
            "body": "<b style='color: forestgreen;'>Bari Weiss’</b> time at the <b style='color: forestgreen;'>New York Times</b> saw escalating tensions as <b style='color: forestgreen;'>identity politics</b> became dominant. Weiss's attempts to publish <b style='color: forestgreen;'>diverse voices</b> met resistance, and her stance on controversial topics led to <b style='color: forestgreen;'>bullying from colleagues</b>. An infamous incident was the <b style='color: forestgreen;'>Tom Cotton op-ed</b>, sparking outrage at the Times, demonstrating the media's role in <b style='color: forestgreen;'>moral panic</b>. This resulted in a mass collective <b style='color: forestgreen;'>departure of staff</b> from the Times who disagreed with representing the controversial viewpoints. The moral panic around <b style='color: forestgreen;'>race and identity</b> was intensifying, influencing journalism and public discourse, with <b style='color: forestgreen;'>serious implications</b> for the ability to hold a balanced debate in media outlets."
        },
        {
            "title": "Complex Racial Narratives and Individualism",
            "body": "<b style='color: forestgreen;'>The chapter explores the influence of wokeness</b> in media, <b style='color: forestgreen;'>highlighting</b> how issues of <b style='color: forestgreen;'>race and power</b> shape coverage. The <b style='color: forestgreen;'>'What Killed Michael Brown?' film</b> experienced pushback from Amazon, but was eventually released, illustrating power struggles over racial narratives. <b style='color: forestgreen;'>Kmele Foster's views</b> are presented, as he identifies as \"racially agnostic,\" rejecting the <b style='color: forestgreen;'>concept of race</b> as a persistent hindrance, stressing individualism over racial identity.\n\n<b style='color: forestgreen;'>Foster's stance on racism</b> highlights potential <b style='color: forestgreen;'>misinterpretations of interactions</b> as racial when they may not be, thus <b style='color: forestgreen;'>losing humanity</b>. His insights align with <b style='color: forestgreen;'>James Baldwin's fears</b> of paranoia in hostility. <b style='color: forestgreen;'>Foster criticizes 'white privilege'</b> narratives as <b style='color: forestgreen;'>presumptuous</b> and sees racial slogans as <b style='color: forestgreen;'>disempowering</b>, implying superiority and victimhood are misleading. This chapter illustrates <b style='color: forestgreen;'>complex debates</b> around race in media and personal identity."
        },
        {
            "title": "The Role of Clerisy in Supporting the Oligarchy",
            "body": "<b style='color: forestgreen;'>Today’s </b>media and <b style='color: forestgreen;'>cultural elite</b> function as a \"<b style='color: forestgreen;'>clerisy</b>,\" supporting the <b style='color: forestgreen;'>tech oligarchy</b> by aligning with <b style='color: forestgreen;'>its values</b>, such as <b style='color: forestgreen;'>globalism</b> and <b style='color: forestgreen;'>environmentalism</b>. This elite uses <b style='color: forestgreen;'>science</b> and other doctrines to maintain a <b style='color: forestgreen;'>class hierarchy</b>, pushing for <b style='color: forestgreen;'>\"oligarchical socialism\"</b> and benefiting from <b style='color: forestgreen;'>redistribution</b>, where the <b style='color: forestgreen;'>working class</b> remains dependent on the <b style='color: forestgreen;'>super-rich</b>. Both <b style='color: forestgreen;'>political parties</b> fail to offer real alternatives, focusing instead on policies that <b style='color: forestgreen;'>maintain elite power</b>, alienating the <b style='color: forestgreen;'>working class</b> who desire more <b style='color: forestgreen;'>autonomy</b> and community values, rather than <b style='color: forestgreen;'>expansion of the welfare state</b>."
        },
        {
            "title": "Exploring Moral Panic and Debates in Journalism",
            "body": "<h3 style='color: forestgreen;'>Summary of Chapters 8-9: A Moral Panic and a Rich Debate within the Black Community</h3>\n\nThe <b style='color: forestgreen;'>moral panic</b> surrounding racism has led to <b style='color: forestgreen;'>censorious journalism and media engagement</b>. This panic stirs around incidents like those involving <b style='color: forestgreen;'>George Floyd</b>, where the <b style='color: forestgreen;'>media's role</b> instigates an intense response, leading to discussions on <b style='color: forestgreen;'>cancel culture</b>. The <b style='color: forestgreen;'>intersectionality</b> between <b style='color: forestgreen;'>race</b> and <b style='color: forestgreen;'>journalism</b> plays a part as media organizations, Hollywood, and public figures react swiftly to race-related issues, often leading to <b style='color: forestgreen;'>public outrage</b> or resignations. Key figures like <b style='color: forestgreen;'>Tom Cotton</b> and <b style='color: forestgreen;'>New York Times personnel</b> highlight the tension between <b style='color: forestgreen;'>publishing controversial ideas</b> and adhering to a socially sensitive ethos. This environment causes a <b style='color: forestgreen;'>social media outrage</b>, every time someone voices contrarian opinions, igniting a possible moral panic.\n\nIn the Black community, a <b style='color: forestgreen;'>rich debate</b> occurs as these moral panics unfold. Discussions within the Black press highlight <b style='color: forestgreen;'>inequality, objectivity, and journalistic challenges</b>. As some believe objectivity favors white journalists, others emphasize <b style='color: forestgreen;'>cultural overreach</b> in media and <b style='color: forestgreen;'>cancel culture’s effects</b>. Figures like <b style='color: forestgreen;'>Wesley Lowery</b> critique the dominant rhetoric, urging a more nuanced conversation about <b style='color: forestgreen;'>race and journalism</b>. The idea of the <b style='color: forestgreen;'>Black press</b> as a means to challenge persistent stereotypes and issues is debated, indicating a need for <b style='color: forestgreen;'>diverse narratives</b> within journalism to properly address <b style='color: forestgreen;'>racism</b> and inform public discourse."
        }
    ]
}