{
    "meta": {
        "title": "Bali Living: Innovative Tropical Design",
        "author": "Gianni Francione and Kim Inglis",
        "category": "Architecture/Interior Design",
        "publisher": "Periplus Editions",
        "pages": 226
    },
    "parts": [
        {
            "title": "Bali's Emerging Architectural Identity",
            "body": "<b style='color: forestgreen;'>Bali</b> is evolving! Once referred to as a <b style='color: forestgreen;'>tropical paradise</b>, the island is seeing changes with <b style='color: forestgreen;'>urbanization</b> taking over areas like <b style='color: forestgreen;'>Denpasar</b> and <b style='color: forestgreen;'>Seminyak</b>. Despite this, there are still places where you can experience serenity and the island's classic beauty. <b style='color: forestgreen;'>Architectural</b> trends are shifting towards <b style='color: forestgreen;'>modern</b> styles with influences beyond traditional Balinese elements. The island now attracts those desiring modernity mixed with <b style='color: forestgreen;'>tropical charm</b>—whether it's sleek private villas or creative, beautiful buildings. Even with this shift, Bali manages to preserve its natural surroundings in new structures, showcasing the essence of <b style='color: forestgreen;'>contemporary tropical living</b>."
        },
        {
            "title": "Serene Balinese Villas: Emerald Sunset & River",
            "body": "<b style='color: forestgreen;'>Two villas</b> in Canggu highlight Balinese <b style='color: forestgreen;'>architecture</b> and serene <b style='color: forestgreen;'>landscapes</b> with views of rice fields. Both Emerald Sunset and Emerald River villas blend <b style='color: forestgreen;'>modern</b> and <b style='color: forestgreen;'>traditional</b> styles. Designed by Yoka Sara, the villas integrate <b style='color: forestgreen;'>old ironwood poles</b> for structure and aesthetics. Emerald Sunset features three buildings with a <b style='color: forestgreen;'>unique metal roof</b>, while Emerald River is more <b style='color: forestgreen;'>traditional</b>, with buildings around a central <b style='color: forestgreen;'>\"island\"</b> of trees. Both offer open <b style='color: forestgreen;'>living spaces</b>, creating a relaxing holiday experience.\n\nThe interiors showcase modern comfort amid lush gardens. Emerald Sunset includes a <b style='color: forestgreen;'>living area</b> with a <b style='color: forestgreen;'>curved roof</b>, while the bedroom building is complemented by a <b style='color: forestgreen;'>20-meter pool</b>. The villas feature elements like a <b style='color: forestgreen;'>dining pavilion</b>, stone-tiled pool that changes colors, and breezy corridors with <b style='color: forestgreen;'>inclined wooden struts</b>. Guests enjoy various lounging spots, including poolside terraces and open-plan living rooms overlooking gardens. These villas represent a perfect <b style='color: forestgreen;'>holiday oasis</b> that mixes architecture with natural surroundings."
        },
        {
            "title": "Blending Homes with Landscape and Culture",
            "body": "<h3 style='color: forestgreen;'>Two Homes in Harmony with Nature</h3>\n<b style='color: forestgreen;'>The first home</b> was built in <b style='color: forestgreen;'>2004</b> as <b style='color: forestgreen;'>guest quarters</b>. Nestled between a <b style='color: forestgreen;'>road</b> and a <b style='color: forestgreen;'>gorge</b>, its design followed the <b style='color: forestgreen;'>land's natural shape</b>. The architects aimed to make it <b style='color: forestgreen;'>blend seamlessly</b> into the tropical landscape. Its standout feature is the <b style='color: forestgreen;'>curved roofs</b>, resembling an <b style='color: forestgreen;'>upside-down boat keel</b>, crafted to be <b style='color: forestgreen;'>pre-assembled</b> and then reconstructed on-site in Bali. The home consists of two interconnected buildings with striking <b style='color: forestgreen;'>curved surfaces</b> that flow with the <b style='color: forestgreen;'>land's contours</b>. The <b style='color: forestgreen;'>organic materials</b> such as wood and natural stone create an earthy feel, and the <b style='color: forestgreen;'>open-plan areas</b> foster a light and breezy atmosphere, while blending with the surrounding <b style='color: forestgreen;'>vegetation</b>.\n\n<b style='color: forestgreen;'>The second home</b> is dominated by a striking <b style='color: forestgreen;'>steel framework roof</b>, inspired by <b style='color: forestgreen;'>Frangipani tree branches</b>. This frame covers a <b style='color: forestgreen;'>double-storey building</b>, combining an open-air ground floor with enclosed upper levels, which offer seamless <b style='color: forestgreen;'>garden views</b>. The master bedroom's unit, initially planned with a <b style='color: forestgreen;'>Frangipani motif</b>, ended up being a simple glass-and-wood structure. This home exemplifies <b style='color: forestgreen;'>modern tropical design</b> while respecting the local environment's cultural aspects."
        },
        {
            "title": "Serene Hillside Sanctuary",
            "body": "<b style='color: forestgreen;'>The house</b> is designed to appear as an extension of the surrounding <b style='color: forestgreen;'>rice terraces</b>, with <b style='color: forestgreen;'>natural materials</b> like stone and wood enhancing the feel. The <b style='color: forestgreen;'>main building</b> features a mix of <b style='color: forestgreen;'>curved shingle roofs</b> and <b style='color: forestgreen;'>flat stone volumes</b>, making it look as though it <b style='color: forestgreen;'>blends into the landscape</b>. Surrounded by a <b style='color: forestgreen;'>curving pool</b> and lush <b style='color: forestgreen;'>landscaping</b>, the house makes clever use of <b style='color: forestgreen;'>varying textures</b> and <b style='color: forestgreen;'>colors</b> to create a harmonious balance with its tropical setting.\n\nA separate <b style='color: forestgreen;'>guest pavilion</b> feels like part of the <b style='color: forestgreen;'>hillside</b>, composed of <b style='color: forestgreen;'>green Indian stone</b> and <b style='color: forestgreen;'>bengkerai wood</b>. The <b style='color: forestgreen;'>roof</b> is artistically altered to incorporate the entrance. The home embodies the owners' desire for <b style='color: forestgreen;'>space and seclusion</b>, offering a tranquil retreat that stays in harmony with <b style='color: forestgreen;'>Balinese aesthetics</b> and the beauty of the <b style='color: forestgreen;'>natural environment</b>."
        },
        {
            "title": "Modernist Coastal Home with Nature-Integrated Design",
            "body": "In <b style='color: forestgreen;'>modern home designs</b>, Alessandro Landi combines an open-plan living concept with dramatic <b style='color: forestgreen;'>floor-to-ceiling glazing</b> that enhances spectacular <b style='color: forestgreen;'>coastal views</b>. The sleek design is balanced with raw elements like <b style='color: forestgreen;'>granite</b> and <b style='color: forestgreen;'>bamboo flooring</b>. Architects like <b style='color: forestgreen;'>Richard Neutra</b> inspire the home to mediate <b style='color: forestgreen;'>man and nature</b>, promoting <b style='color: forestgreen;'>modern living</b> concepts of <b style='color: forestgreen;'>sun, space, and greenery</b>. Though located in <b style='color: forestgreen;'>Bali</b>, the house stands out with <b style='color: forestgreen;'>international charm</b> rather than traditional Indonesian styles.\n\nInside, this modern utopia remains consistent with its exterior, utilizing <b style='color: forestgreen;'>grey tones</b> highlighted by chromatic <b style='color: forestgreen;'>red accents</b> such as a <b style='color: forestgreen;'>bright red chaise longue</b>. A <b style='color: forestgreen;'>minimalist garden</b> and a narrow <b style='color: forestgreen;'>lap pool</b> lined with <b style='color: forestgreen;'>green sukabumi stone</b> frame the home, embodying an <b style='color: forestgreen;'>exercise in restraint</b> yet designed for maximum aesthetic impact. <b style='color: forestgreen;'>Textures like Indian slate and volcanic stone</b> complement the clean architectural lines, while subtle lighting brings out textural intricacies during the night. <b style='color: forestgreen;'>Art from Just Jen’s</b>, casually placed within the living space, offers a subtle nod to Indonesian culture while maintaining overall <b style='color: forestgreen;'>modernist appeal</b>."
        },
        {
            "title": "Design and Architecture of Tra Villa in Canggu",
            "body": "<b style='color: forestgreen;'>This villa</b> in <b style='color: forestgreen;'>Canggu</b> was built between 2006 <b style='color: forestgreen;'>and 2007</b>, designed by <b style='color: forestgreen;'>Yoka Sara of Bale Legend</b>.\nThe <b style='color: forestgreen;'>owners initially</b> weren't attracted to Bali due to its commercialization. However, they eventually fell in love with the jungle and <b style='color: forestgreen;'>rice fields</b>, which inspired the design of <b style='color: forestgreen;'>their home</b>. Their vision was to always feel like they were <b style='color: forestgreen;'>outside</b> in these natural settings.\n\nThe villa's <b style='color: forestgreen;'>architecture</b> features <b style='color: forestgreen;'>hollow steel</b>, <b style='color: forestgreen;'>composite aluminum</b>, and <b style='color: forestgreen;'>glass</b>, giving it both a modern and a natural touch. <b style='color: forestgreen;'>Ironwood columns</b>, used in the structure, add to its character. The villa's design integrates with its surroundings, with views extending towards a <b style='color: forestgreen;'>river</b> and <b style='color: forestgreen;'>rice fields</b>. The <b style='color: forestgreen;'>landscape design</b> also contributes to this integration, using <b style='color: forestgreen;'>local plants</b> such as <b style='color: forestgreen;'>banana trees</b> and <b style='color: forestgreen;'>slim palms</b> to enhance their <b style='color: forestgreen;'>tropical living environment</b>."
        },
        {
            "title": "Surfer's Dream Retreat in Bali",
            "body": "This retreat in <b style='color: forestgreen;'>Bali</b> was built for a dedicated surfer with spectacular <b style='color: forestgreen;'>ocean views</b> over Padang Padang and Suluban. Designed by David Lombardi, the house blends <b style='color: forestgreen;'>indoor-outdoor living</b> and ensures <b style='color: forestgreen;'>easy wave access</b>. A main structure with shingled roof and lighter bedroom volumes incorporates a <b style='color: forestgreen;'>carport</b> and perforated copper entrance door, showcasing local craftsmanship. The <b style='color: forestgreen;'>spacious living area</b> with cooling materials like palimanan stone and terrazzo floors looks out to a <b style='color: forestgreen;'>minimalist landscaped</b> garden and pool, enhancing relaxation for any surfer."
        },
        {
            "title": "The Calyx Boutique Resort Review",
            "body": "<b style='color: forestgreen;'>LEFT:</b> The <b style='color: forestgreen;'>master bedroom</b> from one of the four villas at <b style='color: forestgreen;'>The Calyx</b> showcases a sloping wooden roof and glazed windows offering ocean views. An <b style='color: forestgreen;'>impressive glass sculpture</b> by Seiki Torige adds an artistic touch. The resort's <b style='color: forestgreen;'>communal pool</b> extends over the Indian ocean; nearby, an open <b style='color: forestgreen;'>bar and lounge</b> offer sweeping vistas, adding to the <b style='color: forestgreen;'>serene atmosphere.</b>\n\nThe Calyx, named after a plant's <b style='color: forestgreen;'>supporting part</b>, offers a unique retreat. Designed by <b style='color: forestgreen;'>Gfab</b>, the boutique resort prioritizes <b style='color: forestgreen;'>energy efficiency</b> and blends into its landscape. The <b style='color: forestgreen;'>cream sandstone walls</b>, flat <b style='color: forestgreen;'>plant-covered roofs</b>, and strategic room placements maximize natural cooling and relaxation, creating a <b style='color: forestgreen;'>sequestered and modern ambience.</b>"
        },
        {
            "title": "Tirtha Wedding Chapels in Bali",
            "body": "The Tirtha <b style='color: forestgreen;'>wedding chapels</b> in Bali offer a stunning backdrop for weddings. These chapels sit on a <b style='color: forestgreen;'>cliff</b> with breathtaking views over the <b style='color: forestgreen;'>Indian Ocean</b>. Designed by a <b style='color: forestgreen;'>Japanese entrepreneur</b> and architect Glenn Parker, Tirtha Uluwatu and Tirtha Luhur combine traditional and modern elements. The design concept includes <b style='color: forestgreen;'>ivory palimanan stone</b> and an <b style='color: forestgreen;'>A-line chapel</b> with glass panels and a Teflon roof, giving a sense of <b style='color: forestgreen;'>lightness</b> and <b style='color: forestgreen;'>romance</b>. The architect aimed to create a dramatic, yet culturally relevant design that reflects Bali's <b style='color: forestgreen;'>vernacular architecture</b>."
        },
        {
            "title": "Bamboo House Integration",
            "body": "<b style='color: forestgreen;'>Bamboo House</b>: This villa, built for Italian businessman <b style='color: forestgreen;'>Kiko A Croserio</b>, uniquely uses <b style='color: forestgreen;'>bamboo</b> in its construction, giving it a rustic vibe. The house is a testament to blending traditional Indonesian materials with modern architecture. <b style='color: forestgreen;'>Bamboo</b> is used for poles and beams, alongside clay and wood, creating a home integrated with nature. Perched on a tranquil site near <b style='color: forestgreen;'>Tanah Lot</b>, the villa boasts an open-plan layout with a <b style='color: forestgreen;'>free-form swimming pool</b> and views of the ocean. <b style='color: forestgreen;'>Wolfgang Widmoser</b> assisted in its design, influenced by Indonesian tradition and the legendary Frei Otto. A distinct feature is the house's <b style='color: forestgreen;'>bamboo support, thatched roof</b>, and integration of indoor and outdoor elements, providing a seamless flow for relaxed living."
        }
    ]
}