{
    "meta": {
        "title": "Blended: Using Disruptive Innovation to Improve Schools",
        "author": "Michael B. Horn and Heather Staker",
        "publisher": "Jossey-Bass",
        "pages": 333
    },
    "parts": [
        {
            "title": "Blended: Transforming Education with Technology",
            "body": "The book \"Blended\" explores <b style='color: forestgreen;'>how technology in schools</b> can <b style='color: forestgreen;'>significantly improve student learning</b> when used properly. It is particularly aimed at school <b style='color: forestgreen;'>leaders and educators</b> looking to implement blended learning strategies effectively. Featuring <b style='color: forestgreen;'>insights from recognized educational experts,</b> the book outlines various models of blended learning, demonstrating how this approach can break down traditional educational barriers, providing <b style='color: forestgreen;'>personalized pathways</b> for students. With contributions from noted figures and case studies, this book becomes a <b style='color: forestgreen;'>valuable resource</b> for shifting towards a <b style='color: forestgreen;'>student-centered educational system.</b>"
        },
        {
            "title": "Blended Learning's Rise and Impact on Education",
            "body": "Schools are at a <b style='color: forestgreen;'>tipping point</b> as online learning is becoming more prevalent. Predictions from <b style='color: forestgreen;'>Disrupting Class</b> in 2008 stated that by 2019, 50% of high school courses would utilize online learning. This prediction seems <b style='color: forestgreen;'>accurate</b> today. The key question is whether this shift towards online education is good, and how to make it beneficial for learning. Online learning is seen as a <b style='color: forestgreen;'>disruptive innovation</b>, changing traditional education systems similarly to how <b style='color: forestgreen;'>TurboTax</b> and <b style='color: forestgreen;'>email</b> have changed other industries. These innovations initially offer <b style='color: forestgreen;'>affordable</b> and <b style='color: forestgreen;'>accessible</b> alternatives for those without resources but often improve over time, providing higher quality services.\n\nOnline learning in schools started with “<b style='color: forestgreen;'>nonconsumption</b>” areas where traditional options were unavailable, such as advanced courses in rural schools and for credit recovery. Over time, <b style='color: forestgreen;'>online learning</b> has improved and is now integrated into traditional schooling through <b style='color: forestgreen;'>blended learning</b>, which combines online education with face-to-face learning. This integration allows for <b style='color: forestgreen;'>personalized</b> education experiences, as demonstrated by students like Jack, who excelled with the help of online tools. Blended learning can address the shortcomings of the <b style='color: forestgreen;'>factory model</b> of education, which focuses on standardization rather than customization, by offering <b style='color: forestgreen;'>personalized</b> and <b style='color: forestgreen;'>competency-based</b> approaches.\n\nAs blended learning grows, it addresses three major desires: <b style='color: forestgreen;'>personalization</b>, <b style='color: forestgreen;'>access</b>, and <b style='color: forestgreen;'>cost control</b>. Personalization helps students learn at their own pace, access removes geographic limitations, and cost control alleviates budget constraints. Online learning has shown potential, similar to how <b style='color: forestgreen;'>KIPP Empower</b> successfully used blended learning to maintain quality education despite budget cuts. To fully harness these benefits, schools must transition thoughtfully, designing <b style='color: forestgreen;'>student-centered</b> learning environments that utilize the strengths of online tools to create effective, adaptable education systems."
        },
        {
            "title": "The Tipping Point in Education",
            "body": "<b style='color: forestgreen;'>Blended Learning</b>: A popular approach that's part of a <b style='color: forestgreen;'>digital shift</b> in education is <b style='color: forestgreen;'>blended learning</b>, which combines online tools with traditional <b style='color: forestgreen;'>face-to-face</b> teaching. It's predicted that by <b style='color: forestgreen;'>2019</b>, half of high school courses will be online in some form.\n\n<b style='color: forestgreen;'>Disruptive Innovation</b>: This concept describes innovations that <b style='color: forestgreen;'>challenge and change existing systems</b>. Like how <b style='color: forestgreen;'>email</b> disrupted postal services, online learning is <b style='color: forestgreen;'>reshaping education</b>, offering affordable and accessible options and becoming increasingly sophisticated.\n\n<b style='color: forestgreen;'>Benefits</b>: <b style='color: forestgreen;'>Online learning</b> started in areas with no learning alternatives, such as for <b style='color: forestgreen;'>advanced</b> or <b style='color: forestgreen;'>remedial</b> courses. It's significant in places where traditional methods lacked resources. Over time, it has improved and now offers <b style='color: forestgreen;'>engaging content and interactive tools</b>, supporting student success."
        },
        {
            "title": "Exploring Blended Learning",
            "body": "Blended learning is a mix of <b style='color: forestgreen;'>online learning</b> and traditional <b style='color: forestgreen;'>classroom</b> methods, growing in popularity due to its flexibility. Unlike technology-rich education, blended learning gives students control over <b style='color: forestgreen;'>time</b>, <b style='color: forestgreen;'>place</b>, <b style='color: forestgreen;'>path</b>, or <b style='color: forestgreen;'>pace</b> of learning. It requires some attendance at a <b style='color: forestgreen;'>physical location</b>, providing more than just digital tools to enhance learning.\n\nSeveral models of blended learning exist, incorporating <b style='color: forestgreen;'>online education</b> in various ways. The <b style='color: forestgreen;'>Rotation Model</b> divides into Station Rotation, Lab Rotation, Flipped Classroom, and Individual Rotation, ensuring students rotate between online and offline activities. Another model, <b style='color: forestgreen;'>Flex</b>, relies primarily on online content with flexible in-person support, suited for diverse student needs.\n\nBlended learning integrates online courses into students' education. Programs may vary widely, mixing online-only courses like the <b style='color: forestgreen;'>A La Carte model</b> or maintaining some classroom sessions through <b style='color: forestgreen;'>Enriched Virtual models</b>. The <b style='color: forestgreen;'>Blended Learning Universe (BLU)</b> is a resource for exploring various global programs and understanding how different models cater to educational goals."
        },
        {
            "title": "Blended Learning Models: Hybrid vs. Disruptive",
            "body": "The chapter explores <b style='color: forestgreen;'>blended learning</b> and distinguishes between <b style='color: forestgreen;'>hybrid</b> and <b style='color: forestgreen;'>disruptive models</b>. \n\nHybrid models like <b style='color: forestgreen;'>Station Rotation, Lab Rotation</b>, and <b style='color: forestgreen;'>Flipped Classroom</b> mix <b style='color: forestgreen;'>traditional classroom</b> methods with <b style='color: forestgreen;'>online learning</b>. These methods target <b style='color: forestgreen;'>existing students</b> and aim to enhance current teaching practices rather than replace them. They support traditional metrics and educational goals, making them more complicated to operate because they integrate old and new methods.\n\nDisruptive models, such as <b style='color: forestgreen;'>Flex, A La Carte</b>, and <b style='color: forestgreen;'>Enriched Virtual</b>, are aimed at transforming classrooms by prioritizing <b style='color: forestgreen;'>online instruction</b> over face-to-face teaching. They reside in \"<b style='color: forestgreen;'>learning studios</b>\" rather than conventional classrooms. These models are designed for <b style='color: forestgreen;'>nontraditional learning environments</b> like <b style='color: forestgreen;'>credit recovery</b> or <b style='color: forestgreen;'>summer school</b>, offering either remote or flexible use of time and space for <b style='color: forestgreen;'>personalized learning</b>. They simplify operations by reassigning instructional management online, allowing teachers to focus on mentoring and guiding."
        },
        {
            "title": "Frameworks for Innovation Teams",
            "body": "Blended learning programs that truly innovate and improve educational effectiveness <b style='color: forestgreen;'>begin with a clear rallying cry</b>, addressing a specific problem or aspirational goal. Schools must clearly define what they aim to achieve <b style='color: forestgreen;'>beyond mere gadget integration</b>—such as boosting student outcomes, providing more opportunities, or improving cost effectiveness. Schools like <b style='color: forestgreen;'>Quakertown Community School District</b> used blended learning to retain millions of dollars by creating a cyber academy to compete with external cyber charters. This illustrates the importance of setting solid objectives, rather than investing technology for its own sake.\n\nThere are <b style='color: forestgreen;'>four key types of teams</b> to consider when organizing for innovation, based on the level of problem or task complexity. <b style='color: forestgreen;'>Functional teams</b> handle isolated improvements; they are best when the work can be managed within a single department. <b style='color: forestgreen;'>Lightweight teams</b> are needed for predictable interdependencies that affect multiple departments. <b style='color: forestgreen;'>Heavyweight teams</b> are required for major architectural changes where components must interact in new ways. <b style='color: forestgreen;'>Autonomous teams</b> are crucial for disruptive innovation when the economic model of the new project doesn’t align with the current business structure, necessitating a separate approach to operate successfully.\n\nAn example of how these team types differ can be seen in the automotive industry. Toyota uses functional teams for incremental product improvements but had used a <b style='color: forestgreen;'>heavyweight team</b> to develop the hybrid Prius. The most challenging ventures, like launching pure electric vehicles, would require <b style='color: forestgreen;'>autonomous teams</b>, showing how different organizational structures serve specific innovation needs."
        },
        {
            "title": "Team Structures for School Innovation",
            "body": "<b style='color: forestgreen;'>Context & Types of School Projects:</b>\n- Different projects in schools require specific types of teams depending on the change's scope.\n- <b style='color: forestgreen;'>Functional teams</b> are best for sustaining innovations that are not interdependent with other parts of the school, such as individual teacher initiatives within their classrooms.\n- <b style='color: forestgreen;'>Lightweight teams</b> are suitable for projects needing coordination across existing departments but with predictable changes.\n- Examples: setting schedules, integrating existing lab rotations.\n- <b style='color: forestgreen;'>Heavyweight teams</b> involve redesigning how parts of the school system interact and are great for more complex innovations requiring collaborative design and implementation with less predictable changes.\n\n<b style='color: forestgreen;'>Utilizing Technology in Schools:</b>\n- Schools attempt to leverage technology to personalize learning, often relying on functional teams, but this might limit broader integration.\n- Proper team structuring helps in achieving system-wide technology implementations effectively.\n- <b style='color: forestgreen;'>Autonomous teams</b> focus on disruptive innovations, fundamentally rethinking school structures and processes.\n- Successful implementation of a disruptive model might look like separate teams revisiting schedules, facilities, or the overall curriculum.\n\n<b style='color: forestgreen;'>Case Example & Best Practices:</b>\n- An example of a successful deployment by middle school teachers in California shows how empowered teachers can establish innovative models like Flipped Classrooms or Station Rotations.\n- Empowering teaching staff to innovate within their classrooms can lead to positive changes without needing heavyweight teams.\n- Keeping in mind the type of changes desired allows for appropriate team structuring to foster innovation and integration.\n\nIn summary, understanding the scope of the educational change desired allows for the strategic assembly of the right teams, from functional to autonomous, ensuring efficient and effective innovation, particularly when integrating technological solutions."
        },
        {
            "title": "Redesigning Teacher Roles in Blended Learning",
            "body": "<b style='color: forestgreen;'>Blended learning</b> involves redesigning the school model, integrating technology with traditional teaching for an <b style='color: forestgreen;'>enhanced educational experience</b>. To achieve this, focusing on the <b style='color: forestgreen;'>teacher's role is crucial</b>. Effective teaching influences student success; thus, incorporating a teacher's involvement is vital. Yet, with online learning, teachers might feel replaced and disengaged unless their role is <b style='color: forestgreen;'>redesigned effectively</b>. A good approach maintains the teacher's engagement, avoiding a scenario where they feel unnecessary or displaced, which <b style='color: forestgreen;'>negatively impacts students</b>. <b style='color: forestgreen;'>Designing teacher roles</b> should focus on moving past traditional lecture-based teaching and embracing <b style='color: forestgreen;'>new innovative roles</b> that support student needs, fostering skills necessary for today’s world like <b style='color: forestgreen;'>communication, inquiry, and teamwork</b>. Schools that acknowledge these changes create environments where teachers adopt roles more as <b style='color: forestgreen;'>facilitators and mentors</b>, aligning with modern educational needs."
        },
        {
            "title": "Choosing the Right Blended Learning Model in Education",
            "body": "<b style='color: forestgreen;'>In the realm of education</b>, choosing a blended learning model involves several considerations. <b style='color: forestgreen;'>One major factor</b> is whether the problem at hand pertains to \"mainstream students in core subjects\" or involves solving for \"nonconsumption gaps.\" Mainstream issues might include balancing skill disparities among students entering a grade, while nonconsumption gaps can be about providing opportunities for makeup classes, courses not typically in the catalog, or credit recovery. \n\nCurrently, <b style='color: forestgreen;'>sustaining models</b> of blended learning tend to fit core student-related issues, while <b style='color: forestgreen;'>disruptive models</b> work better for nonconsumption problems. Over time, as these disruptive innovations improve, their applicability may broaden. The chapter also touches on the historical lesson from the <b style='color: forestgreen;'>Bell Laboratories' invention of the transistor</b>: while the transistor was more durable and smaller than the vacuum tube, it couldn’t initially handle the power requirements of prevailing consumer electronics. This story illustrates how eagerly jumping on new tech without matching it to the right problems can be inefficient regardless of investment. \n\nThese insights from the history of technology adoption in <b style='color: forestgreen;'>other sectors</b> underscore the importance of starting with an apposite approach in education. Rather than attempting to reinvent the wheel, it’s often simpler and more effective to rely on successful, existing templates, customizing as needed."
        },
        {
            "title": "Leveraging Disruptive Innovation in Education",
            "body": "<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Disruptive Innovations and Identifying Nonconsumption Areas</b></h3>\n\nTrying to <b style='color: forestgreen;'>force new technologies</b> into existing systems often fails because the standards are too high, leading to <b style='color: forestgreen;'>waste of time</b> and resources. A better approach is to <b style='color: forestgreen;'>target areas of nonconsumption</b>, where there's a lack of any existing solutions, making it easier for new ideas to be accepted and implemented. For instance, transistors found their first commercially successful application in <b style='color: forestgreen;'>hearing aids</b> and later in rough, early <b style='color: forestgreen;'>transistor radios</b> for teenagers, who valued portability over audio quality.\n\n<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Deploying Disruptive Models in Education</b></h3>\n\nIn education, leveraging disruptive models like <b style='color: forestgreen;'>blended learning</b> in areas of nonconsumption offers dual benefits: It clears an <b style='color: forestgreen;'>easier performance hurdle</b>, as any improvement is significant, and it helps <b style='color: forestgreen;'>address educational gaps</b> without needing extra resources. Schools can personalize learning, improve access, and reduce costs by adopting these innovations, turning historically <b style='color: forestgreen;'>resource-constrained systems</b> into more efficient and effective ones.\n\n<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Guidelines for Implementing Blended Learning Models</b></h3>\n\nWhen selecting blended learning models to replicate, ask: <b style='color: forestgreen;'>What problem are you trying to solve?</b> If it's a <b style='color: forestgreen;'>core problem</b> with mainstream students, sustaining models like <b style='color: forestgreen;'>Station Rotation</b> might suffice. However, for nonconsumption areas, more <b style='color: forestgreen;'>disruptive</b> models such as <b style='color: forestgreen;'>Flex</b> or <b style='color: forestgreen;'>Enriched Virtual</b> could work better. Table 8.1 defines the appropriateness of different models for varied issues. While not mandatory, aligning model selection to problem types enhances efficiency and outcomes."
        },
        {
            "title": "Understanding Organizational Culture in Schools",
            "body": "<b style='color: forestgreen;'>Organizational culture</b> is defined by Edgar <b style='color: forestgreen;'>Schein</b> as a pattern of <b style='color: forestgreen;'>basic assumptions</b> developed by a group to cope with external adaptation and internal integration which is considered valid and taught to new members. In most schools today, the <b style='color: forestgreen;'>classroom</b> structure can be quite <b style='color: forestgreen;'>inconsistent</b>, with each classroom developing its own <b style='color: forestgreen;'>distinct culture</b> depending on how individual teachers manage <b style='color: forestgreen;'>challenges</b>. This inconsistency means that while a school may work on certain problems collectively, individual classroom cultures can still vary greatly due to their semi-autonomous operation."
        }
    ]
}