{
    "meta": {
        "title": "Brain Theory - Biological Basis and Computational Principles",
        "author": "A. Aertsen and V. Braitenberg (Editors)",
        "publisher": "Elsevier Science B.V.",
        "pages": 291
    },
    "parts": [
        {
            "title": "Theory of Early Vision",
            "body": "The <em style='color: forestgreen;'>brain</em> transforms <em style='color: forestgreen;'>images</em> from the <em style='color: forestgreen;'>retina, producing </em>internal images<em style='color: forestgreen;'> with enhanced features linked with </em>context<em style='color: forestgreen;'> from image regions or </em>memory<em style='color: forestgreen;'>. Experiments show that early vision includes a </em>context-dependent component<em style='color: forestgreen;'>, affecting neural responses via </em>lateral interactions<em style='color: forestgreen;'> and modified by </em>experience<em style='color: forestgreen;'> (perceptual learning) through </em>connections<em style='color: forestgreen;'> and </em>attention<em style='color: forestgreen;'>. The </em>model of early vision<em style='color: forestgreen;'> explains various visual processes like </em>lateral masking, texture discrimination<em style='color: forestgreen;'>, and </em>visual grouping<em style='color: forestgreen;'>. For instance, target detection is </em>enhanced or suppressed<em style='color: forestgreen;'> by nearby </em>masks<em style='color: forestgreen;'>, with </em>practice increasing<em style='color: forestgreen;'> interaction ranges through improved </em>synaptic efficacy_."
        },
        {
            "title": "Multiple Representations in Parietal Cortex",
            "body": "\n<b style='color: forestgreen;'>Parietal cortex</b> has <b style='color: forestgreen;'>multiple spatial</b> representations for different actions, as seen in areas <b style='color: forestgreen;'>LIP</b> and <b style='color: forestgreen;'>VIP</b>. <b style='color: forestgreen;'>LIP neurons</b> encode spatial locations in <b style='color: forestgreen;'>oculocentric coordinates</b>, meaning they signal where a stimulus is concerning the fovea. These neurons respond to visual, attentional, and motor signals not driven solely by either. For example, in a <b style='color: forestgreen;'>saccade task</b>, LIP neurons maintain the memory of a stimulus and respond even if the stimulus is not in view, denoting <b style='color: forestgreen;'>oculocentric remapping</b>. Attention does not shift LIP's spatial representation unless accompanied by intended eye movement.\n\nIn contrast, <b style='color: forestgreen;'>VIP neurons</b> focus on <b style='color: forestgreen;'>head-centered coordinates</b>. They respond to stimuli moving <b style='color: forestgreen;'>towards the head</b> and retain this selective attention irrespective of <b style='color: forestgreen;'>eye movement</b>. VIP neurons have <b style='color: forestgreen;'>bimodal properties</b>, meaning they react to both <b style='color: forestgreen;'>visual</b> and <b style='color: forestgreen;'>somatosensory stimuli</b>, which indicates a focus around regions like the <b style='color: forestgreen;'>mouth</b>. Neurons in this area detect stimuli that are within reach—for instance, those close enough to grab with the head or mouth.\n\nThese findings reveal that parietal cortex neurons are specialized based on the actions they need to support, such as eye versus head movements. This <b style='color: forestgreen;'>modular approach</b> contradicts traditional views, which suggested a single representation for spatial perception. It highlights how <b style='color: forestgreen;'>spatial understanding</b> is tailored to <b style='color: forestgreen;'>specific motor outputs</b>, crucial for interacting accurately with the environment."
        },
        {
            "title": "Visual Performance and Eccentricity",
            "body": "In the <b style='color: forestgreen;'>left hemi-field</b> of the right eye, researchers observed a clear pattern of performance related to stimulus <b style='color: forestgreen;'>eccentricity</b>. At <b style='color: forestgreen;'>high and medium contrasts</b>, orientation detection drops the further the stimulus is from the <b style='color: forestgreen;'>fovea</b>. The lower the contrast, the more performance reduces, dropping to zero at about <b style='color: forestgreen;'>20° in the periphery</b> for the lowest contrast. At high contrast, decline occurs only in the far periphery. This pattern involves psychometric functions that vary by <b style='color: forestgreen;'>slope</b> and <b style='color: forestgreen;'>saturation levels</b> or <b style='color: forestgreen;'>shift</b> along the abscissa.\n\nIn the <b style='color: forestgreen;'>right hemi-field</b>, performance deviates due to the <b style='color: forestgreen;'>blind spot</b>, which causes detection to drop to zero values between <b style='color: forestgreen;'>15° and 18° eccentrically</b>. This natural absence of detection allows for checking the reliability of subjects’ fixation. \n\nWhile orientation detection decreases with <b style='color: forestgreen;'>lower contrast</b> and increased <b style='color: forestgreen;'>stimulus eccentricity</b>, performance is affected by contrast sensitivity or bar size, linked to the visual <b style='color: forestgreen;'>cortical grain</b>. When bars of different lengths are used, performance improves near the fovea and falls off less steeply in the periphery, suggesting the necessity for stimuli to scale proportionately in cortical dimensions to prevent performance degradation."
        },
        {
            "title": "Neocortical Columns and Mapping Principles",
            "body": "<b style='color: forestgreen;'>Neocortex's Columns:</b> The neocortex is built on a system of <b style='color: forestgreen;'>column-like structures</b> which form slabs and pinwheel patterns. A column consists of neurons connected in a chain, forming <b style='color: forestgreen;'>recurrent circuits</b> for robust signal processing. This setup extracts signal from noise, leveraging recurrent <b style='color: forestgreen;'>excitation and inhibition</b>. The columns provide a clear neural code while scaling input signals.\n\n<b style='color: forestgreen;'>Understanding Columns:</b> The concept of neocortical columns spans topographic maps, where sensory and motor worlds are represented on the cortex surface. <b style='color: forestgreen;'>Hypercolumns</b> in the visual cortex illustrate this with structures that process complete cycles, like orientation and ocular dominance. Columns serve as the basic organizational unit, binding similar functions spatially. This uniform cortical architecture supports a variety of sensory functions.\n\n<b style='color: forestgreen;'>Cortical Map Formation:</b> The role of <b style='color: forestgreen;'>presynaptic elements</b> is prominent in forming sensory maps, like ocular dominance columns formed by thalamic projections. However, cortical influence exists—as demonstrated in variable conditions, such as changes in whisker numbers in mice altering corresponding cortical maps. The debate continues on whether cortex simply adapts to afferent inputs or has an intrinsic <b style='color: forestgreen;'>protomap</b> guiding afferent integration."
        },
        {
            "title": "Neuronal Connections and Orientation Selectivity in Cat Visual Cortex",
            "body": "<b style='color: forestgreen;'>Researchers</b> have explored the <b style='color: forestgreen;'>arrangement</b> and <b style='color: forestgreen;'>function</b> of <b style='color: forestgreen;'>neuronal connections</b> within the <b style='color: forestgreen;'>visual cortex</b> of cats, focusing specifically on whether <b style='color: forestgreen;'>lateral connections</b> between neurons share similar <b style='color: forestgreen;'>orientation preferences</b>. In early studies, <b style='color: forestgreen;'>Matsubara et al.</b> and <b style='color: forestgreen;'>Gilbert and Wiesel</b> examined these <b style='color: forestgreen;'>corticocortical connections</b> but found differing results, leading to discussions about whether these connections adhere to the <b style='color: forestgreen;'>iso-model</b> (where neurons of the same orientation are linked) or not.\n\nThe <b style='color: forestgreen;'>structure of horizontal networks</b> in the visual cortical areas includes <b style='color: forestgreen;'>excitatory connections</b> primarily composed of <b style='color: forestgreen;'>pyramidal cells</b>. These cells form a <b style='color: forestgreen;'>lattice-like pattern</b> over several millimeters, connecting with neurons via <b style='color: forestgreen;'>patchy axons</b>. These connections are thought to influence a neuron’s <b style='color: forestgreen;'>excitatory input</b> significantly, albeit in a minimal percentage. <b style='color: forestgreen;'>Reciprocal connections</b> among pyramidal cells only exist at the population level, and <b style='color: forestgreen;'>non-pyramidal cells</b>, such as <b style='color: forestgreen;'>basket cells</b>, might provide <b style='color: forestgreen;'>inhibitory input</b> with wide-ranging influence through their <b style='color: forestgreen;'>axonal networks</b>.\n\nStudies have further dived into the <b style='color: forestgreen;'>functional topography</b> of these connections, using methods such as <b style='color: forestgreen;'>optical imaging</b> and <b style='color: forestgreen;'>biocytin injections</b> to understand how <b style='color: forestgreen;'>basket cells</b> and their <b style='color: forestgreen;'>dendritic fields</b> interact with <b style='color: forestgreen;'>orientation columns</b>. The findings suggest that <b style='color: forestgreen;'>basket cells</b> can exert inhibition across multiple <b style='color: forestgreen;'>orientations</b>, challenging the viability of the iso-model. <b style='color: forestgreen;'>Intracellular</b> and <b style='color: forestgreen;'>extracellular experiments</b> underline the strong <b style='color: forestgreen;'>inhibitory influences</b> stemming potentially from <b style='color: forestgreen;'>non-optimal orientations</b>, reflecting the broader role inhibitory neurons might play in shaping <b style='color: forestgreen;'>cortical outputs</b>."
        },
        {
            "title": "Receptive Field Expansion and Connectivity Changes",
            "body": "<b style='color: forestgreen;'>3.1 Change in Effective Connectivity with Expansion</b>: <b style='color: forestgreen;'>Cross-correlation technique</b> confirms that <b style='color: forestgreen;'>effective connectivity increases</b> with receptive field expansion and remains unchanged or decreases otherwise. In experiments, <b style='color: forestgreen;'>artificial scotoma</b> is positioned over the receptive fields of neuron pairs to observe changes. The study by Das and Gilbert 1995 demonstrates that successful conditioning (<b style='color: forestgreen;'>receptive field expansion</b>) typically increases connection strength between neurons.\n\nFigure 2 depicts the <b style='color: forestgreen;'>experimental setup</b> with test and conditioning stimuli in relation to receptive fields. Neurons are stimulated by a <b style='color: forestgreen;'>test bar</b> moving through receptive fields to measure responses and <b style='color: forestgreen;'>cross-correlated</b> to determine connection changes. Results from Das and Gilbert 1995 underscore increased connectivity with successful conditioning.\n\nIn <b style='color: forestgreen;'>37 neuron pairs</b>, receptive field expansion correlated with increased connection strength. <b style='color: forestgreen;'>Neurons</b> with expanded fields increased in the <b style='color: forestgreen;'>NCCH peak size</b> while non-expanding fields showed no increase or a decrease. Further analysis showed connection strength differences in overlapping and non-overlapping receptive field regions, with no uniform change across regions. Overall, <b style='color: forestgreen;'>expanding receptive fields</b> show enhanced connectivity."
        },
        {
            "title": "Neural Plasticity in Visual Cortex",
            "body": "The study explores the <b style='color: forestgreen;'>dynamic nature</b> of synaptic connectivity in the <b style='color: forestgreen;'>visual cortex</b>, highlighting its role in <b style='color: forestgreen;'>visual perception</b> and <b style='color: forestgreen;'>learning</b>. Researchers have observed that <b style='color: forestgreen;'>receptive fields</b>, which are neuronal areas responsive to certain visual stimuli, are <b style='color: forestgreen;'>not static</b>. They can be altered by various activities, pointing to <b style='color: forestgreen;'>plasticity</b> within cortical circuits, allowing for adaptation and learning based on sensory experiences. This plasticity is evident even in adults, contrary to previous beliefs that such adaptability was restricted to early development.\n\n<b style='color: forestgreen;'>Neurons</b> demonstrate changes in their receptive field sizes and connections, enhancing or diminishing them based on <b style='color: forestgreen;'>experience</b>, such as visual stimulus exposure. Such changes are synonymous with <b style='color: forestgreen;'>Hebbian plasticity</b>, a concept that proposes that synaptic strength increases through repetitive, synchronous activity. The research shows that even subtle alterations in <b style='color: forestgreen;'>stimulus exposure</b> can lead to measurable changes in <b style='color: forestgreen;'>synaptic responses</b>, indicating a <b style='color: forestgreen;'>state of constant adjustment</b> to environmental inputs.\n\nThis adaptive capability in the visual cortex is linked to <b style='color: forestgreen;'>perceptual learning</b>, enabling improvements in distinguishing visual patterns and properties like <b style='color: forestgreen;'>acuity</b> and <b style='color: forestgreen;'>orientation</b> through practice. The findings suggest possible practical applications such as rehabilitation for <b style='color: forestgreen;'>sensory impairments</b> and underscore the importance of ongoing <b style='color: forestgreen;'>neural plasticity</b> for acquiring and refining perceptual skills throughout life. The structural and functional adaptability observed indicates that the visual cortex remains highly responsive to <b style='color: forestgreen;'>contextual visual information</b>, revising its operational parameters to optimize <b style='color: forestgreen;'>sensory processing</b>."
        },
        {
            "title": "Dynamics of Receptive Field Responses",
            "body": "In this section, the <b style='color: forestgreen;'>response</b> of the <b style='color: forestgreen;'>receptive field (RF)</b> to different <b style='color: forestgreen;'>stimuli</b> is discussed. Researchers studied <b style='color: forestgreen;'>intracellular responses</b> in area 17 of the brain using <b style='color: forestgreen;'>gratings</b> of various shapes and sizes. They found that significant <b style='color: forestgreen;'>depolarizing responses</b> could be elicited by stimulating both the <b style='color: forestgreen;'>central</b> and <b style='color: forestgreen;'>peripheral</b> areas surrounding the <b style='color: forestgreen;'>minimal discharge field (MDF)</b> of the RF. These responses were more <b style='color: forestgreen;'>phasic</b> as the distance increased from the center. A key finding was that certain responses were better revealed by <b style='color: forestgreen;'>drifting gratings</b> than by static patches of light, indicating differences in <b style='color: forestgreen;'>subthreshold responses</b>. Such interactions emphasized complex <b style='color: forestgreen;'>temporal and spatial summation processes</b>, which involve several pathways. These include <b style='color: forestgreen;'>lateral connectivity</b> at various levels such as the retina or within the cortex, and <b style='color: forestgreen;'>feedback projections</b> from other areas or structures. \n\nAdditionally, the study observed that transverse connectivity often resulted in significant <b style='color: forestgreen;'>hyperpolarizing responses</b>. These were potentially mediated by <b style='color: forestgreen;'>inhibitory interneurons</b> located in area 17, known for having <b style='color: forestgreen;'>long-range axons</b>. The differences in <b style='color: forestgreen;'>latency</b> between responses induced by central and peripheral stimulation were also significant. A systematic delay, often around <b style='color: forestgreen;'>30 ms</b>, was observed, which is indicative of how information travels through the cortical network. This delay also helped define the <b style='color: forestgreen;'>apparent speed of propagation (ASP)</b> and shed light on potential pathways for <b style='color: forestgreen;'>horizontal propagation</b>. Such delays are consistent with the conduction speeds of <b style='color: forestgreen;'>horizontal axons</b> in visual cortex slices, suggesting that <b style='color: forestgreen;'>intracortical polysynaptic transmission</b> might play a role.\n\nThe document further examines the complexities involving <b style='color: forestgreen;'>central-peripheral interactions</b> within the RF. They use different methods to assess these dynamics, including the influence of <b style='color: forestgreen;'>peripheral inputs</b> on the <b style='color: forestgreen;'>subthreshold level</b> and various <b style='color: forestgreen;'>pathways</b>, such as <b style='color: forestgreen;'>thalamo-cortical axons</b> and <b style='color: forestgreen;'>feedback projections</b>. These pathways differ not only in <b style='color: forestgreen;'>retinotopic mapping</b> precision but also in RF size, offering insights into the <b style='color: forestgreen;'>conduction velocities</b> of neural inputs and their underlying mechanisms. Interestingly, the differences in observed cortical latencies might be due to <b style='color: forestgreen;'>dendritic path conduction</b>, which can significantly <b style='color: forestgreen;'>influence synaptic potency</b> by filtering excitatory post-synaptic potentials (EPSPs). These findings underscore the intricate spatial relationships and underscore the non-linearities and temporal dynamics present in the cortical network."
        },
        {
            "title": "Neural Synchrony in Visual Cortex",
            "body": "In the <b style='color: forestgreen;'>primate visual cortex</b>, the ability to process and represent <b style='color: forestgreen;'>sensory signals</b> is not fully understood. Traditional theories highlight the response rate of <b style='color: forestgreen;'>individual neurons</b> as crucial, but this overlooks <b style='color: forestgreen;'>population coding</b>—where groups of neurons work together to paint a complete picture of sensory input. While <b style='color: forestgreen;'>single neuron activity</b> might suffice for simple tasks, complex objects need collective neuron engagement, suggesting a limitation of the single neuron theory.\n\nThe discussion extends to <b style='color: forestgreen;'>neural synchrony</b> and how neurons firing <b style='color: forestgreen;'>simultaneously</b> can signal participation in the same stimulus representation. This phenomenon might help to <b style='color: forestgreen;'>bind</b> information, distinguishing elements within a visual scene. For example, cells in <b style='color: forestgreen;'>MT and IT</b> areas of a monkey's brain demonstrate synchrony, suggesting coordinated action to <b style='color: forestgreen;'>represent motion</b> or <b style='color: forestgreen;'>complex stimuli</b>. This *coordinated firing* helps link together responses evoked by the same signal.\n\nA significant challenge in <b style='color: forestgreen;'>visual representation</b> is how neurons adapt to <b style='color: forestgreen;'>concurrent stimuli</b>, generating <b style='color: forestgreen;'>ambiguous messages</b> without clear spatial distinction. Synchrony might offer a solution by enabling neurons to <b style='color: forestgreen;'>temporally mark</b> responses belonging to the same stimulus. <b style='color: forestgreen;'>Retinotopic mapping</b> provides some separation, but spatial proximity isn't enough—the higher pathway lacks retinotopic fidelity. Synchrony allows for <b style='color: forestgreen;'>dynamic assembly</b>, enabling flexible connectivity in response to changing stimulus configurations."
        },
        {
            "title": "Understanding Perception Through Single Neurons vs. Cell Assemblies",
            "body": "The <b style='color: forestgreen;'>first section</b> of the article discusses the value of studying individual <b style='color: forestgreen;'>neurons</b> rather than collective cell assemblies in understanding <b style='color: forestgreen;'>perception</b> in the brain. Barlow argues against the common belief that cell assemblies offer better explanations for sensory functions by emphasizing that single neurons can account for the <b style='color: forestgreen;'>behavioral facts</b> related to perception. He notes that while single neuron studies are helpful in understanding perception, they are not relevant to areas like drug actions or social behavior which require different levels of analysis.\n\nIn the <b style='color: forestgreen;'>second section</b>, he critiques arguments in favor of cell assemblies, suggesting that these arguments are often based on flawed premises. For example, it is misleading to claim that orientation discrimination requires more than single cells because the psychophysical orientation ability improves with stimulus length beyond the receptive field of a single neuron. Hence, single neuron properties should be compared with the psychophysical discrimination for stimuli within the same scale as the neuron's receptive field.\n\nFinally, Barlow admits there are some cases starting to convince him of the relevance of <b style='color: forestgreen;'>cell assemblies</b>. He describes some evidence for assemblies, although he primarily remains skeptical of their overarching utility in providing a comprehensive understanding of perception. His discussion provides a <b style='color: forestgreen;'>nuanced</b> angle on the ongoing debate about the levels of analysis in understanding brain functions."
        },
        {
            "title": "Neural Binding and Mental Composition",
            "body": "<h3 style='color: forestgreen;'>The Complexity of Neural Binding</h3>\n\n<b style='color: forestgreen;'>Mental processes</b> involve the *binding* of various <b style='color: forestgreen;'>mental entities</b> into <b style='color: forestgreen;'>coherent patterns</b> or <b style='color: forestgreen;'>maps</b> across time. This idea aligns with <b style='color: forestgreen;'>neurobiological findings</b> where <b style='color: forestgreen;'>neurons synchronize</b> through <b style='color: forestgreen;'>accurate and recursive temporal patterns</b>. Such synchronization could mean that <b style='color: forestgreen;'>meaning</b> is constructed through <b style='color: forestgreen;'>neural timing and spatial representation</b>, rather than just neural activity itself. This *synfire chain model*, proposed by <b style='color: forestgreen;'>Moshe Abeles</b>, suggests an analogy between <b style='color: forestgreen;'>Lego blocks</b> and how the brain forms <b style='color: forestgreen;'>mental constructs</b>.\n\n<h3 style='color: forestgreen;'>Mapping the Brain Dynamics</h3>\n\n<b style='color: forestgreen;'>Binding in the brain</b> concerns forming <b style='color: forestgreen;'>maps between maps</b>, with neuronal constructs akin to <b style='color: forestgreen;'>Lego structures</b>. Just as Lego blocks build complex shapes through connecting pieces, <b style='color: forestgreen;'>neurons form complex patterns</b> of connections through <b style='color: forestgreen;'>synapses</b> and <b style='color: forestgreen;'>temporal synchrony</b>. *Commutative mapping diagrams* describe how different <b style='color: forestgreen;'>neuronal circuits</b> or <b style='color: forestgreen;'>cell assemblies</b> might interact, functioning as <b style='color: forestgreen;'>lock-and-key</b> mechanisms to form *consistent neural functions.* This highlights the importance of <b style='color: forestgreen;'>neuronal timing and coordination</b>.\n\n<h3 style='color: forestgreen;'>Bridging Mental Constructs</h3>\n\nExploring how the mind constructs meaning involves considering how different cognitive domains are <b style='color: forestgreen;'>connected</b> or <b style='color: forestgreen;'>mapped</b>. Using a <b style='color: forestgreen;'>neural metaphor</b>, languages like <b style='color: forestgreen;'>Lego</b>, help illustrate how <b style='color: forestgreen;'>complex neural interactions</b> and <b style='color: forestgreen;'>mental relationships</b> are structured. There is suggestion here for exploring this neural basis of <b style='color: forestgreen;'>consciousness and complex thinking</b>. The high dimensionality of neuronal connection networks allows <b style='color: forestgreen;'>flexible associations of ideas</b> that seem vastly different, enabling thought processes that integrate <b style='color: forestgreen;'>varied mental and sensory experiences.</b>"
        }
    ]
}