{
    "meta": {
        "title": "Design for How People Think: Using Brain Science to Build Better Products",
        "author": "John Whalen, PhD",
        "category": "Product Design / User Experience",
        "publisher": "O'Reilly Media",
        "pages": 238
    },
    "parts": [
        {
            "title": "Introduction to Why Design and Psychology Matter",
            "body": "The preface introduces why the <b style='color: forestgreen;'>author</b> wrote this book, emphasizing the application of <b style='color: forestgreen;'>psychology</b> in <b style='color: forestgreen;'>product design</b>. Many people are surprised that a psychologist can contribute to this field, often asking if they're being analyzed. The book provides a path for designing <b style='color: forestgreen;'>great experiences</b> by combining various <b style='color: forestgreen;'>cognitive processes</b> and <b style='color: forestgreen;'>senses</b>. It highlights that people aren't always aware of their own mental processes, like <b style='color: forestgreen;'>recognizing colors</b> without conscious awareness. The author, trained in <b style='color: forestgreen;'>cognitive science</b>, shares insights to improve products, aiming to help <b style='color: forestgreen;'>product managers</b> and designers identify these cognitive aspects and use <b style='color: forestgreen;'>interviews</b> to enhance the design process, ensuring products meet the audience's needs effectively. This hands-on, practical guide is meant for professionals eager to create exceptional, memorable experiences. The <b style='color: forestgreen;'>Six Minds framework</b> outlined aims to better understand and segment audience needs for successful product development."
        },
        {
            "title": "Preface: Engaging Psychologists and Cognitive Scientists",
            "body": "In a <b style='color: forestgreen;'>practical</b> book, the author can't cover all the <b style='color: forestgreen;'>nuances</b> of the mind/brain but aims to communicate relevant information on designing products and services with an understanding of cognitive processes. The goal is to have a <b style='color: forestgreen;'>psychologically driven design</b> process and integrate what we know about our <b style='color: forestgreen;'>minds</b> into product design. The author encourages feedback from psychologists and cognitive scientists to refine his approach."
        },
        {
            "title": "Memory, Semantics, and Expectations",
            "body": "<b style='color: forestgreen;'>Memory</b> and <b style='color: forestgreen;'>perception</b> often work in <b style='color: forestgreen;'>abstract</b> ways rather than detailed ones. People use <b style='color: forestgreen;'>stereotypes</b>, conceptual <b style='color: forestgreen;'>memories</b>, and <b style='color: forestgreen;'>mental models</b> to quickly process visual scenes and interactions. For example, when asked to distinguish a US penny from similar images, most people struggle because their memory doesn't store all the specific details of the coin; it stores a general <b style='color: forestgreen;'>concept</b> of it. The chapter also discusses the phenomenon of <b style='color: forestgreen;'>boundary extension</b>, where the mind fills in gaps beyond the <b style='color: forestgreen;'>edges</b> of a scene based on <b style='color: forestgreen;'>assumptions</b>. This cognitive tendency can be applied positively in <b style='color: forestgreen;'>product</b> and <b style='color: forestgreen;'>service design</b> by creating experiences that align with users' <b style='color: forestgreen;'>stereotypes</b> and expectations—leading to a more intuitive and trustworthy interaction without needing thorough instructions or explanations."
        },
        {
            "title": "Language and Semantic Design in Communication",
            "body": "In this section, we focus on <b style='color: forestgreen;'>language and semantics</b> in design. Language helps us understand how <b style='color: forestgreen;'>audiences</b> perceive our products. But words can have different meanings for different people. <b style='color: forestgreen;'>Laypeople</b> and <b style='color: forestgreen;'>experts</b> might use different terms, like in <b style='color: forestgreen;'>healthcare</b> jargon. This impacts product <b style='color: forestgreen;'>trust</b> and <b style='color: forestgreen;'>experience</b>.\n\nCommunication can fail when overusing <b style='color: forestgreen;'>jargon</b> or misaligning with consumer <b style='color: forestgreen;'>understanding</b>. This applies to <b style='color: forestgreen;'>texting</b> habits, where terms vary by culture or age. Designers should ensure people feel like 'you're speaking my language' to create comfort. Notably, <b style='color: forestgreen;'>translations</b> can alter meanings in different regions, like a <b style='color: forestgreen;'>Chesterfield</b> in Canada is a <b style='color: forestgreen;'>couch</b> in the US. Interviews help identify the exact terms clients use, bridging the experience divide."
        },
        {
            "title": "Unlocking User Needs Through Contextual Interviews",
            "body": "This section delves into <b style='color: forestgreen;'>contextual interviews</b>, which combine <b style='color: forestgreen;'>watching</b> and <b style='color: forestgreen;'>interviewing</b> people in their <b style='color: forestgreen;'>natural settings</b> to uncover the \"<b style='color: forestgreen;'>why</b>\" behind their behaviors. Unlike traditional focus groups and surveys, contextual interviews help reveal <b style='color: forestgreen;'>unconscious actions</b> and <b style='color: forestgreen;'>nuances</b> in customer behavior, allowing for a deep understanding needed for <b style='color: forestgreen;'>successful product design</b>. By observing <b style='color: forestgreen;'>superusers</b> and the environments where users live, researchers can gather critical insights into <b style='color: forestgreen;'>inefficiencies</b> and <b style='color: forestgreen;'>innovations</b> that are often overlooked. This hands-on approach helps in <b style='color: forestgreen;'>stepping into users' minds</b>, adapting a customer-centric perspective, and uncovering <b style='color: forestgreen;'>hidden opportunities</b> to enhance user experiences."
        },
        {
            "title": "Understanding User Wayfinding",
            "body": "<b style='color: forestgreen;'>Wayfinding</b> involves understanding where users think they are in virtual or <b style='color: forestgreen;'>physical space</b>, how they expect to navigate from <b style='color: forestgreen;'>Point A</b> to <b style='color: forestgreen;'>Point B</b>, and the <b style='color: forestgreen;'>cues</b> they use to determine their location. In product design, it is crucial to incorporate virtual <b style='color: forestgreen;'>signposts</b> or cues to help users orient themselves and know their path within a system. Understanding users’ expectations and how they fill in gaps in their navigation is vital.\n\nIn terms of <b style='color: forestgreen;'>navigation strategies</b>, users may rely on external tools like <b style='color: forestgreen;'>search engines</b> for assistance. When designing <b style='color: forestgreen;'>products or services</b>, it is important to consider the entire ecosystem and <b style='color: forestgreen;'>non-obvious</b> pathways users might take based on their past experiences or <b style='color: forestgreen;'>assumptions</b>. Observing users can reveal unexpected <b style='color: forestgreen;'>workarounds</b> and \"tricks\" they use, which help in tailoring better <b style='color: forestgreen;'>interaction designs</b> that meet user needs and expectations."
        },
        {
            "title": "Exploring User Emotion in Product Design",
            "body": "This section delves into <b style='color: forestgreen;'>emotion</b> as one of the six key factors influencing how users interact with products. It suggests considering emotions on three levels: <b style='color: forestgreen;'>Appeal</b> (what instantly attracts customers), <b style='color: forestgreen;'>Enhance</b> (factors that add meaningful value over time), and <b style='color: forestgreen;'>Awaken</b> (elements that align with users’ deeper aspirations and fears). Understanding these dimensions helps design products that cater to immediate reactions as well as long-term desires and anxieties. This approach uses insights from <b style='color: forestgreen;'>Daniel Kahneman</b> about loss and gain, emphasizing the importance of understanding <b style='color: forestgreen;'>users' fears</b> alongside their goals."
        },
        {
            "title": "Emotions and User Interface Design",
            "body": "The content discusses <b style='color: forestgreen;'>emotional impact on financial decisions</b> and <b style='color: forestgreen;'>user interface design</b>. Customers reacted emotionally to credit-related issues like identity theft, displaying <b style='color: forestgreen;'>fear</b> and <b style='color: forestgreen;'>anxiety</b>. This influenced their decision-making, showing the powerful role of emotions in consumer behavior. Designers must address these emotions to restore trust and improve experiences.\n\nIn user interface design, the <b style='color: forestgreen;'>Six Minds framework</b> helps understand user behavior and design better. It involves aspects like <b style='color: forestgreen;'>language</b>, <b style='color: forestgreen;'>emotion</b>, and <b style='color: forestgreen;'>wayfinding</b>. By analyzing these, designers can identify <b style='color: forestgreen;'>user segments</b> to create tailored product experiences, enhancing usability and satisfaction."
        },
        {
            "title": "Using the Six Minds in the Double Diamond Process",
            "body": "In this section, the <b style='color: forestgreen;'>Double Diamond</b> design process is introduced, which includes: <b style='color: forestgreen;'>Discover, Define, Develop, and Deliver</b>. Using the <b style='color: forestgreen;'>Six Minds</b> method helps to efficiently empathize with user needs during the discovery and definition stages. The aim is to identify opportunities to appeal, enhance, and awaken audience passions, thus refining problem-solving before pursuing design solutions. In the second diamond (develop and deliver), <b style='color: forestgreen;'>vision/attention</b>, <b style='color: forestgreen;'>wayfinding</b>, <b style='color: forestgreen;'>memory</b>, and <b style='color: forestgreen;'>problem solving</b> are key to informing and constraining design choices by understanding how users interact with products."
        },
        {
            "title": "Designing with Six Minds Framework",
            "body": "You're equipped to <b style='color: forestgreen;'>design experiences</b> using the \"Six Minds\" framework, resulting in <b style='color: forestgreen;'>better, faster design outcomes</b> with less debate. This chapter summarizes the journey so far and previews possible <b style='color: forestgreen;'>outcomes from employing the Six Minds</b>. Unique to this approach is the inclusion of <b style='color: forestgreen;'>empathy at various cognitive levels</b>—acknowledging not just the user’s functional problems but also considering cognitive systems like <b style='color: forestgreen;'>language, decision-making</b>, and <b style='color: forestgreen;'>emotional qualities</b> during design.\n\nEvery “experience” entails numerous “<b style='color: forestgreen;'>micro-experiences</b>” that collectively shape the perception of a singular event, like the series of experiences during an airport visit. Recognizing that experiences are often <b style='color: forestgreen;'>a series of interconnected moments</b> prompts us to consider the <b style='color: forestgreen;'>cumulative impact</b> while designing."
        }
    ]
}