{
    "meta": {
        "title": "Foundation",
        "author": "Isaac Asimov",
        "publisher": "Gnome Press",
        "pages": 233
    },
    "parts": [
        {
            "title": "The Beginning of Foundation",
            "body": "<b style='color: forestgreen;'>Isaac Asimov's Foundation begins with a young mathematician, Gaal Dornick</b>, traveling to Trantor to meet the legendary figure, <b style='color: forestgreen;'>Hari Seldon</b>. Set in the vast expanse of the <b style='color: forestgreen;'>Galactic Empire</b>, the story paints a picture of a <b style='color: forestgreen;'>society influenced by Seldon's revolutionary science of \"psychohistory\"</b>, capable of predicting vast trends affecting civilizational destinies. Gaal is excited but naive, experiencing space travel's wonders while oblivious to the looming Empire's political tensions. His arrival sets the stage for a tale of ambition, science, and the decay of imperial power."
        },
        {
            "title": "Gaal's Detention and Questioning by Commission",
            "body": "<b style='color: forestgreen;'>Gaal</b> woke up to find <b style='color: forestgreen;'>himself detained</b> by the <b style='color: forestgreen;'>Commission of Public Safety</b> at their orders. They questioned him about his <b style='color: forestgreen;'>connection with Dr. Seldon</b> and the <b style='color: forestgreen;'>project</b> but Gaal declared his innocence. During the questioning, they disclosed they had been <b style='color: forestgreen;'>tracking his movements</b> since his arrival, and were aware of <b style='color: forestgreen;'>Seldon's prediction</b> of Trantor's future, needing to validate it with Gaal. When asked if Seldon had shared a <b style='color: forestgreen;'>destruction timeline</b>, Gaal confirmed he had but insisted the prediction is <b style='color: forestgreen;'>mathematical and scientific</b>, not politically motivated."
        },
        {
            "title": "Trial and Purpose of Psychohistory",
            "body": "<b style='color: forestgreen;'>Gaal</b> is on <b style='color: forestgreen;'>Trantor</b> for the trial of <b style='color: forestgreen;'>Dr. Seldon</b>, who remains <b style='color: forestgreen;'>unperturbed</b> despite being the focus of the hearings. The trial is private, focused on <b style='color: forestgreen;'>Seldon’s prediction</b> of the <b style='color: forestgreen;'>Empire’s downfall</b>. Seldon argues scientifically that <b style='color: forestgreen;'>Trantor</b> will be ruined within three centuries due to various social factors. He employs psychohistory, a branch of mathematics that accounts for large human groups, to support his predictions. He stresses the <b style='color: forestgreen;'>importance</b> of preparing for this by gathering an army of thinkers to <b style='color: forestgreen;'>compile an \"Encyclopedia Galactica.\"</b> The <b style='color: forestgreen;'>Commission's Advocate</b> attempts to trap Seldon by questioning the practicable <b style='color: forestgreen;'>purpose</b> of his project, suggesting insurrection, but Seldon insists the purpose is to <b style='color: forestgreen;'>\"minimize the effects of Trantor's destruction.\"</b>"
        },
        {
            "title": "Seldon's Exile Negotiation",
            "body": "<b style='color: forestgreen;'>Seldon's</b> execution, according to him, would have <b style='color: forestgreen;'>accelerated</b> the <b style='color: forestgreen;'>fall</b> of <b style='color: forestgreen;'>Trantor</b>. He explains to <b style='color: forestgreen;'>Chief Commissioner Chen</b> that his death now would project a <b style='color: forestgreen;'>bleak</b> future to the people, leading to <b style='color: forestgreen;'>political revolutions</b> and <b style='color: forestgreen;'>trade stagnations</b>. While Chen tries to downplay this as mere <b style='color: forestgreen;'>frightening words</b>, he proposes an <b style='color: forestgreen;'>alternative</b> to death: <b style='color: forestgreen;'>exile</b> to <b style='color: forestgreen;'>Terminus</b>, a less <b style='color: forestgreen;'>distracting planet</b> to continue work on the encyclopedia. Seldon muses that such a location has <b style='color: forestgreen;'>minor</b> disadvantages, but the decision could possibly keep the <b style='color: forestgreen;'>Empire's peace</b> intact, though it comes with a <b style='color: forestgreen;'>threat of death</b> if not accepted."
        },
        {
            "title": "Seldon's Revelation of the Real Plan",
            "body": "<b style='color: forestgreen;'>Hari Seldon's holographic message reveals the truth</b> about the Encyclopedia Foundation - it was all a <b style='color: forestgreen;'>fraud</b> to keep them busy until they had no choice but to continue with a much bigger plan that he had foreseen. The <b style='color: forestgreen;'>real purpose</b> of this plan was to create a civilizing force to <b style='color: forestgreen;'>reduce the period of chaos</b> after the Empire's fall from 30,000 years to just 1,000 years. Seldon explains that <b style='color: forestgreen;'>the path</b> set by his plan has been meticulously calculated using psychology so there is only <b style='color: forestgreen;'>one path</b> to follow through a series of predicted crises.\n\nThe current crisis of being an isolated, threatened planet with nuclear resources but no metals was <b style='color: forestgreen;'>anticipated</b> by Seldon. This particular crisis is deemed <b style='color: forestgreen;'>straightforward</b>, and he claims the solution is <b style='color: forestgreen;'>obvious</b>. This was intended to start Terminus off towards becoming a seed for the future Second Galactic Empire. His message declares that the <b style='color: forestgreen;'>path is marked out</b> for future generations, implying the importance of trust in his plan."
        },
        {
            "title": "Hardin and Verisof Discuss Anacreon Tensions",
            "body": "<b style='color: forestgreen;'>Salvor Hardin</b> and <b style='color: forestgreen;'>Ambassador Verisof</b> discuss the political situation on <b style='color: forestgreen;'>Anacreon</b>. Verisof describes the <b style='color: forestgreen;'>Prince Regent Wienis</b>, who is eager to attack the <b style='color: forestgreen;'>Foundation</b>. Ancreon discovered a <b style='color: forestgreen;'>derelict Imperial battle cruiser</b> and wants the Foundation's help to repair it, using refusal as a pretext for war. Hardin plans to defuse the situation by agreeing to repair the ship, showing confidence that <b style='color: forestgreen;'>Anacreon</b> lacks true capability to harm the Foundation significantly."
        },
        {
            "title": "Tensions and Threats on Anacreon",
            "body": "In an exchange between Wienis, the regent, and <b style='color: forestgreen;'>Hardin</b>, the mayor of <b style='color: forestgreen;'>Terminus</b>, we see that <b style='color: forestgreen;'>Wienis</b> is determined to use direct action to force the <b style='color: forestgreen;'>Foundation</b> to cooperate with Anacreon. <b style='color: forestgreen;'>Hardin</b> has been taken prisoner and is in a room surrounded by guards. <b style='color: forestgreen;'>Wienis</b> informs <b style='color: forestgreen;'>Hardin</b> that <b style='color: forestgreen;'>Anacreon</b>'s navy is heading to attack <b style='color: forestgreen;'>Terminus</b>, expecting no resistance as they have been armed by the <b style='color: forestgreen;'>Foundation</b>. However, <b style='color: forestgreen;'>Hardin</b> reveals his counterstroke: he has ordered every priest on Anacreon to go on strike. This means there is no power outside of the temples, deepening the chaotic situation in <b style='color: forestgreen;'>Anacreon</b>."
        },
        {
            "title": "Aporat and Wienis's Reluctance and Command",
            "body": "<b style='color: forestgreen;'>Hardin</b> lightly speaks to <b style='color: forestgreen;'>Wienis</b>, mentioning the <b style='color: forestgreen;'>hyperwave relay</b> which is about to be demonstrated. The <b style='color: forestgreen;'>televisor</b> springs to life, drawing <b style='color: forestgreen;'>Wienis</b>'s attention.\n\n<b style='color: forestgreen;'>Theo Aporat</b>, high-ranking <b style='color: forestgreen;'>priest of Anacreon</b>, feels conflicted over how the <b style='color: forestgreen;'>ship</b> is being used against the <b style='color: forestgreen;'>Foundation</b>. Despite his role in its repairs, including installing the <b style='color: forestgreen;'>hyperwave relay</b>, he is against its use for evil. <b style='color: forestgreen;'>Prince Lefkin</b> of <b style='color: forestgreen;'>Wienis</b> dismisses warnings, focusing on the operation of the <b style='color: forestgreen;'>ship</b> instead."
        },
        {
            "title": "Ponyets' Gold-Making Machine and Askonians' Acceptance",
            "body": "<b style='color: forestgreen;'>Ponyets</b> demonstrated his <b style='color: forestgreen;'>gold-making machine</b> for the <b style='color: forestgreen;'>Askonians</b> to gain their favor. Although his <b style='color: forestgreen;'>sales technique</b> was rough, his device worked, turning <b style='color: forestgreen;'>iron into gold</b>. When <b style='color: forestgreen;'>Pherl</b>, a councilor of Askon, expressed doubt about the <b style='color: forestgreen;'>gold's purity due to its origin</b>, Ponyets cleverly argued that the <b style='color: forestgreen;'>gold's evil</b> would be nullified when used in the <b style='color: forestgreen;'>service of ancestors</b>.\n\nDespite Pherl's hesitations, the Grand Master was convinced by Ponyets' argument. Ponyets further suggested a <b style='color: forestgreen;'>thirty-day trial period</b> to assure them of the gold's purity. After some consideration and citing Ponyets' logic, the <b style='color: forestgreen;'>council agreed</b>. Ponyets proved that a <b style='color: forestgreen;'>religious perspective</b> could be manipulated to gain a favorable outcome."
        },
        {
            "title": "Mallow's Surprising Demonstration",
            "body": "<b style='color: forestgreen;'>After</b> the tense encounter with a <b style='color: forestgreen;'>tech-man</b>, Mallow demonstrates the power of his <b style='color: forestgreen;'>personal force-shield</b>. This device is <b style='color: forestgreen;'>something</b> the <b style='color: forestgreen;'>Emperor himself does not possess</b>. By <b style='color: forestgreen;'>surviving</b> a direct <b style='color: forestgreen;'>blaster shot</b>, Mallow not only <b style='color: forestgreen;'>demonstrates</b> its capabilities but also <b style='color: forestgreen;'>surprises</b> the tech-man, proving the <b style='color: forestgreen;'>value</b> of his offering. The tech-man was reluctant to cooperate, but this <b style='color: forestgreen;'>demonstration changes his mind</b>."
        },
        {
            "title": "Mallow's Political Aspirations and Strategies with Jael",
            "body": "<b style='color: forestgreen;'>Mallow</b> is quite <b style='color: forestgreen;'>relaxed</b>, enjoying a break after long efforts. He discusses his <b style='color: forestgreen;'>political aims</b> with <b style='color: forestgreen;'>Ankor Jael</b>, mentioning his <b style='color: forestgreen;'>plan</b> to gain a <b style='color: forestgreen;'>council seat</b>. <b style='color: forestgreen;'>Jael</b> is a former politician with experience, who lost his position to <b style='color: forestgreen;'>Jorane Sutt</b>, an opponent of Mallow. Jael acknowledges Mallow’s difficulties in becoming a councilman due to <b style='color: forestgreen;'>prejudice</b>. He emphasizes that Mallow needs to <b style='color: forestgreen;'>convince</b> the public, which is <b style='color: forestgreen;'>prejudiced</b>, especially as he is a <b style='color: forestgreen;'>Smyrnian</b>. Mallow has resources and is determined to pursue his goals. The situation is complex because <b style='color: forestgreen;'>Sutt</b>, a clever politician, is against him. Mallow relies on <b style='color: forestgreen;'>wealth</b> and political strategy, including an <b style='color: forestgreen;'>eventual alliance</b> with Jael to reach his <b style='color: forestgreen;'>ambitions</b>."
        }
    ]
}