{
    "meta": {
        "title": "Levers: The Framework for Building Repeatability into Your Business",
        "author": "Amos Schwartzfarb & Trevor Boehm",
        "category": "Business & Economics",
        "publisher": "BenBella Books",
        "pages": 158
    },
    "parts": [
        {
            "title": "W3: The Essential Starting Point for Every Business",
            "body": "<b style='color: forestgreen;'>W3, or <em style='color: forestgreen;'>Who, What, Why</em></b>, are the <b style='color: forestgreen;'>key questions</b> every entrepreneur needs to answer. It's about <b style='color: forestgreen;'>identifying your customer</b> and <b style='color: forestgreen;'>understanding their needs</b>. Amos Schwartzfarb uses Char Hu's story to illustrate the power of knowing your audience. Char started marketing to aging adults' <b style='color: forestgreen;'>children</b> and pivoted to <b style='color: forestgreen;'>insurance companies</b>, which fueled immense growth for The Helper Bees. This chapter emphasizes that these questions aren't just <b style='color: forestgreen;'>initial checkpoints</b> but need <b style='color: forestgreen;'>constant revisiting</b>. Your business's <b style='color: forestgreen;'>success hinges</b> on having clear answers to <b style='color: forestgreen;'>these questions</b>, as they shape your path to a <b style='color: forestgreen;'>thriving enterprise</b>."
        },
        {
            "title": "Introduction to W3 Workshop",
            "body": "The workshop, W3, is designed to help businesses understand <b style='color: forestgreen;'>whom</b> they are selling to, <b style='color: forestgreen;'>what</b> they are selling, and <b style='color: forestgreen;'>why</b> it's being purchased. Initially, company representatives answer these three questions quickly, which often feels easy. But, when asked, \"<b style='color: forestgreen;'>How do you know?</b>\" and given more time to provide evidence or data supporting their answers, businesses start recognizing gaps in their understanding. This exercise reveals that many entrepreneurs might not have as clear a picture of their W3 as they thought, often lacking quantifiable data or fully realizing the <b style='color: forestgreen;'>work needed</b> to genuinely validate their assumptions. The aim is to foster an honest reassessment and stronger foundation for their business strategies."
        },
        {
            "title": "Understanding the Why: Business vs. Buyer",
            "body": "When selling to businesses, it's crucial to understand <b style='color: forestgreen;'>two whys</b>: why the <b style='color: forestgreen;'>business</b> buys your product and why the <b style='color: forestgreen;'>individual buyer</b> does. To better grasp these reasons, you need to identify how the customer will <b style='color: forestgreen;'>measure success</b>. Write down a theory on the \"<b style='color: forestgreen;'>why</b>\" question, how customers will evaluate it, and ensure they have tools to do so. This understanding must be a <b style='color: forestgreen;'>collaborative conversation</b> with prospects and customers.\n\nOnce you've defined a clear theory of your W3—<b style='color: forestgreen;'>Who</b> you sell to, <b style='color: forestgreen;'>What</b> you sell, and <b style='color: forestgreen;'>Why</b> they buy—continue to prove (or disprove) your theory and expand your market. This foundation is key for building a scalable business. Transition your thinking to focus on the <b style='color: forestgreen;'>math</b> behind your business model to ensure success and avoid relying solely on emotional insights or trends."
        },
        {
            "title": "Understanding Revenue Formula: Drivers & Subdrivers",
            "body": "This section explains <b style='color: forestgreen;'>identifying drivers and subdrivers</b> for a company's revenue formula, emphasizing how Business.com and Chowbotics structured theirs. <b style='color: forestgreen;'>Business.com</b> used drivers like <b style='color: forestgreen;'>Visits and Conversion</b>, breaking each down into further elements to find what contributes to revenue. For instance, they looked at subdrivers for <b style='color: forestgreen;'>Direct and Paid visits</b> like search engines or social media (e.g., Google, Facebook). \n\nChowbotics's revenue model revolved around their salad robots, using a formula considering <b style='color: forestgreen;'>Units, Cost per Unit, and Months Installed</b> to calculate revenue. For each component, you must consider all elements contributing to growth. This strategy isn't just a sales funnel; it's a broad <b style='color: forestgreen;'>business funnel</b>, encompassing every aspect crucial for revenue growth."
        },
        {
            "title": "Prioritization and Validation in Business Strategy",
            "body": "In <b style='color: forestgreen;'>Chapter 3</b>, we learn about the critical role of <b style='color: forestgreen;'>prioritization</b> and <b style='color: forestgreen;'>validating assumptions</b> in building a successful business strategy. Using the experience of <b style='color: forestgreen;'>David Bain</b>, a real estate agent, the chapter highlights how he moved from being a sole proprietor to leading a full-service firm by addressing crucial questions on where to focus efforts and what to ignore. This was achieved by treating his business as a <b style='color: forestgreen;'>\"product\"</b> that needed to be shaped and tested just like creating a tech product.\n\nThe chapter then shifts to stressing the importance of <b style='color: forestgreen;'>action over perfect planning</b> in business execution: rather than focusing on creating the ideal product roadmap, it's crucial to bring the <b style='color: forestgreen;'>right offering</b> to market. This requires a <b style='color: forestgreen;'>learning culture</b> where validation of what customers truly want precedes heavy investment in new ideas. Emphasis is placed on the skills required of a \"<b style='color: forestgreen;'>product person\"</b> which include understanding customer needs, creating hypotheses for testing, and prioritizing these tests effectively, especially in the early stages, making it foundational for <b style='color: forestgreen;'>founders</b> to master."
        },
        {
            "title": "Creating Learning-Focused Rhythms",
            "body": "Creating <b style='color: forestgreen;'>learning-focused rhythms</b> can greatly enhance the innovation and understanding within a company. Instead of maintaining a waterfall approach, embedding <b style='color: forestgreen;'>daily learning goals</b> in routine standups encourages team members to seek insights, dedicating a <b style='color: forestgreen;'>fifteen-minute daily task</b> to uncover knowledge that others might overlook. This might include marketers exploring analytics, sales exploring the competitive landscape, or engineers delving into customer feedback. \n\nImplementing <b style='color: forestgreen;'>weekly learning goals</b> can further deepen understanding by aligning the entire team around a specific mission. Allocating a <b style='color: forestgreen;'>portion of product sprints</b> to these goals fosters a culture of continuous learning and curiosity, delivering insights crucial for strategic development. This focus on learning emboldens teams to react nimbly to market changes and pivot effectively, ensuring everything built is based on informed decisions rather than assumptions."
        },
        {
            "title": "Utilizing KPIs Effectively to Measure Business Success",
            "body": "When starting your business, it's important <b style='color: forestgreen;'>to know if your actions are effective</b>. MDaaS, for example, pivoted from medical equipment supply to diagnostic centers after data showed what worked and didn't. ##KPIs (Key Performance Indicators)## can track this. They allow you to utilize <b style='color: forestgreen;'>data to make crucial decisions</b> in your business journey. The chapter guides you to establish <b style='color: forestgreen;'>a single core metric</b> aligned with your goal, allowing team engagement and clarity of action.\n\nKPIs should be like a <b style='color: forestgreen;'>business compass</b>, guiding you towards what's vital now and how to measure progress. Start by asking three questions - <b style='color: forestgreen;'>What’s critical?</b>, <b style='color: forestgreen;'>What proves it's effective?</b>, and <b style='color: forestgreen;'>What comes afterward?</b> This helps you identify key achievements and potential next steps. Also, learn the difference between <b style='color: forestgreen;'>inputs and outputs</b> or <b style='color: forestgreen;'>leading and lagging indicators</b> to utilize your KPIs effectively, ensuring they reveal progress rather than just effort."
        },
        {
            "title": "Setting and Managing Effective KPIs",
            "body": "<b style='color: forestgreen;'>KPIs</b> and <b style='color: forestgreen;'>milestones</b> are crucial for tracking if you are achieving your goals. They help organizations set <b style='color: forestgreen;'>goals</b> for each team and understand how close they are to reaching the next <b style='color: forestgreen;'>important milestone</b>. Proper setup of KPIs enables clear <b style='color: forestgreen;'>communication</b> within the team regarding <b style='color: forestgreen;'>priorities</b> and <b style='color: forestgreen;'>progress</b>. Establishing <b style='color: forestgreen;'>roles</b> for managing KPIs ensures accountability and keeps teams aligned with company goals."
        },
        {
            "title": "Importance of Financial Model and Testing Assumptions",
            "body": "The financial model is a crucial tool for businesses. It enables analysis of how various assumptions affect outcomes. Key assumptions include <b style='color: forestgreen;'>monthly subscription price</b> and <b style='color: forestgreen;'>churn rate</b>. Adjusting these, like raising the subscription price, impacts the <b style='color: forestgreen;'>ending cash balance</b> significantly, more than predicted due to fixed expenses remaining constant. It's vital to understand how changes affect cash to make informed decisions. The model also illustrates what-if scenarios, helping predict impacts of decisions like increasing ad spend or raising <b style='color: forestgreen;'>more funding</b>. Testing assumptions with a financial model enables better planning and alignment with real-world data."
        },
        {
            "title": "Effective Financial Modeling for Business Growth",
            "body": "The chapter discusses leveraging a <b style='color: forestgreen;'>financial model</b> for managing a business. It's emphasized that <b style='color: forestgreen;'>entrepreneurs</b> should use data and precise calculations instead of gut feelings to make decisions about raising funds. A regularly updated model helps in making those informed decisions. Monthly updates with real numbers solidify the model's accuracy, sharpening future predictions. The use of such a model during fundraising can also be powerful, guiding conversations with investors and building strong <b style='color: forestgreen;'>relationships</b>. Moreover, an updated <b style='color: forestgreen;'>financial model</b> aligns with a pitch, ensuring transparency and establishing credibility.\n\nThe financial model process encourages assigning <b style='color: forestgreen;'>responsibilities</b> within a team for each identified <b style='color: forestgreen;'>business lever</b>. This system helps in creating clarity on <b style='color: forestgreen;'>role ownership</b> and how each part contributes to the larger goal. Consistent collaboration and progress reviews keep the team aligned and accountable. Such a model is dynamic, requiring frequent revisits and refinements, making it effective for <b style='color: forestgreen;'>fundraising</b> and scaling a business—ensuring decisions are not random but strategically informed by consistently validated data-driven insights."
        }
    ]
}