{
    "meta": {
        "title": "The Ages of Globalization",
        "author": "Jeffrey D. Sachs",
        "category": "Non-fiction",
        "publisher": "Columbia University Press",
        "pages": 356
    },
    "parts": [
        {
            "title": "The Evolution of Globalization through Seven Ages",
            "body": "<b style='color: forestgreen;'>Globalization</b> has been an essential aspect of human history, evolving through seven distinct <b style='color: forestgreen;'>ages</b>. Each age showcases the interplay of <b style='color: forestgreen;'>geography</b>, <b style='color: forestgreen;'>technology</b>, and <b style='color: forestgreen;'>institutions</b>. This journey began with humanity's migration in the <b style='color: forestgreen;'>Paleolithic Age</b>, advancing to the agricultural growth of the <b style='color: forestgreen;'>Neolithic Age</b>. The domestication of the horse marked the <b style='color: forestgreen;'>Equestrian Age</b>, fostering long-distance trade. The <b style='color: forestgreen;'>Classical Age</b> introduced large empires and trans-Eurasian interactions. The <b style='color: forestgreen;'>Ocean Age</b> expanded territories across oceans, while the <b style='color: forestgreen;'>Industrial Age</b> accelerated technological advancements. Today, the <b style='color: forestgreen;'>Digital Age</b> challenges us with global interconnectedness through technology. The book emphasizes understanding these transitions to navigate future global changes wisely. This understanding is crucial now more than ever as we face contemporary challenges."
        },
        {
            "title": "Economic Transformation and Global Dynamics",
            "body": "<b style='color: forestgreen;'>The chapter summarizes the progression</b> of human societies from <b style='color: forestgreen;'>rural to urban living</b>, highlighting changes in economic sectors and introducing <b style='color: forestgreen;'>geography, technology, and institutions</b> as foundational elements of economies. Initial societal activities were <b style='color: forestgreen;'>primary sector-focused</b> (agriculture and mining), but modern advances shifted employment <b style='color: forestgreen;'>towards services</b>. Machines have largely replaced human physical labor, resulting in a service-dominant economy, especially in places like the <b style='color: forestgreen;'>United States, with 85%</b> of jobs in services. The <b style='color: forestgreen;'>geographical, technological, and institutional factors</b> are interdependent, influencing economic history as seen in inventions like the <b style='color: forestgreen;'>steam engine</b>.\n\n<b style='color: forestgreen;'>Geographical factors</b> include climate, disease patterns, and energy resources, all influencing a region's economic capabilities. Technology advances make <b style='color: forestgreen;'>natural resources</b> more valuable, re-shaping geography's economic impact. Social institutions also play a crucial role, blending across geography and technology to influence society's functioning. <b style='color: forestgreen;'>Geopolitical</b> considerations show how past empires leveraged technological advances in military and agriculture to expand. Yet rapid change, especially through means like <b style='color: forestgreen;'>digital technologies</b>, continuously reshapes global power dynamics. The interconnectedness of these areas highlights how they <b style='color: forestgreen;'>collectively influence</b> economic and societal development."
        },
        {
            "title": "The Significance of Horse Domestication in Eurasia",
            "body": "<b style='color: forestgreen;'>Eurasia</b> had long <b style='color: forestgreen;'>benefits of:</b> scale, trade, innovation. <b style='color: forestgreen;'>Horse domestication</b> (~5500 years ago) marked significant influence in <b style='color: forestgreen;'>Eurasia’s development.</b> It facilitated transport, agriculture, military, and state governance, thus leading to the first <b style='color: forestgreen;'>Eurasian empires.</b> The <b style='color: forestgreen;'>Eurasian steppes</b> provided crucial grasslands for domestication. These steppe regions acted as highways for trade and exploration due to the <b style='color: forestgreen;'>ample energy input</b> from the abundance of grass. Horse served as crucial transport comparable to modern vehicles."
        },
        {
            "title": "Impact of Domestication on Societies",
            "body": "<b style='color: forestgreen;'>Animal domestication</b> was crucial for economic and social progress. <b style='color: forestgreen;'>Domesticated species</b> such as the <b style='color: forestgreen;'>donkey</b> and <b style='color: forestgreen;'>horse</b> profoundly impacted <b style='color: forestgreen;'>agriculture, trade</b>, and <b style='color: forestgreen;'>communications</b>. Regions without <b style='color: forestgreen;'>horses</b> lagged behind economically and were often subject to conquest from <b style='color: forestgreen;'>cavalries</b>. The <b style='color: forestgreen;'>domestication of horses</b> began in <b style='color: forestgreen;'>Eurasia and spread</b> to influence <b style='color: forestgreen;'>civilizations worldwide</b>. Horses, known for their <b style='color: forestgreen;'>versatility</b> and <b style='color: forestgreen;'>speed</b>, dramatically changed the way societies evolved and interacted.\n\n<b style='color: forestgreen;'>Camelids</b> also played significant roles in extreme <b style='color: forestgreen;'>climates</b>. The <b style='color: forestgreen;'>dromedary</b> and <b style='color: forestgreen;'>Bactrian camels</b> of the <b style='color: forestgreen;'>Old World</b> and the <b style='color: forestgreen;'>llama</b> and <b style='color: forestgreen;'>alpaca</b> of the <b style='color: forestgreen;'>New World</b> were vital to <b style='color: forestgreen;'>trade</b> and <b style='color: forestgreen;'>transport</b> across difficult terrains like deserts and high plateaus. While camels were domesticated later than horses, they quickly became essential for <b style='color: forestgreen;'>trade routes</b> and eventually complemented the <b style='color: forestgreen;'>warhorse</b> in military campaigns. <b style='color: forestgreen;'>Camelids</b> in the <b style='color: forestgreen;'>Andes</b> enabled <b style='color: forestgreen;'>trade</b> and <b style='color: forestgreen;'>agriculture</b> between <b style='color: forestgreen;'>highlands</b> and <b style='color: forestgreen;'>lowlands</b>."
        },
        {
            "title": "Population and Empires in 100 CE",
            "body": "<b style='color: forestgreen;'>The Han and Roman empires</b> accounted for about <b style='color: forestgreen;'>half</b> of the world's population by <b style='color: forestgreen;'>100 CE</b>, each having an estimated <b style='color: forestgreen;'>60 million</b> people. At this time, the <b style='color: forestgreen;'>Eurasian world</b> was dominated by three major empires: <b style='color: forestgreen;'>Roman</b>, <b style='color: forestgreen;'>Parthian</b>, and <b style='color: forestgreen;'>Han</b>. These empires were situated along the west-east axis through the <b style='color: forestgreen;'>lucky latitudes</b>. Meanwhile, the Indian subcontinent was divided among various states like the <b style='color: forestgreen;'>Kushan</b> and <b style='color: forestgreen;'>Indo-Greeks</b>. Regions north and south also had distinct environments like the <b style='color: forestgreen;'>heavily forested northern Europe</b> and the <b style='color: forestgreen;'>deserts of North Africa</b>."
        },
        {
            "title": "Industrialization's Roots in Britain",
            "body": "Britain's <b style='color: forestgreen;'>unique conditions</b> made industrialization possible. An <b style='color: forestgreen;'>intellectual culture</b> valuing science, evident in Newton's time at Cambridge, played a vital role. Successful deployment of <b style='color: forestgreen;'>Watt's steam engine</b> also needed a supportive market system, strong <b style='color: forestgreen;'>patent laws</b>, and private investors like <b style='color: forestgreen;'>Richard Boulton</b> to fund innovations. Britain's <b style='color: forestgreen;'>coal</b> industry gave it an advantage over competitors like Holland, lacking such resources. This resource fueled the steam engine, leading to further technological advancements. \n\nThe steam engine was central to Britain's transition from an \"<b style='color: forestgreen;'>organic</b>\" to an <b style='color: forestgreen;'>energy-rich economy</b> as it powered multiple economic sectors. The steam engine's impact on <b style='color: forestgreen;'>textiles</b>, <b style='color: forestgreen;'>metallurgy</b>, and <b style='color: forestgreen;'>transport</b> was vast and marked the rise of mechanization. It reduced costs across different sectors, including <b style='color: forestgreen;'>agriculture</b>, enhancing global <b style='color: forestgreen;'>food production</b> and population growth. The <b style='color: forestgreen;'>fossil fuel liberation</b> enabled a significant rise in world population, as new agricultural methods increased food supply globally, freeing the economy from prior constraints of <b style='color: forestgreen;'>organic energy</b> dependency."
        },
        {
            "title": "Technological Revolution and Connectivity",
            "body": "The <b style='color: forestgreen;'>digital revolution</b> is reshaping the world, with new patterns of global economic activity, jobs, and lifestyles. It poses <b style='color: forestgreen;'>ecological challenges</b> due to human-induced <b style='color: forestgreen;'>climate change</b> and <b style='color: forestgreen;'>biodiversity destruction.</b> In the 21st century, trends like the <b style='color: forestgreen;'>rise of China and India</b>, <b style='color: forestgreen;'>US decline</b>, rapid <b style='color: forestgreen;'>African growth</b>, and increased <b style='color: forestgreen;'>urbanization</b> define global shifts. Our institutions are under strain from these changes, and as the biologist E.O. Wilson observed, we face \"Stone Age emotions, medieval institutions, and godlike technology.\" The digital age, marked by <b style='color: forestgreen;'>ubiquitous connectivity</b>, arises from advances such as <b style='color: forestgreen;'>5G</b> and will fundamentally alter globalization.\n\nThe rapid uptake of digital techs is historically unprecedented, arising from foundational work like Alan Turing's envisioning of universal <b style='color: forestgreen;'>computers in 1936.</b> John von Neumann's <b style='color: forestgreen;'>architecture</b> for modern computers laid the foundations in 1945, leading to technological advances such as the invention of the <b style='color: forestgreen;'>transistor in 1947.</b> This enabled the development of <b style='color: forestgreen;'>microprocessors</b> and eventually the <b style='color: forestgreen;'>Internet</b>, initially a military project, opened for public use in 1987. <b style='color: forestgreen;'>Moore's Law</b> foresaw rapid growth; from 2,300 transistors in 1971 to 8 billion in 2017, underpinning the development of technologies that shape today's connectivity and digital intelligence."
        },
        {
            "title": "Convergent Growth and China's Surge",
            "body": "<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Convergent Growth and China’s Surge to the Forefront</b></h3>\n\nThe latter part of the <b style='color: forestgreen;'>20th century</b> marked a shift from <b style='color: forestgreen;'>global economic divergence</b> towards <b style='color: forestgreen;'>global convergence</b>. Following <b style='color: forestgreen;'>World War II</b>, newly independent nations began to accelerate their growth, investing in <b style='color: forestgreen;'>public health, education,</b> and <b style='color: forestgreen;'>infrastructure</b>. Although some countries struggled with <b style='color: forestgreen;'>debt</b> and <b style='color: forestgreen;'>inflation</b>, many improved in these sectors, resulting in <b style='color: forestgreen;'>developing nations</b> increasing their <b style='color: forestgreen;'>GDP per capita</b> more swiftly than <b style='color: forestgreen;'>developed nations</b>. This faster growth, alongside higher <b style='color: forestgreen;'>population growth</b>, led to a rise in the share of <b style='color: forestgreen;'>global output</b> from developing countries, which grew from <b style='color: forestgreen;'>43%</b> in 2000 to <b style='color: forestgreen;'>59%</b> in 2018, according to the <b style='color: forestgreen;'>IMF</b>."
        },
        {
            "title": "UN Security Council Imbalance and Reform Proposal",
            "body": "The table from 2018 highlights the imbalance in global representation, as countries like India, Japan, Germany, Brazil, and Indonesia [are larger](Overlap of Large Countries) than some permanent UN Security Council members (P5). Despite containing <b style='color: forestgreen;'>60% of the world’s population</b>, Asia only holds three seats (20%) on the Council. The rotating seats are divided by regions: Asia (2), Latin America (2), Africa (3), Western Europe (2), Eastern Europe (1). This setup does not reflect the current global <b style='color: forestgreen;'>economic power</b>.[Proposed Reforms](Proposed Reforms)\n\nA reform proposal suggests expanding the Security Council to <b style='color: forestgreen;'>21 members</b>, adding new permanent members like Brazil, Germany, India, Indonesia, Japan, and Nigeria, <b style='color: forestgreen;'>increasing Asia’s presence</b>. However, the current P5 countries, holding veto power, resist changes that might diminish their influence. Reform is possible when these countries recognize a restructured UN <b style='color: forestgreen;'>benefits global and their own security</b>. \nThe UN needs to keep pace with shifting global balances toward Asia and Africa for effective governance."
        },
        {
            "title": "Zheng He and the UN's Role in Modern Times",
            "body": "<b style='color: forestgreen;'>Zheng He</b> was a notable Chinese navigator who led many voyages to the South China Sea, Indian Ocean, and beyond during the <b style='color: forestgreen;'>15th century</b>. His expeditions exemplified China's substantial <b style='color: forestgreen;'>navigational and maritime capabilities</b>. However, despite early advances, <b style='color: forestgreen;'>China's isolationist policy</b> under the <b style='color: forestgreen;'>Ming Dynasty</b> ultimately limited its naval expansion. The extended voyages of Zheng He represented a significant, albeit temporary, expansion in the scope of China's maritime influence.\n\nIn the modern era, the <b style='color: forestgreen;'>United Nations (U.N.)</b> emerged as a pivotal entity in promoting international cooperation. Established initially as an <b style='color: forestgreen;'>anti-fascist alliance</b> during <b style='color: forestgreen;'>World War II</b>, the U.N. focuses on <b style='color: forestgreen;'>sustainable development goals (SDGs)</b>, which highlight global priorities like <b style='color: forestgreen;'>eliminating poverty</b>, <b style='color: forestgreen;'>fighting inequality</b>, and <b style='color: forestgreen;'>tackling climate change</b>. The U.N.’s goals emphasize progression towards a globally <b style='color: forestgreen;'>sustainable future</b>, aligning with the sentiments of <b style='color: forestgreen;'>leaders and experts</b> who emphasize the importance of shared responsibilities in addressing collective challenges."
        }
    ]
}