{
    "meta": {
        "title": "The Great Reset: And the War for the World",
        "author": "Alex Jones",
        "category": "Non-Fiction",
        "publisher": "Skyhorse Publishing",
        "pages": 203
    },
    "parts": [
        {
            "title": "The Age-Old Battle: Freedom vs. Control",
            "body": "<b style='color: forestgreen;'>Chapter One: What Is the Great Reset?</b> delves into the timeless struggle between <b style='color: forestgreen;'>freedom</b> and <b style='color: forestgreen;'>authority</b> in human society. The story of <b style='color: forestgreen;'>Thaag</b> and <b style='color: forestgreen;'>Uther</b> highlights the power of <b style='color: forestgreen;'>collaboration</b> and <b style='color: forestgreen;'>flexibility</b> over rigid adherence to tradition in decision-making. This reflects a broader theme in the book about questioning <b style='color: forestgreen;'>authority</b> and the <b style='color: forestgreen;'>status quo</b>, urging individuals to consider their <b style='color: forestgreen;'>freedom</b> and <b style='color: forestgreen;'>choices</b> in the face of pervasive <b style='color: forestgreen;'>control</b> and <b style='color: forestgreen;'>tyranny</b>. The narrative foreshadows discussions on how societal and governmental shifts, like the <b style='color: forestgreen;'>Great Reset</b>, could redefine individual <b style='color: forestgreen;'>freedom</b>, pointing to key figures like <b style='color: forestgreen;'>Klaus Schwab</b> and movements that pose potential threats to <b style='color: forestgreen;'>autonomy</b> and <b style='color: forestgreen;'>democracy</b>."
        },
        {
            "title": "Schwab's Strategy Against Public Skepticism",
            "body": "Klaus <b style='color: forestgreen;'>Schwab</b> tries to spread his ideas about the <b style='color: forestgreen;'>Fourth Industrial Revolution</b> through his books. Initially, he thought Clinton's presidency would help, but after Trump's win, he published another book, hoping for a bigger <b style='color: forestgreen;'>impact</b>. Schwab seeks the help of influential tech leaders, like <b style='color: forestgreen;'>Satya Nadella</b>, to advocate these ideas. But the use of <b style='color: forestgreen;'>exaggerated</b> language and promises leaves doubts about the <b style='color: forestgreen;'>true intentions</b>. Technology should not <b style='color: forestgreen;'>intimidate</b> us into compliance. <b style='color: forestgreen;'>Genuine change</b> should come from our values and <b style='color: forestgreen;'>institutions</b>, not imposed by elite narratives."
        },
        {
            "title": "Technocracy's Rise and Challenges",
            "body": "The <b style='color: forestgreen;'>Technocracy movement</b> aims to use <b style='color: forestgreen;'>scientific principles</b> and <b style='color: forestgreen;'>engineers' expertise</b> to govern societies, promising <b style='color: forestgreen;'>efficiency</b> and <b style='color: forestgreen;'>utopian solutions</b>. Its origins are linked to French philosopher <b style='color: forestgreen;'>Auguste Comte</b> and the rise of <b style='color: forestgreen;'>scientism</b>. During the <b style='color: forestgreen;'>Great Depression</b>, <b style='color: forestgreen;'>Technocrats</b> offered their vision as an alternative to failing <b style='color: forestgreen;'>capitalism</b>, proposing a society managed by <b style='color: forestgreen;'>technological experts</b>. Although <b style='color: forestgreen;'>Franklin Roosevelt</b> adopted some ideas during his presidency, such as lifting the <b style='color: forestgreen;'>gold standard</b>, the American public continued to reject full Technocratic governance due to its <b style='color: forestgreen;'>threats</b> to <b style='color: forestgreen;'>democracy</b> and <b style='color: forestgreen;'>individual rights</b>. However, some Technocrats were embedded within American industry post-World War II through <b style='color: forestgreen;'>Operation Paperclip</b>."
        },
        {
            "title": "Brzezinski's Technocracy & Globalists' Power Ambitions",
            "body": "<b style='color: forestgreen;'>David Rockefeller</b> believed in \"constructive engagement,\" using networks for \"reliable information and influence.\" <b style='color: forestgreen;'>Brzezinski</b>, a Columbia professor, saw societal unity with <b style='color: forestgreen;'>tech advancements</b>, but fragmentations too. His revelation: America faced a <b style='color: forestgreen;'>Third Revolution</b>, post-WWII, with new education, science, and technology, hinting a <b style='color: forestgreen;'>needed new political system</b>. While linking <b style='color: forestgreen;'>higher learning</b> to societal shifts, he <b style='color: forestgreen;'>dismissed</b> factory workers and rural areas. He advocated for an elite-driven society, focusing on <b style='color: forestgreen;'>technocrats and planners</b> over traditional values. Connecting Brzezinski to <b style='color: forestgreen;'>globalist ideals</b>, Barry Goldwater raised concerns, suggesting a <b style='color: forestgreen;'>centralized power grab</b> by the Trilateral Commission, affecting political and economic freedoms. Goldwater criticized the Trilateral's economic focus, fearing <b style='color: forestgreen;'>freedom and free press</b> compromises. The battle was over the <b style='color: forestgreen;'>control of our future</b> under the promise of tech-driven advances."
        },
        {
            "title": "Praising China and Promoting Globalist Agendas",
            "body": "Klaus Schwab praises <b style='color: forestgreen;'>China's</b> response to the COVID-19 crisis, ignoring <b style='color: forestgreen;'>scientific dissidents</b> and <b style='color: forestgreen;'>drugs</b> like hydroxychloroquine and <b style='color: forestgreen;'>ivermectin</b>. Schwab views the pandemic as an opportunity to push <b style='color: forestgreen;'>globalist</b> agendas, similar to historical <b style='color: forestgreen;'>government overreach</b> seen in <b style='color: forestgreen;'>fascist</b> and <b style='color: forestgreen;'>communist</b> regimes. He highlights the <b style='color: forestgreen;'>importance</b> of using crises for <b style='color: forestgreen;'>climate</b> actions and other globalist goals, despite the risk of losing <b style='color: forestgreen;'>individual rights</b>.\n\nSchwab introduces <b style='color: forestgreen;'>stakeholder capitalism</b>, aiming for <b style='color: forestgreen;'>government</b> and <b style='color: forestgreen;'>business</b> cooperation, <b style='color: forestgreen;'>reducing</b> individual freedom under guise of progress. Globalists like Schwab use <b style='color: forestgreen;'>fear and chaos</b> to promote <b style='color: forestgreen;'>authoritarian</b> agendas, ignoring <b style='color: forestgreen;'>ethical debate</b> by <b style='color: forestgreen;'>focusing</b> on authoritative control. There's a <b style='color: forestgreen;'>risk</b> of turning <b style='color: forestgreen;'>surveillance</b> tools into a dystopian form of control, as globalists disregard <b style='color: forestgreen;'>human rights</b> and prioritize <b style='color: forestgreen;'>power</b> and <b style='color: forestgreen;'>control</b>."
        },
        {
            "title": "The Rise of Technology and Its Impact on Human Freedom",
            "body": "In this section, <b style='color: forestgreen;'>Harari emphasizes</b> that humanity has long been shaped by economic, religious, and political forces but warns that violence and <b style='color: forestgreen;'>oppression are sometimes used</b> to establish dominance. He highlights historical escalations into brutality and calls for caution against <b style='color: forestgreen;'>abandoning personal freedom</b>. Harari suggests that <b style='color: forestgreen;'>empires</b> have often used force to maintain control but shies away from discussing the repercussions of such domination on <b style='color: forestgreen;'>cultural identities</b>.\n\nHarari then moves into contemporary threats, such as <b style='color: forestgreen;'>genetic engineering</b> and <b style='color: forestgreen;'>AI</b>, that could alter humans' bodies and minds, projecting a future where human evolution could deviate significantly. However, this vision is critiqued as one that relies too heavily on <b style='color: forestgreen;'>technological supremacy</b> and undermines individual <b style='color: forestgreen;'>free will</b>. Harari's discussion hints at a <b style='color: forestgreen;'>new world order</b>, where <b style='color: forestgreen;'>machine superiority</b> might redefine existence, suggesting that a <b style='color: forestgreen;'>drastic shift</b> in human roles is imminent."
        },
        {
            "title": "Globalist Agendas & Digital Control Systems",
            "body": "<b style='color: forestgreen;'>Globalists</b>, led by figures like Klaus Schwab, aim to control <b style='color: forestgreen;'>technology</b> and <b style='color: forestgreen;'>financial systems</b>, as seen in the <b style='color: forestgreen;'>Canadian Truckers' protest</b> and <b style='color: forestgreen;'>digital currencies</b> centralization. The <b style='color: forestgreen;'>Canadian government</b>, led by Justin Trudeau, demonstrated unprecedented power by freezing protestors' finances without <b style='color: forestgreen;'>due process</b>, an action aligning with <b style='color: forestgreen;'>globalist</b> philosophies. Similar digital controls were observed with <b style='color: forestgreen;'>Russian citizens</b> during sanctions, who faced troubles accessing <b style='color: forestgreen;'>financial systems</b> due to <b style='color: forestgreen;'>Apple Pay</b> and <b style='color: forestgreen;'>Google Pay</b> blockades. These examples illustrate the potential for a <b style='color: forestgreen;'>“digital gulag”</b>—a society where <b style='color: forestgreen;'>freedom</b> is curtailed through digital means.\n\nThe concept of a <b style='color: forestgreen;'>Central Bank Digital Currency (CBDC)</b> highlights technological advancements being leveraged for power consolidation. Initiatives already tested in countries like <b style='color: forestgreen;'>China</b> demonstrate <b style='color: forestgreen;'>CBDCs</b> as tools for <b style='color: forestgreen;'>control</b>, not just financial stability. This vision, fulfilled through comprehensive <b style='color: forestgreen;'>digital tracking systems</b>, ties into a broader <b style='color: forestgreen;'>social credit score</b> model, where citizens are ranked and penalized based on behavior adhering to <b style='color: forestgreen;'>state-defined norms</b>. This could lead to severe <b style='color: forestgreen;'>restrictions</b> or <b style='color: forestgreen;'>freedom loss</b> akin to <b style='color: forestgreen;'>authoritarian measures</b> without physical constraints."
        },
        {
            "title": "Green Energy Transition Crisis",
            "body": "<b style='color: forestgreen;'>The global elite are trying to control the world's energy</b> by phasing out fossil fuels without a stable green energy alternative. This <b style='color: forestgreen;'>leads to soaring prices, energy crises, and a weakened middle class</b>. Their plan appears to be a <b style='color: forestgreen;'>strategy for the Great Reset</b>, aiming to collapse the old systems and implement new ones, despite the impending energy shortages and high costs associated with switching to green energy.\n\n<b style='color: forestgreen;'>Experts like Elon Musk and Mark Mills</b> question the current feasibility of green energy, citing production and storage limitations. Mills particularly highlights <b style='color: forestgreen;'>how far away we are from a reliable green energy supply</b>, given the <b style='color: forestgreen;'>significant cost and massive infrastructure needed for batteries</b>. This suggests that the global switch to green energy is costly and perhaps being rushed inappropriately, with <b style='color: forestgreen;'>fossil fuels having unmatched cost-effectiveness and efficiency</b>."
        },
        {
            "title": "Propaganda for Controlled Diets and Food Supply Control",
            "body": "<b style='color: forestgreen;'>Fifth Crazy Thing:</b> <em style='color: forestgreen;'>Propaganda for a Controlled Diet</em>. The globalists seek to limit <b style='color: forestgreen;'>meat consumption</b> drastically and promote a <b style='color: forestgreen;'>plant-based</b> diet under the guise of saving the world. They have even proposed extreme reductions, like getting a single mouthful of <b style='color: forestgreen;'>red meat</b> per day, claiming that moving towards a 'planetary health diet' is necessary for the planet's future. Furthermore, studies have shown meat consumption improves <b style='color: forestgreen;'>intelligence</b> and abilities in children, something that limits of a <b style='color: forestgreen;'>plant-based</b> diet might hinder. As mentioned, <b style='color: forestgreen;'>Bill Gates</b> is heavily investing in <b style='color: forestgreen;'>farmland</b> and promoting synthetic meat to align with these ideals.\n\n<b style='color: forestgreen;'>Sixth Crazy Thing:</b> <em style='color: forestgreen;'>Conspiracy of Synthetic and Bug Diets</em>. Bill Gates' ownership of <b style='color: forestgreen;'>242,000 acres</b> of U.S. farmland is just one aspect of the control over global food supply. The goal isn't only to replace meat with synthetic options but also to see options like microbial and <b style='color: forestgreen;'>bug-based foods</b> promoted as viable alternatives to meat. <b style='color: forestgreen;'>Nature’s Fynd</b> is investing in volcanic microbes to create alternative products, reflecting this shift away from traditional <b style='color: forestgreen;'>meat</b>. These ideas go hand-in-hand with the Great Reset narrative and supposedly saving the planet, all the while controlling more of the global <b style='color: forestgreen;'>food supply</b>."
        },
        {
            "title": "Globalists' Plans: Free Speech & Tech Implants",
            "body": "<b style='color: forestgreen;'>Globalists</b> aim to <b style='color: forestgreen;'>curb free speech</b> through the \"recalibration\" of human rights, a term used by officials like Australia's eSafety Commissioner Julie Inman Grant. <b style='color: forestgreen;'>Freedom of speech</b> is viewed as <b style='color: forestgreen;'>binary</b> – you have it, or you don't. <b style='color: forestgreen;'>Globalists</b> want to redefine this concept, worrying those who cherish <b style='color: forestgreen;'>freedom.</b>\n\n<b style='color: forestgreen;'>WEF plans</b> to <b style='color: forestgreen;'>implant chips</b> in clothes, an idea introduced in a 2022 video. These chips would act as <b style='color: forestgreen;'>digital passports</b> and <b style='color: forestgreen;'>track individuals.</b> By 2030, they even foresee <b style='color: forestgreen;'>implanting smartphones in bodies,</b> aligning with their <b style='color: forestgreen;'>transhumanist vision</b> for a <b style='color: forestgreen;'>sexless, childless society.</b> The message: <b style='color: forestgreen;'>control and conform</b> for a futuristic \"utopia.\""
        }
    ]
}