{
    "meta": {
        "title": "The Coaching Habit: Say Less, Ask More & Change the Way You Lead Forever",
        "author": "Michael Bungay Stanier",
        "publisher": "Box of Crayons Press",
        "pages": 159
    },
    "parts": [
        {
            "title": "Importance and Underutilization of Coaching",
            "body": "In a fast-paced world, leaders <b style='color: forestgreen;'>need coaching</b> skills, crucial for enhancing <b style='color: forestgreen;'>performance</b> and <b style='color: forestgreen;'>workplace culture</b>. Yet, research shows many managers find coaching <b style='color: forestgreen;'>time-consuming</b> and fail to implement it effectively. Despite many having some coaching training, only <b style='color: forestgreen;'>23%</b> felt it significantly improved their performance. Coaching remains underutilized because managers see it as <b style='color: forestgreen;'>slow work</b> amidst hectic schedules."
        },
        {
            "title": "Coaching Benefits and Habit Building",
            "body": "<b style='color: forestgreen;'>The Essence of Coaching</b>\n\nCoaching can <b style='color: forestgreen;'>help</b> you work <b style='color: forestgreen;'>less</b> hard while having more <b style='color: forestgreen;'>impact</b> by breaking the cycles of <b style='color: forestgreen;'>overdependence, being overwhelmed,</b> and <b style='color: forestgreen;'>disconnection</b>. These cycles keep you and your team stuck, and <b style='color: forestgreen;'>coaching</b> can empower people, enabling them to work <b style='color: forestgreen;'>more independently</b>. Enabling your team to be more <b style='color: forestgreen;'>self-sufficient</b> not only increases their <b style='color: forestgreen;'>autonomy</b> and <b style='color: forestgreen;'>responsibility</b> but also ensures you spend <b style='color: forestgreen;'>less time</b> solving their problems.\n\n<b style='color: forestgreen;'>The Simple Coaching Approach</b>\n\nBox of Crayons emphasizes <b style='color: forestgreen;'>simple</b> coaching methods that require <b style='color: forestgreen;'>ten minutes</b> or less. This involves asking the right questions daily instead of just sharing advice. The <b style='color: forestgreen;'>Seven Essential Questions</b> focus conversations, reduce the need to offer excessive guidance, and help <b style='color: forestgreen;'>maintain</b> team <b style='color: forestgreen;'>momentum</b>. Shifting the workplace culture with these fundamental questions can transform how you engage in <b style='color: forestgreen;'>daily interactions</b>, achieving greater autonomy and effectiveness with your team.\n\n<b style='color: forestgreen;'>Building Better Habits</b>\n\nChanging behavior is <b style='color: forestgreen;'>hard</b> due to habitual actions largely influenced by the <b style='color: forestgreen;'>subconscious</b>. Building effective habits requires identifying <b style='color: forestgreen;'>triggers</b>, defining <b style='color: forestgreen;'>new behaviors</b> that take less than a minute, and practicing them <b style='color: forestgreen;'>deeply</b>. The book offers the New Habit Formula as a guide to creating specific action steps, like asking instead of telling, to encourage curiosity and diminish over-reliance on management."
        },
        {
            "title": "Building an Effective Coaching Habit",
            "body": "<b style='color: forestgreen;'>Coaching</b> isn't complex, though your first try might've failed because training was too theoretical or boring. <b style='color: forestgreen;'>Three reasons for struggles</b>: courses lack connection to your real work, you don't learn how to apply insights, and changing from advice-giving to questioning is hard due to ingrained habits. However, at <b style='color: forestgreen;'>Box of Crayons</b>, effective coaching can happen with <b style='color: forestgreen;'>simple questions</b> in under <b style='color: forestgreen;'>ten minutes</b>. Building a <b style='color: forestgreen;'>coaching habit</b> involves consistent, everyday small acts rather than formal sessions.\n\nCoaching <b style='color: forestgreen;'>helps you</b> work less hard, break workplace <b style='color: forestgreen;'>vicious circles</b> (overdependence, feeling overwhelmed, disconnect), and enhances team autonomy. In an overdependent team, everyone feels frustrated and work gets bottlenecked; coaching increases autonomy, reducing the need for constant help. If overwhelmed by tasks, coaching enables you to focus on impactful work rather than being spread thin. Moreover, coaching <b style='color: forestgreen;'>connects</b> you to meaningful work, increasing engagement and motivation.\n\nOur habits drive 45% of our actions; shifting habits requires knowing triggers and implementing micro-habits. Change includes a <b style='color: forestgreen;'>reason, trigger, a specific micro-habit, deep practice, and a recovery plan</b>. Making a vow dedicated to others rather than personal gain can be more motivating. Define the habit's trigger, identify the old, and establish the new behavior. The <b style='color: forestgreen;'>New Habit Formula</b> simplifies this into an actionable, understandable change process. Building habits requires <b style='color: forestgreen;'>courage, resilience</b>, and starting with the simplest, impactful steps."
        },
        {
            "title": "Shaping Habits & Asking Effective Questions",
            "body": "<h3 style='color: forestgreen;'>Shaping Habits: Insights and Strategies</h3>\n\n<b style='color: forestgreen;'>Ovid</b> wisely noted that nothing is more powerful than <b style='color: forestgreen;'>habit</b>. Habits can create a life filled with <b style='color: forestgreen;'>undesirable</b> responses, but understanding how they work allows you to craft successful routines. By shaping your habits intentionally, you can influence your <b style='color: forestgreen;'>behavior and life</b> in positive ways. Begin by focusing on one <b style='color: forestgreen;'>habit at a time</b>, and use support systems like apps or buddies to <b style='color: forestgreen;'>reinforce good behaviors</b>.\n\n<h3 style='color: forestgreen;'>Importance of Asking Questions</h3>\n\nAsking <b style='color: forestgreen;'>effective questions</b> can make conversations more meaningful. Avoid \"<b style='color: forestgreen;'>drive-by questioning</b>,\" which can overwhelm and confuse, turning a supportive talk into an <b style='color: forestgreen;'>interrogation</b>. When engaging in conversations, remember to ask <b style='color: forestgreen;'>one question at a time</b> to keep the <b style='color: forestgreen;'>focus</b> on understanding and truly listening. Try asking \"What's on your mind?\" to guide discussions toward what truly matters to the person you're speaking with.\n\n<h3 style='color: forestgreen;'>The Power of Habits and Questions</h3>\n\nHabits are like <b style='color: forestgreen;'>buildings</b> shaping us after we've shaped them. By fostering <b style='color: forestgreen;'>rock-solid habits</b>, such as asking impactful questions, you foster deeper <b style='color: forestgreen;'>connections</b> and address both performance and development in coaching. The <b style='color: forestgreen;'>3P model</b> helps decide the focus of coaching - either on projects, <b style='color: forestgreen;'>people</b>, or patterns, and helps guide the conversation towards more meaningful development rather than just fixing immediate issues."
        },
        {
            "title": "Clarifying Thoughts for Better Choices",
            "body": "When we have something on our <b style='color: forestgreen;'>mind</b>, it can affect our <b style='color: forestgreen;'>choices</b> and <b style='color: forestgreen;'>perspective</b>, maybe limiting our <b style='color: forestgreen;'>optimal decisions</b>. The <b style='color: forestgreen;'>Kickstart Question</b> helps by releasing the <b style='color: forestgreen;'>pressure</b> and clarifying what's subtly influencing our <b style='color: forestgreen;'>thoughts</b>. This <b style='color: forestgreen;'>question</b> assists in shifting a possibly narrow <b style='color: forestgreen;'>view</b> to a broader <b style='color: forestgreen;'>perspective</b>.\n\nThe <b style='color: forestgreen;'>Kickstart Question</b> functions like a small <b style='color: forestgreen;'>pressure-release valve</b>, putting potential <b style='color: forestgreen;'>biases</b> and <b style='color: forestgreen;'>influences</b> out in the open. Our <b style='color: forestgreen;'>thoughts</b> can narrow how we <b style='color: forestgreen;'>approach</b> <b style='color: forestgreen;'>situations</b>, but by <b style='color: forestgreen;'>identifying</b> them we can prevent them from dominant <b style='color: forestgreen;'>decisions</b>. This process can foster <b style='color: forestgreen;'>clarity</b> and improve <b style='color: forestgreen;'>decision</b> making.\n\nThe act of <b style='color: forestgreen;'>naming</b> these unformed thoughts can break free the <b style='color: forestgreen;'>challenge</b> from <b style='color: forestgreen;'>fuzziness</b>. Once released, it's easier to manage, leading to less restrictive <b style='color: forestgreen;'>thinking</b> and more <b style='color: forestgreen;'>effective</b> problem-solving. By making <b style='color: forestgreen;'>implicit</b> influences <b style='color: forestgreen;'>explicit</b>, we enhance our ability to make <b style='color: forestgreen;'>well-rounded</b> choices."
        },
        {
            "title": "Unlocking Insights Through Reconsideration and Follow-Up Questions",
            "body": "<b style='color: forestgreen;'>Studies</b> show that allowing students to <b style='color: forestgreen;'>reconsider</b> answers leads to <b style='color: forestgreen;'>better performance</b>. When given a chance to think again, they often correct their mistakes, showing the importance of <b style='color: forestgreen;'>reflection</b> for <b style='color: forestgreen;'>accuracy</b>. Recent findings emphasize <b style='color: forestgreen;'>higher-level thinking</b> questions, such as asking \"What else?\" to <b style='color: forestgreen;'>deepen understanding</b> and <b style='color: forestgreen;'>encourage participation</b>.\n\n<b style='color: forestgreen;'>Psychological experiment</b> with three-year-olds demonstrated that, even when tempted to <b style='color: forestgreen;'>lie</b>, children often reveal the truth when asked follow-up questions. This study suggests that, like children, adults may have more <b style='color: forestgreen;'>hidden insights</b> that can be revealed through probing with the AWE Question.\n\nThis highlights the importance of commitment to an answer and <b style='color: forestgreen;'>asking follow-up questions</b> which are crucial to <b style='color: forestgreen;'>unlocking deeper truths</b> and <b style='color: forestgreen;'>experiences</b>. The <b style='color: forestgreen;'>AWE Question</b> effectively helps uncover these hidden insights, promoting a more comprehensive understanding through targeted inquiry."
        },
        {
            "title": "Identifying Core Challenges and Understanding Wants vs. Needs",
            "body": "<b style='color: forestgreen;'>Understanding true challenges can empower </b>teams and <b style='color: forestgreen;'>individuals</b>. Instead of quickly jumping to solutions, focus on the <b style='color: forestgreen;'>real challenge</b> by asking probing questions like, \"What's the real challenge here for you?\" and repeating, \"And what else?\" Doing so surfaces the underlying challenges that often go unnoticed when immediate solutions are sought. This is crucial when everyone immediately starts offering solutions in discussions and overlooking the defining problem.\n\nTypical <b style='color: forestgreen;'>old habits</b> include quickly assuming the first identified challenge is the primary one and racing towards action without truly understanding the core issue. These tendencies lead to addressing challenges at a superficial level or conflating multiple smaller issues as equally pressing. Instead, the proposed new habit emphasizes regular use of the <b style='color: forestgreen;'>Focus Question</b> to help isolate the most significant challenges by repeatedly asking and delving into what else might be a concern.\n\nThe content also introduces <b style='color: forestgreen;'>The Foundation Question:</b> \"What do you want?\" This question, combined with understanding underlying needs, helps in identifying authentic requests and desires. Often, people misinterpret wants for needs, obscuring genuine desires and outcomes they seek. The discussion emphasizes the need for clarity and honesty in communication to bridge gaps in understanding and decision-making, both within oneself and in interactions with others."
        },
        {
            "title": "Understanding Brain Responses to Safety and Risk",
            "body": "<b style='color: forestgreen;'>Your brain</b> evaluates <b style='color: forestgreen;'>safety</b> in new environments, impacting your <b style='color: forestgreen;'>thinking and engagement</b>. A sense of <b style='color: forestgreen;'>safety</b> fosters a mindset open to ambiguity and positive interactions, while fear triggers a <b style='color: forestgreen;'>fight-or-flight</b> response. <b style='color: forestgreen;'>Evolution's bias</b> towards perceiving danger means we default to caution when unsure, leading to <b style='color: forestgreen;'>retreat</b> rather than engagement."
        },
        {
            "title": "Avoid Unnecessary Rescues: Setting Boundaries and Empowering Others",
            "body": "<b style='color: forestgreen;'>Avoid Unnecessary Helping</b> \nThis section emphasizes the importance of not jumping into helping others just because they ask or because you feel obligated. Often, people may just want to vent or figure things out themselves. They suggest asking, <b style='color: forestgreen;'>\"How can I help?\"</b> to get clarity on how you can truly be of assistance. If unsure about how your offer will be received, soften it with phrases like, <b style='color: forestgreen;'>\"Out of curiosity\"</b> or <b style='color: forestgreen;'>\"Just so I know…\"</b>.\n\n<b style='color: forestgreen;'>Decision Anxiety and Options</b> \nMany worry about the daunting tasks that might follow asking, <b style='color: forestgreen;'>\"How can I help?\"</b> However, the text suggests you have a range of responses; rather than always saying <b style='color: forestgreen;'>\"Yes,\"</b> you can say <b style='color: forestgreen;'>\"No\"</b>, or <b style='color: forestgreen;'>\"I can't do that, but I could\"</b> offer something else. This encourages setting boundaries to prevent overcommitment and stress.\n\n<b style='color: forestgreen;'>Encouraging Self-Solution</b> \nWhen someone asks for advice, resist the urge to spoon-feed them answers. Instead, turn the question back to them by asking what solutions they think might work. This fosters their independence and problem-solving skills, allowing you to contribute only after they’ve explored their own options. This approach helps avoid the \"rescuer\" role, which can be draining."
        },
        {
            "title": "Promoting Effective Conversations and Learning",
            "body": "<b style='color: forestgreen;'>Call and Response Techniques</b>: When engaging in conversations, especially after asking insightful questions, it's essential to acknowledge the person’s answers to encourage and confirm they are heard. <b style='color: forestgreen;'>Acknowledging the response</b> could be as simple as saying, \"That's good,\" which can validate them and make them feel valued. This creates a space where learning and exchanging new ideas can flourish, enhancing the conversation's effectiveness.\n\n<b style='color: forestgreen;'>Double-Loop Learning</b>: This concept involves making sure learning goes <b style='color: forestgreen;'>beyond just solving problems</b>; it focuses on understanding the issue at hand to extract meaningful lessons. Questions like \"What was most useful for you?\" promote reflection and help in embedding learning. They are instrumental for helping individuals process and retain new information by allowing them to generate answers themselves, creating new neural pathways.\n\n<b style='color: forestgreen;'>Effective Learning Techniques</b>: Strategies to <b style='color: forestgreen;'>improve knowledge retention</b> include reflecting on learned concepts, which can be bolstered by asking \"What have you learned since our last conversation?\" This question encourages continual reflection and retrieval of information. Neuroscience suggests that recalling and reflecting on learned ideas solidifies memory and understanding, thus preventing the process of forgetting."
        },
        {
            "title": "Enhancing Online and Managerial Communication Skills",
            "body": "<h3 style='color: forestgreen;'>Changing Communication Habits Online</h3>\n\nWe've become accustomed to handling communication <b style='color: forestgreen;'>via screens</b>—emails, texts, and social media messages are a big part of our life. <b style='color: forestgreen;'>Changing our communication approach</b> to be more effective involves giving less advice and more curiosity-focused questions. When you receive a <b style='color: forestgreen;'>long-winded email</b>, instead of <b style='color: forestgreen;'>jumping in with advice</b>, deploy one of the <b style='color: forestgreen;'>Seven Essential Questions</b> to help the person think through solving their issue. This approach can save time and make your interactions more useful.\n\n<h3 style='color: forestgreen;'>Challenges of Managing Advice</h3>\n\nManagers often feel pressured to provide detailed advice. The book suggests that when the <b style='color: forestgreen;'>\"Advice Monster\"</b> is triggered—especially via email—it's better to use one of the targeted questions that can guide the conversation more productively. Examples include asking, \"What’s the real challenge here for you?\" This reduces your workload and helps others <b style='color: forestgreen;'>develop their problem-solving skills</b>. It's a <b style='color: forestgreen;'>habit change</b> that makes your input more impactful and less draining.\n\n<h3 style='color: forestgreen;'>Building a Habit of Curiosity</h3>\n\nTo make a lasting change in how you interact and assist others, the book advocates focusing on curiosity rather than advice. You should find or even create your own effective questions that align with your voice while embracing a coaching mentality in everyday interactions. This can enhance your <b style='color: forestgreen;'>management skills</b>, professional growth, and personal relationships, leading to more <b style='color: forestgreen;'>meaningful and productive conversations</b>. Choose curiosity to lead to less effort and <b style='color: forestgreen;'>greater impact.</b>"
        }
    ]
}