{
    "meta": {
        "title": "The Cognition of Basic Musical Structures",
        "author": "David Temperley",
        "category": "Music Theory, Cognitive Science",
        "publisher": "The MIT Press",
        "pages": 422
    },
    "parts": [
        {
            "title": "Understanding Musical Structures",
            "body": "This <b style='color: forestgreen;'>book</b> explores how we process <b style='color: forestgreen;'>musical structures</b> like <b style='color: forestgreen;'>meter</b>, <b style='color: forestgreen;'>harmony</b>, and <b style='color: forestgreen;'>key</b> during listening. It aims to unravel the <b style='color: forestgreen;'>methods</b> through which these elements are <b style='color: forestgreen;'>identified</b> in music cognition, suggesting <b style='color: forestgreen;'>computational models</b> as potential explanations. Using a <b style='color: forestgreen;'>preference rule</b> system, it evaluates musical components, providing insights into broader musical experiences such as <b style='color: forestgreen;'>tension</b> and <b style='color: forestgreen;'>expectation</b>. Despite its focus on <b style='color: forestgreen;'>Western classical music</b>, the model may extend to various musical genres, offering a framework for understanding <b style='color: forestgreen;'>musical perception</b> and <b style='color: forestgreen;'>creative processes</b> like composition."
        },
        {
            "title": "Music Cognition and Methodologies",
            "body": "Music theory addresses musical ends, focusing on structures like <b style='color: forestgreen;'>topics</b> or <b style='color: forestgreen;'>melodic archetypes</b> which require specific configurations, such as <b style='color: forestgreen;'>contrapuntal</b>, <b style='color: forestgreen;'>metrical</b>, and <b style='color: forestgreen;'>harmonic</b> structures. The study of <b style='color: forestgreen;'>music cognition</b> is part of <b style='color: forestgreen;'>cognitive science</b>, which connects areas like <b style='color: forestgreen;'>psychology</b>, <b style='color: forestgreen;'>linguistics</b>, and <b style='color: forestgreen;'>neuroscience</b>, each contributing a unique methodological approach. In cognitive psychology, experimentation is predominant: <b style='color: forestgreen;'>human subjects</b> receive stimuli and perform tasks to infer psychological processes. Contrarily, theoretical linguistics often uses an <b style='color: forestgreen;'>introspectionist methodology</b>, where one's internal judgments about syntactic structures help construct grammars, revealing language understanding. This approach is reflected in music cognition studies by theorists like <b style='color: forestgreen;'>Lerdahl and Jackendoff</b>. Such methods underscore the diversity in understanding how we perceive and structure music psychologically."
        },
        {
            "title": "Rhythm Perception and Metrical Structures",
            "body": "In music <b style='color: forestgreen;'>quantization</b>, the challenge lies in representing durations as integer beats. <b style='color: forestgreen;'>Groups of beats form metrical structures</b>, which can imply different rhythms depending on note durations. For instance, two beats of the same length can be interpreted differently, affecting perceived meter. This concept underscores that <b style='color: forestgreen;'>perceiving rhythm is categorical</b>, as listeners use metrical strategies to interpret rhythms.\n\nMusic notation provides clues to <b style='color: forestgreen;'>metrical structure</b> through time signatures (e.g., 3/4 meter) aligned with beats. However, while meter forms a key part of music cognition, there's <b style='color: forestgreen;'>debate on how meter is heard</b>. Music theorists suggest that most listeners share similar metrical intuitions, often reflecting music notation, though evidence for this assumes common understanding of musical signs and time structures."
        },
        {
            "title": "Understanding Musical Grouping and Phrase Structure",
            "body": "<b style='color: forestgreen;'>Grouping in music</b> involves dividing pieces into sections at different levels. Typically, grouping follows principles of <b style='color: forestgreen;'>similarity</b> and <b style='color: forestgreen;'>proximity</b>. These ideas stem from the <b style='color: forestgreen;'>Gestalt school</b> in the 1920s, focusing on perception both visually and auditorily. Similarity groups things that are alike, while proximity groups things close together. Psychological studies on musical grouping find it more challenging to determine \"correct\" analysis compared to meter, due to music's ambiguity. In <b style='color: forestgreen;'>metronomic studies</b>, listener's perception on <b style='color: forestgreen;'>phrase boundaries</b>—natural divisions within music—can be influenced by factors like pauses, stress, and changes in <b style='color: forestgreen;'>timing</b> and <b style='color: forestgreen;'>tonality</b>.\n\nYet, many principles of musical grouping are <b style='color: forestgreen;'>ambiguous</b>, like in <b style='color: forestgreen;'>polyphonic music</b>, where different lines have their own grouping patterns. <b style='color: forestgreen;'>Phrase structure</b> in simpler contexts like folk music is clearer because of its <b style='color: forestgreen;'>monophonic</b> nature, aiding the study of grouping. Folk melodies provide an initial study ground, as their quantized versions often provide a good reflection of true phrasing despite missing <b style='color: forestgreen;'>performative nuances</b> such as <b style='color: forestgreen;'>harmony</b> or <b style='color: forestgreen;'>tempo fluctuations</b>. Models use cues from notes—like gaps or longer note durations—to infer grouping in quantized representations, illustrating that core <b style='color: forestgreen;'>phrase structure</b> can be deduced from such information, even if some markers from real performances are absent."
        },
        {
            "title": "Understanding Contrapuntal Structure and Sequential Integration",
            "body": "<b style='color: forestgreen;'>Contrapuntal Structure</b> \n\nIn music, <b style='color: forestgreen;'>counterpoint</b> is the simultaneous combination of multiple melodic lines into streams or voices, often highlighted by different instrumental timbres. The challenge lies in <b style='color: forestgreen;'>identifying these lines</b>, which may not always be distinctly separated, as they can start and stop, overlap, or merge at times. This process, termed <b style='color: forestgreen;'>contrapuntal analysis</b>, is key in understanding complex compositions like Mozart’s Sonata K. 332. In contrapuntal music, a voice is bounded by time and pitch rather than being continuous throughout a piece. Unlike polyphonic pieces, where distinct voices or lines are easily recognizable, contrapuntal compositions require listeners to perceive separate melodic lines from a stream of sound. \n\n<b style='color: forestgreen;'>Sequential Integration in Auditory Psychology</b>\n\nPitch proximity is a crucial element of <b style='color: forestgreen;'>sequential integration</b>, the process involved in <b style='color: forestgreen;'>stream segregation</b>—analyzing and segmenting sound input into coherent units. When there is a <b style='color: forestgreen;'>pitch proximity</b>, notes are easier to group into a single line and recognize. Experiments, such as Dowling's interleaved melodies, have shown that melodies are perceived more clearly when they do not overlap in register. <b style='color: forestgreen;'>Tempo</b> also impacts grouping—faster alternations separate streams at smaller intervals. Deutsch's \"<b style='color: forestgreen;'>scale illusion</b>\" experiment demonstrated a preference to avoid crossing lines, indicating a perceptual leaning toward linear progression. While factors like timbre and spatial location may influence grouping under certain conditions, <b style='color: forestgreen;'>pitch typically overrides</b> these elements in auditory processing."
        },
        {
            "title": "Contrapuntal Analysis Models & Methodologies",
            "body": "<h3 style='color: forestgreen;'>Computational Models & Contrapuntal Analysis</h3>\n\nIn computational models analyzing contrapuntal music, understanding how separate streams or voices are perceived is crucial. <b style='color: forestgreen;'>Huron's model</b> explores \"<b style='color: forestgreen;'>pseudo-polyphony</b>,\" where rapid large leaps in music can mimic multiple melodies from a single line. <b style='color: forestgreen;'>Gjerdingen's approach</b> treats pitch-time as a plane, and overlaid \"hill\" activations make melodic connections explicit. A challenge for these models, like that of <b style='color: forestgreen;'>Marsden</b>, which assigns scores to possible connections between notes, is addressing limitations such as not allowing context to influence decisions, despite providing insights into perceptual phenomena.\n\nA <b style='color: forestgreen;'>contrapuntal analysis</b> uses mathematical models to assign pitches to different streams or voices based on pitch proximity and continuity. Such models need rules like stream integrity, disallowing simultaneous notes in one stream, and ensuring all notes belong to any stream. Based on a grid representation (e.g., for a piece by Mozart), streams can be visualized to identify anomalies, like absurd leaps or unchanged streams which these rules aim to correct, favoring logical continuity and minimizing \"rest\" segments."
        },
        {
            "title": "TPC Spelling Model and Rules",
            "body": "The section covers rules and models used for pitch spelling in music theory, starting with the importance of <b style='color: forestgreen;'>tonal-pitch-class labels</b>. The model proposed involves specific preference rules to determine how notes are labeled in tonal music, notably focusing on proximity on a theoretical <b style='color: forestgreen;'>\"line of fifths\"</b>. \n\nThe main <b style='color: forestgreen;'>Pitch Variance Rule</b> favors integrating notes so their positions on this line remain close. Addition of <b style='color: forestgreen;'>Voice-Leading Rule</b> addresses specific harmony and tonal choices, refining how transitions between notes are perceived. Lastly, a <b style='color: forestgreen;'>Harmonic Feedback Rule</b> prefers spelling choices that aid in forming coherent harmonies, showing an interplay between TPC analysis and harmonic structure."
        },
        {
            "title": "Evaluating Harmonic Analysis Implementation",
            "body": "The program's evaluation of harmonic <b style='color: forestgreen;'>analysis</b> is determined by various <b style='color: forestgreen;'>rules</b> assessing relationships between TPCs (tonal <b style='color: forestgreen;'>pitch-class</b> names), <b style='color: forestgreen;'>roots</b>, and <b style='color: forestgreen;'>metrical structure</b>. One significant rule [{HPR 1](HPR 1) favors roots leading to <b style='color: forestgreen;'>preferred</b> relationships. Analysis is done over <b style='color: forestgreen;'>metrical beats</b>, preventing changes of harmony where no <b style='color: forestgreen;'>beat exists</b>. Similar to <b style='color: forestgreen;'>Roman numeral analysis</b> in identifying roots, the algorithm does not include mode or inversion.\n\nA quantitative score is derived based on <b style='color: forestgreen;'>compatibility</b>, <b style='color: forestgreen;'>beat strength</b>, and <b style='color: forestgreen;'>dissonance</b> evaluations (HPR 4). Ongoing improvements, such as recognizing <b style='color: forestgreen;'>escape tones</b> or anticipations, are suggested. Although outputs were largely acceptable, some errors arose due to limitations in recognizing <b style='color: forestgreen;'>ornamental</b> dissonances. Meticulous <b style='color: forestgreen;'>implementation</b> combines prior <b style='color: forestgreen;'>TPC labeling</b> for robust harmonic understanding through <b style='color: forestgreen;'>programmed algorithms</b> emphasizing musical elements and cognitive understanding, revealing potential for future solutions in cases like <b style='color: forestgreen;'>metrically</b> strong dissonances."
        },
        {
            "title": "Metrical Strength & Harmonic Compatibility",
            "body": "The text discusses how to apply a dynamic programming approach to search for the best harmonic analysis of musical segments. To determine this, the <b style='color: forestgreen;'>compatibility rule</b>, <b style='color: forestgreen;'>ornamental dissonance rule</b>, and <b style='color: forestgreen;'>strong beat rule</b> are considered. The compatibility and dissonance penalties are calculated based on <b style='color: forestgreen;'>local</b> conditions, whereas the strong beat rule takes <b style='color: forestgreen;'>context</b> into account by comparing the current root with the previous one. The challenge is integrating the <b style='color: forestgreen;'>haronic variance rule</b>, which considers the <b style='color: forestgreen;'>center of gravity</b> (COG) of previous roots. For effective analyses, the model tracks the best \"<b style='color: forestgreen;'>so-far</b>\" solution for each root and COG, although this can become <b style='color: forestgreen;'>computationally intensive</b>.\n\nFurther analysis explores the interactions between two preference rule systems, using a score to evaluate how <b style='color: forestgreen;'>compatible</b> the pitch classes (TPC) of a segment are with the chosen root. Treating the systems as one, combining <b style='color: forestgreen;'>TPC-harmonic representation</b> allows segment evaluation. While incorporating harmony can lead to <b style='color: forestgreen;'>circular</b> decision-making processes, it's resolved by having interconnected internal rules and <b style='color: forestgreen;'>monitoring for interactions</b> during evaluation. This approach helps keep the final analysis <b style='color: forestgreen;'>consistent</b> and <b style='color: forestgreen;'>musically coherent</b>, despite the complexity of <b style='color: forestgreen;'>multiple interacting rules</b>."
        },
        {
            "title": "Exploring Key-Finding Models in Music",
            "body": "The text explores <b style='color: forestgreen;'>key-finding</b> in music through different algorithms. Improvements are seen in the <b style='color: forestgreen;'>Temperley</b> algorithm, reducing errors compared to the <b style='color: forestgreen;'>Krumhansl-Schmuckler (K-S) model</b>. However, it faces challenges with repeated pitches affecting key perception, like in <b style='color: forestgreen;'>measure 29</b> where the algorithm incorrectly leans towards A minor due to repeated <b style='color: forestgreen;'>C's</b>. <b style='color: forestgreen;'>Template-matching</b> approaches to key-finding can vary. The <b style='color: forestgreen;'>Longuet-Higgins/Steedman</b> method considers elimination based on pitch presence, often favoring keys like <b style='color: forestgreen;'>G major and minor</b>. The text suggests combining algorithms for a <b style='color: forestgreen;'>\"flat-input/weighted-key” model</b>, which uses <b style='color: forestgreen;'>simple input values</b> for present pitch-classes while weighting key profiles—a method shown to improve judgments for small pitch-sets and is tested on <b style='color: forestgreen;'>Bach's Courante</b>. An important note from <b style='color: forestgreen;'>Lerdahl’s theory</b> is included, showing similarities in pitch structure analysis, suggesting further research into <b style='color: forestgreen;'>\"rare intervals\"</b> that might aid key distinction."
        },
        {
            "title": "Dynamic Processing and Revision in Music Cognition",
            "body": "<b style='color: forestgreen;'>Musical Structure</b> has always been examined as a <b style='color: forestgreen;'>static, final analysis</b>. However, listening to music occurs <b style='color: forestgreen;'>over time and involves dynamic processes</b>. As music unfolds, listeners might <b style='color: forestgreen;'>revise</b> their initial interpretations based on further developments in the piece. This is seen in how structure like <b style='color: forestgreen;'>meter, harmony, and key</b> change our interpretations as more of the music is heard. \n\n<b style='color: forestgreen;'>Dynamic Programming</b> provides a technique to <b style='color: forestgreen;'>progressively build musical interpretations</b> from the beginning to the end of a piece. By <b style='color: forestgreen;'>continuously updating</b> the best analysis so far with every new segment, listeners can revise earlier parts of the analysis if later music provides more context. This capability ensures efficiency as it does not require us to hold multiple possible analyses simultaneously; instead, at any moment, there's a <b style='color: forestgreen;'>preferred analysis</b> which can be revised with new inputs. This kind of model captures the way in which <b style='color: forestgreen;'>streamlining analysis</b> over time often results in <b style='color: forestgreen;'>revisions</b> in our understanding of musical works."
        },
        {
            "title": "Musical Expectation and Analysis",
            "body": "<b style='color: forestgreen;'>Expectation</b> in music is about <b style='color: forestgreen;'>predicting future events</b> based on what has been heard. It makes <b style='color: forestgreen;'>surprises possible</b> in music, such as unexpected rhythms in Beethoven or harmonies in Chopin. Some theorists like Meyer and Narmour argue that managing these expectations is <b style='color: forestgreen;'>essential for musical enjoyment</b>. <b style='color: forestgreen;'>Preference rule systems</b> might help explain these expectations as they produce a <b style='color: forestgreen;'>score for analyses</b>; some satisfy the rules well and are high-scoring, while others violate them and are low-scoring. Most music allows for an <b style='color: forestgreen;'>analysis that is high-scoring</b>, so we expect future events to fit this pattern. For instance, new events should match the existing <b style='color: forestgreen;'>metrical structure</b> or key to maintain a high <b style='color: forestgreen;'>score without a penalty</b>, such as modulation in the key. Musical expectation is part of the <b style='color: forestgreen;'>composition process</b> since it involves predicting continuations that meet various <b style='color: forestgreen;'>constraints</b>. The topic is further explored in chapter 11, with rules seen as constraints on <b style='color: forestgreen;'>music production and perception</b>. Analysis involves a kind of expectation, and revising an analysis can cause <b style='color: forestgreen;'>surprise</b> when expectations are not met.\n\nSchmuckler conducted experiments with Schumann's compositions, testing subjects' expectations about possible continuations. <b style='color: forestgreen;'>Subjects rated</b> continuations based on how well they matched expectations. It was found that for melodies, pitches with <b style='color: forestgreen;'>high key-profile values were highly expected</b>, showing a tendency towards high-scoring analyses. For harmony, expectations were consistent with <b style='color: forestgreen;'>common harmonic progressions</b> found in Piston's harmony table. Out of twelve possible fifths motions, most were common, aligning with the <b style='color: forestgreen;'>harmonic variance rule</b> that prefers <b style='color: forestgreen;'>close root proximity</b> on the line of fifths. This suggests that listeners’ expectations conform to high-scoring models. Bharucha and Stoeckig also contributed, using <b style='color: forestgreen;'>priming</b> to test if expectations enhanced processing speed for expected targets in harmony. Targets close to an initial chord on the circle of fifths were judged quicker, fitting the harmonic variance rule by indicating high scores when previous chords are <b style='color: forestgreen;'>close on the line of fifths</b>. This supports listeners expecting continuations that are <b style='color: forestgreen;'>high-scoring</b> acoustically and structurally."
        },
        {
            "title": "African Rhythm Analysis",
            "body": "<b style='color: forestgreen;'>African rhythm</b> is often seen as <b style='color: forestgreen;'>complex and central</b> in music. Scholars study it extensively, sometimes exclusively. The main query: how does it fit with <b style='color: forestgreen;'>Western rhythm models</b>? This chapter explores <b style='color: forestgreen;'>similarities and differences</b> between African and Western rhythm.\n\nMuch African music is <b style='color: forestgreen;'>percussion-based</b> and lacks <b style='color: forestgreen;'>defined pitch</b>. To apply rhythm models, we must consider <b style='color: forestgreen;'>timbral distinctiveness</b> rather than pitch. Structure and rhythmic <b style='color: forestgreen;'>patterns</b> guide rhythm perception in both African and Western contexts."
        },
        {
            "title": "Syncopation and African Rhythm",
            "body": "<b style='color: forestgreen;'>Syncopation Shift</b>: *Syncopation* in Western music often refers to a conflict between the notes and the meter, creating a rhythmic tension. In <b style='color: forestgreen;'>jazz, rock</b>, and some <b style='color: forestgreen;'>popular music</b>, a specific type of syncopation appears where accented events occur on weak beats, right before stronger beats. This phenomenon is called <b style='color: forestgreen;'>\"syncopation shift\"</b> and suggests these events belong to the upcoming stronger beat, reinforcing the meter. \n\n<b style='color: forestgreen;'>African Music</b>: In traditional <b style='color: forestgreen;'>African music</b>, syncopation shift is also present, as evidenced by transcriptions. Often, long, accented notes appear just before strong beats, implying a natural inclination to shift accents forward. This characteristic highlights a rhythmic pattern that aligns with the upcoming beats. One example involves a melody where these accented shifts occur frequently. This demonstrates the potential presence of syncopation shift in African music, suggesting that connections between rhythm and meter influence perception similar to Western music."
        },
        {
            "title": "Beyond Music Infrastructure & Meaning",
            "body": "The current section explores the idea of musical <b style='color: forestgreen;'>infrastructure</b>, comprising elements like <b style='color: forestgreen;'>meter</b> and <b style='color: forestgreen;'>harmony</b>, which form a framework underlying <b style='color: forestgreen;'>music cognition</b>. This infrastructure, much like societal systems such as water or power lines, provides the base for understanding and experiencing music. It's argued that these infrastructures are not ends in themselves, but serve higher musical purposes. <b style='color: forestgreen;'>Preference rule systems</b>—which guide how listeners and performers interpret music—are suggested to have implications beyond merely generating structural representations; they relate to higher musical experiences and meanings. In previous discussions, there has been considerable attention on the role of these elements in generating the structure of music. Now, the focus shifts to how these elements contribute to music's <b style='color: forestgreen;'>meaning</b>, or its <b style='color: forestgreen;'>function</b> in creating musical impact, stimulating thought about deeper connections between musical structure and experience."
        },
        {
            "title": "Understanding Musical Schemata and Tension",
            "body": "In music, <b style='color: forestgreen;'>topics</b> are idiomatic gestures or clichés with <b style='color: forestgreen;'>expressive meanings</b> beyond just the notes. They capture <b style='color: forestgreen;'>extra-musical stories</b> and feelings, often presented in phrases or entire movements, like <b style='color: forestgreen;'>\"hunt,\" \"singing,\" or dance-related</b> styles such as the minuet. Recognizing these topics involves understanding the <b style='color: forestgreen;'>underlying structures</b> like <b style='color: forestgreen;'>meter and harmony</b>. Similarly, listeners recognize <b style='color: forestgreen;'>musical tension</b> and release through harmonic analysis, figuring out why a piece feels <b style='color: forestgreen;'>stable or tense</b>. Fast music is not merely about speed but <b style='color: forestgreen;'>tempo</b>—the speed of the beat (<b style='color: forestgreen;'>tactus</b>). Also, elements like loudness and <b style='color: forestgreen;'>melody</b> rising in pitch add to the music's <b style='color: forestgreen;'>energy and excitement</b>."
        },
        {
            "title": "Musical Ambiguity and Rhythmic Structure",
            "body": "The <b style='color: forestgreen;'>index</b> section contains <b style='color: forestgreen;'>subject entries</b> relevant to the book's concepts on <b style='color: forestgreen;'>music theory and cognition</b>. Notable topics include:\n\n1. <b style='color: forestgreen;'>Ambiguity</b>: This has a significant role in <b style='color: forestgreen;'>music perception</b>, affecting <b style='color: forestgreen;'>harmonic analysis</b> and <b style='color: forestgreen;'>metrical structures</b>. Different styles, like rock or African music, mean ambiguity can be <b style='color: forestgreen;'>multifaceted</b>, making the accurate analysis complex. In many cases, ambiguity contributes to the expressive quality of music, influencing how listeners experience <b style='color: forestgreen;'>tension and resolution</b>.\n\n2. <b style='color: forestgreen;'>Sequential integration</b> and <b style='color: forestgreen;'>syncopation</b>: Important in <b style='color: forestgreen;'>musical rhythm</b> and structure, affecting the <b style='color: forestgreen;'>perceived flow</b> and listener's engagement. Syncopation, commonly used in rock and African rhythms, involves a displacement of accents creating <b style='color: forestgreen;'>rhythmic tension</b>. The <b style='color: forestgreen;'>book</b> explores the effect of syncopation in depth, illustrating its role in creating dynamic musical patterns that <b style='color: forestgreen;'>challenge traditional meter</b>."
        }
    ]
}