{
    "meta": {
        "title": "The Planet Remade",
        "author": "Oliver Morton",
        "publisher": "Princeton University Press",
        "pages": 441
    },
    "parts": [
        {
            "title": "Summary: Introduction to \"The Planet Remade\"",
            "body": "<b style='color: forestgreen;'>Oliver Morton</b> provides a thought-provoking <b style='color: forestgreen;'>introduction</b> to his book \"<b style='color: forestgreen;'>The Planet Remade</b>.\" He discusses the importance of addressing <b style='color: forestgreen;'>climate change</b> and the difficulties in shifting away from fossil fuels. Two central questions are posed: 1) Should we take serious action to reduce climate risks? <b style='color: forestgreen;'>Yes</b>, the risks are real and justify action. 2) Is it hard to reduce fossil-fuel emissions? Yes, it is very hard given the vast infrastructure in place. Morton explores the challenges in achieving energy transitions to clean sources like <b style='color: forestgreen;'>solar and wind.</b> Current efforts by nations fall short of making a significant change. This <b style='color: forestgreen;'>book</b> aims to ignite imagination about possible solutions."
        },
        {
            "title": "Climate Geoengineering and Imagined Futures",
            "body": "<b style='color: forestgreen;'>Climate Geoengineering and the Stratosphere</b>\n\nIn the context of the <b style='color: forestgreen;'>Anthropocene</b>, when humans bring intended changes to the <b style='color: forestgreen;'>earthsystem</b>, this is referred to as <b style='color: forestgreen;'>geoengineering</b>. <b style='color: forestgreen;'>Geoengineering</b> is any intentional technological <b style='color: forestgreen;'>intervention</b> in the <b style='color: forestgreen;'>earthsystem</b> on a global scale, aiming to affect the climate deliberately rather than inadvertently, like the <b style='color: forestgreen;'>extinction</b> of the dodo or eradication of smallpox. While adding carbon dioxide has foreseeable consequences, with much higher levels than desired, deliberate technological means, like <b style='color: forestgreen;'>machines</b> removing CO2, represent <b style='color: forestgreen;'>intended interventions</b>. <b style='color: forestgreen;'>Climate geoengineering</b> aims to decouple human behavior from its carbon emissions’ environmental impacts, potentially <b style='color: forestgreen;'>unshackling</b> the future from past behaviors, even if initially impractical on a grand scale.\n\nA <b style='color: forestgreen;'>thought experiment</b> imagines implementing <b style='color: forestgreen;'>large-scale</b> carbon capture, potentially resolving the climate problem by storing carbon in underground reservoirs, solid carbonate <b style='color: forestgreen;'>rock</b>, or as renewed fuel. However, this remains theoretical due to <b style='color: forestgreen;'>technology limitations</b> preventing massive-scale direct-air capture practicalities. Current attempts at developing this tech don’t meet expectations for significant <b style='color: forestgreen;'>climate impact</b>. Early work was led by charismatic physicists backed by wealthy investors, like <b style='color: forestgreen;'>Bill Gates</b>, yet results haven’t matched investments yet. Current estimates place capture costs significantly higher than earlier <b style='color: forestgreen;'>optimistic predictions</b>. Despite projects having brought technology close to reality, achieving high <b style='color: forestgreen;'>efficiency</b> remains elusive in mainstream, cost-effective applications, leading some to see such efforts as naïve or misguided capitalist ventures rather than applicable solutions for global climate issues.\n\n<b style='color: forestgreen;'>Diverse Futures and Imagination</b>\n\nAlthough consequential implementation may be currently limited, the idea of geoengineering holds potential relevance in the future and can help envision broader landscapes than Y/N (Yes/No) stances on climate. Beyond binary outlooks, unique perspectives open consideration of more sustainable or <b style='color: forestgreen;'>resilient economies</b>, desperately demanding <b style='color: forestgreen;'>adaptive futures</b> following environmental losses. Here, proponents recognize inevitable harms, but anticipate systemic changes might harness <b style='color: forestgreen;'>geoengineering</b> positively. Such viewpoints lead to imaginative possibilities, envisioning worlds where intervention <b style='color: forestgreen;'>alleviates</b> climate impacts. While unrealistic from a purist view, they resist wholly dismissing <b style='color: forestgreen;'>utopian ideation</b>, arguing imagining constructive alternatives facilitates discovering possibilities expanding beyond our present issues. Despite potential simplification, <b style='color: forestgreen;'>utopian thinking</b>, otherwise lamented, invites enrichened dialogue around systemic transformation beyond <b style='color: forestgreen;'>militaristic logic</b>."
        },
        {
            "title": "Geoengineering and Future Possibilities",
            "body": "## Deliberate Change and Geoengineering\n\nHumans now live in a new <b style='color: forestgreen;'>Anthropocene</b> era, characterized by <b style='color: forestgreen;'>deliberate changes</b> we make to the <b style='color: forestgreen;'>earthsystem</b>. <b style='color: forestgreen;'>Geoengineering</b> refers to <b style='color: forestgreen;'>technological interventions</b> on a global scale, aiming to adjust the climate deliberately. This includes projects like <b style='color: forestgreen;'>machinery</b> to remove <b style='color: forestgreen;'>carbon dioxide</b> from the atmosphere. Here, the distinction between <b style='color: forestgreen;'>intended</b> and <b style='color: forestgreen;'>unintended</b> effects is crucial. Efforts like carbon capture would intentionally change the climate by decoupling it from human emissions, aiming to provide a future <b style='color: forestgreen;'>better prepared</b> for climate change.\n\n## Imagination and Geoengineering\n\nIf developed, <b style='color: forestgreen;'>direct-air carbon-dioxide capture</b> could potentially alleviate climate issues by removing carbon as quickly as it's emitted, essentially <b style='color: forestgreen;'>recycling</b> it into various forms. However, current technology isn't practical or economical on a <b style='color: forestgreen;'>large scale</b>. Current research has been driven by charismatic scientists whose promising ideas have attracted investment from wealthy backers. Despite criticisms as below, hopes for <b style='color: forestgreen;'>sweeping climate solutions</b> remain, though the present practicality is <b style='color: forestgreen;'>limited</b> at best. Understanding geoengineering helps frame future possibilities amid technological, political, and social barriers.\n\n## New Perspectives and Faces\n\nThe societal <b style='color: forestgreen;'>imagination</b> of geoengineering must broaden to include <b style='color: forestgreen;'>varied perspectives</b> beyond elites and academics. Considering a <b style='color: forestgreen;'>broad societal engagement</b> with geoengineering ideas allows exploration of <b style='color: forestgreen;'>better worlds</b> which account for <b style='color: forestgreen;'>climate challenges</b>. Engaging with <b style='color: forestgreen;'>past and upcoming advances</b>, geoengineering could inspire <b style='color: forestgreen;'>learning to adapt</b> and mitigate climate effects creatively, balancing between a <b style='color: forestgreen;'>desirable future</b> and unwanted impacts. Those who imagine <b style='color: forestgreen;'>geoengineered worlds</b> must envision not only <b style='color: forestgreen;'>scientific solutions</b> but <b style='color: forestgreen;'>social consent</b> and diverse <b style='color: forestgreen;'>possibilities</b> rising from our <b style='color: forestgreen;'>interconnected planet</b>."
        },
        {
            "title": "Volcanoes and Cooling Effects on Climate",
            "body": "<b style='color: forestgreen;'>Astronomical</b> events like volcanic eruptions can have profound impacts on <b style='color: forestgreen;'>Earth's climate</b>. The <b style='color: forestgreen;'>eruption of Mount Pinatubo</b> in 1991 spewed <b style='color: forestgreen;'>sulphate aerosols</b> into the atmosphere, creating a high surface area similar to a <b style='color: forestgreen;'>desert</b>, reflecting sunlight and resulting in less direct sunlight reaching the Earth's surface. This created a <b style='color: forestgreen;'>cooling effect</b>, leading to a <b style='color: forestgreen;'>decrease in global temperatures</b>."
        },
        {
            "title": "Climate Perspectives & Geoengineering Evolution",
            "body": "In the modern world, Enlightenment ideas about climate being controlled by humans lost prominence for various reasons. This loss may not just be due to the <b style='color: forestgreen;'>falseness</b> of those beliefs, but because <b style='color: forestgreen;'>evidence</b> of <b style='color: forestgreen;'>geophysical</b> phenomena showed the complexities of climate. For example, the grandeur of ice ages and the <b style='color: forestgreen;'>scale</b> of global climate changes became apparent. Observations were made about <b style='color: forestgreen;'>planetary</b> conditions, like the <b style='color: forestgreen;'>canals</b> of Mars, which <b style='color: forestgreen;'>spurred</b> speculations about Martian civilizations capable of adapting their climate to ward off <b style='color: forestgreen;'>arsidness</b>. Such ideas influenced notions of grand projects with global consequences, like creating societies capable of managing such challenges. However, modern climate considerations <b style='color: forestgreen;'>moved</b> towards prioritizing mitigating carbon emissions at a global politics level, sidelining climate engineering as a discussion.\n\nIn the post-<b style='color: forestgreen;'>World</b> War II era, two styles of thought about <b style='color: forestgreen;'>climate</b> intervention emerged: \n<b style='color: forestgreen;'>Military</b> considerations on climate manipulation appeared viable in warfare, and peaceful <b style='color: forestgreen;'>geoengineering</b> speculations also arose, particularly to <b style='color: forestgreen;'>remediate</b> human impacts. The  integrative relationship between science and <b style='color: forestgreen;'>military</b> during that period led to various <b style='color: forestgreen;'>environmental</b> warfare ideas, illustrating the perception of a <b style='color: forestgreen;'>fragile</b> Earth. Writers like Jacob Darwin Hamblin explored these <b style='color: forestgreen;'>fascinations</b> with ideas, such as emboldening military capabilities through <b style='color: forestgreen;'>weather</b> manipulation. Concurrently, some <b style='color: forestgreen;'>scientists</b> proposed speculative solutions like Revelle suggesting floating ping-pong balls to reflect ocean sunshine. As geoengineering <b style='color: forestgreen;'>gained</b> importance, its study is less playful and more strategic.\n\nHowever, in the late 20th century, the <b style='color: forestgreen;'>climate change problem</b> gained urgency, focusing on carbon emissions rather than geoengineering solutions. After the <b style='color: forestgreen;'>1988</b> change in public awareness, strategies began <b style='color: forestgreen;'>addressing</b> CO2 reductions with international agreements like the <b style='color: forestgreen;'>Kyoto Protocol</b>. The simplicity of the carbon agenda was deemed necessary for effective <b style='color: forestgreen;'>international</b> cooperation. CO2 was an easier focus as it was a distinct <b style='color: forestgreen;'>target</b> amid the climate’s vast complexity, balancing varying views from natural scientists and policymakers alike. The \"<b style='color: forestgreen;'>simple</b> goals\" helped overcome political and scientific disputes, <b style='color: forestgreen;'>prioritizing</b> emissions reductions over other solutions such as geoengineering, leading to a temporary decline in focus on innovative climate engineering projects."
        },
        {
            "title": "Science, Environment, and Climate Challenges",
            "body": "<b style='color: forestgreen;'>The intertwining of science and global issues</b> is clear in these pages. <b style='color: forestgreen;'>Social and natural scientists</b> have a range of opinions on climate change, largely due to their <b style='color: forestgreen;'>early exposure</b> and commitment to environmentalism. This connection doesn't inherently bias their work but does introduce complexities.\n\nCarbon dioxide has been a <b style='color: forestgreen;'>straightforward metric</b> for climate change, serving various stakeholders conveniently. For scientists, it provides a quantifiable issue. For <b style='color: forestgreen;'>environmental activists</b>, it symbolizes the <b style='color: forestgreen;'>industrial world's excesses</b>. This focus aligns with <b style='color: forestgreen;'>developing nations' interests</b> since historical emissions have been predominantly from the developed world. Carbon markets, once seen as a compromise between <b style='color: forestgreen;'>capitalist and environmentalist goals</b> under leadership like <b style='color: forestgreen;'>Clinton and Blair</b>, have unfortunately underperformed.\n\n<h3 style='color: forestgreen;'>Climate Change Efforts and Emissions Controls</h3>\n\nDespite efforts like the UNFCCC and Kyoto Protocol aiming to reduce carbon emissions, <b style='color: forestgreen;'>global reliance on fossil fuels</b> represents a significant barrier. <b style='color: forestgreen;'>Carbon emission reductions</b> often don't yield immediate benefits, posing challenges for policy-makers. Regions like Britain report emissions reductions, but <b style='color: forestgreen;'>outsourcing production</b> often <b style='color: forestgreen;'>offsets these gains</b>. Realistically achieving deep cuts in carbon emissions is a monumental task. Two primary challenges are identified: the deep integration of fossil fuels in economic and industrial systems and the lack of immediate climate benefits from carbon reductions."
        },
        {
            "title": "Unleashing Energy and Understanding Anthropocene",
            "body": "<b style='color: forestgreen;'>The discovery of radioactivity in 1897</b> led to the realization that atoms of one element could transform into another, <b style='color: forestgreen;'>releasing immense energy</b>. While some scientists believed that <b style='color: forestgreen;'>this energy could be harnessed</b> to end struggles for resources and even <b style='color: forestgreen;'>control the climate</b>, it was <b style='color: forestgreen;'>fossil fuels rather than atomic energy</b> that powered the 20th century’s expansion. <b style='color: forestgreen;'>Fossil fuels drove the economy’s growth</b>, providing cheap energy and enabling technologies that replaced human and animal labor, transforming industrial and domestic life.\n\n<b style='color: forestgreen;'>The concept of the Anthropocene</b> refers to a <b style='color: forestgreen;'>new epoch of significant human impact on the Earth’s systems</b>, including the carbon cycle. Fossil fuels from past geological ages are being burned rapidly, <b style='color: forestgreen;'>altering the carbon cycle drastically</b>. Human consumption of energy, particularly from fossil fuels, <b style='color: forestgreen;'>dwarfs natural processes and is changing the planet's atmosphere</b>. For example, <b style='color: forestgreen;'>carbon dioxide levels are now far higher</b> than at any time in recent geological history, creating changes in the climate that <b style='color: forestgreen;'>some saw coming</b> with the Industrial Revolution.\n\nThese changes prompt debates such as <b style='color: forestgreen;'>whether human impact should be classified as a new geological era</b>, known as the Anthropocene. <b style='color: forestgreen;'>Supporters argue</b> that human activities have become a geological force <b style='color: forestgreen;'>altering the planet’s climate and ecosystems</b>. However, critics question whether <b style='color: forestgreen;'>scientific elaboration</b> can convey the profound <b style='color: forestgreen;'>philosophical and social implications</b> of these changes. They suggest we urgently assess <b style='color: forestgreen;'>how to manage or reverse these impacts</b> to avoid undesirable outcomes for the Earth’s future."
        },
        {
            "title": "Exploring Geoengineering Potentials",
            "body": "<b style='color: forestgreen;'>Geoengineering</b> proposes using technology to remove <b style='color: forestgreen;'>carbon dioxide</b> from the atmosphere. This chapter explores the <b style='color: forestgreen;'>feasibility</b> of such methods. These methods include enhancing <b style='color: forestgreen;'>plant absorption</b>, <b style='color: forestgreen;'>ocean absorption</b>, and using <b style='color: forestgreen;'>direct-air capture</b> machines, which act like <b style='color: forestgreen;'>\"huge aspirators\"</b> to clean the air, similar to John Latham's idea of <b style='color: forestgreen;'>\"soggy mirrors\"</b> with clouds reflecting sunlight. The concentration of <b style='color: forestgreen;'>carbon dioxide</b> is much lower in the air compared to power station emissions, making the process challenging and inefficient.\n\n<b style='color: forestgreen;'>Carbon capture</b> makes use of <b style='color: forestgreen;'>chemical absorption</b> from power station emissions, which contain higher <b style='color: forestgreen;'>carbon dioxide</b> concentrations. This technique seems more practical than pulling the gas directly from the <b style='color: forestgreen;'>atmosphere</b>. However, its implementation has stalled due to perceived complications and <b style='color: forestgreen;'>economic factors</b> like the cost of needed machinery and processing. Moreover, <b style='color: forestgreen;'>political and financial systems</b> favor investment in <b style='color: forestgreen;'>solar</b> and <b style='color: forestgreen;'>nuclear energy</b>, rather than in carbon capture.\n\nSome researchers propose the <b style='color: forestgreen;'>fertilization</b> of the <b style='color: forestgreen;'>ocean</b> with <b style='color: forestgreen;'>iron</b> to stimulate <b style='color: forestgreen;'>plankton growth</b>, which would supposedly draw down large amounts of <b style='color: forestgreen;'>carbon dioxide</b>. This idea faces many challenges. Experiments have shown that algae blooms generated by iron do not produce as <b style='color: forestgreen;'>significant</b> a reduction in <b style='color: forestgreen;'>carbon dioxide</b> as theorized. Additionally, potential environmental <b style='color: forestgreen;'>consequences</b> threaten both ecosystem health and the feasibility of permanently trapping <b style='color: forestgreen;'>carbon</b>. The <b style='color: forestgreen;'>politics</b> of <b style='color: forestgreen;'>geoengineering</b> remain <b style='color: forestgreen;'>complex</b>, needing rigorous <b style='color: forestgreen;'>international governance</b>, and raising fears of unexpected consequences within delicate environmental systems."
        },
        {
            "title": "Nuclear Fears and Environmental Catastrophes",
            "body": "<b style='color: forestgreen;'>Nuclear fears</b> and <b style='color: forestgreen;'>environmental catastrophes</b> were <b style='color: forestgreen;'>common themes</b> in the 1980s. <b style='color: forestgreen;'>Paul Crutzen's</b> work highlighted the atmospheric impact of <b style='color: forestgreen;'>nuclear war</b>, such as ozone layer thinning. His studies suggested that smaller nuclear arsenals could be less destructive, prompting <b style='color: forestgreen;'>further investigation</b> into potential climate changes, such as decreased sunlight from smoke after <b style='color: forestgreen;'>city fires</b>.\n\n<b style='color: forestgreen;'>TTAPS researchers</b> (Turco, Toon, Ackerman, Pollack, Sagan) further explored <b style='color: forestgreen;'>nuclear winter</b> scenarios, predicting drastic <b style='color: forestgreen;'>temperature drops</b> and widespread devastation. Such discoveries paralleled growing concerns about <b style='color: forestgreen;'>global cooling</b> and <b style='color: forestgreen;'>environmental risks</b>.\n\nThese fears influenced the political and <b style='color: forestgreen;'>scientific</b> landscapes, with nuclear weapons and potential climate changes mirroring concerns about <b style='color: forestgreen;'>environmental destruction</b>. People were increasingly aware of, and influenced by, the power and risks carried by <b style='color: forestgreen;'>nuclear technology</b>."
        },
        {
            "title": "Nuclear Winter and Planetary Engineering: Caution and Ambition",
            "body": "As the dangers of nuclear war became apparent, scientists <b style='color: forestgreen;'>underestimated</b> the impact of nuclear weapons dust, fire, and smoke on the climate compared to direct destruction. The atomic age inspired ambitions for earth-changing projects, yet the military downplayed nuclear effects on climate. <b style='color: forestgreen;'>Sagan</b>, later in his career, campaigned for nuclear disarmament using <b style='color: forestgreen;'>nuclear winter</b> insights.\n\nMeanwhile, knowledge of <b style='color: forestgreen;'>asteroid threats</b> evolved, motivated by the potential climatic devastation an impact could cause, akin to nuclear winter. The  <b style='color: forestgreen;'>Alvarez hypothesis</b> of an asteroid causing dinosaur extinction spurred <b style='color: forestgreen;'>NASA</b> to study asteroid impacts as real threats. Small space <b style='color: forestgreen;'>missions</b> became focused on <b style='color: forestgreen;'>discovering</b> potentially dangerous asteroids in response.\n\nSimilarly, scientific groups began considering <b style='color: forestgreen;'>planetary geoengineering</b> to mitigate climate risks inspired by how <b style='color: forestgreen;'>asteroid</b> intervention research had grown. The <b style='color: forestgreen;'>geoclique</b>, working initially in obscurity, slowly focused on pursuing ways to <b style='color: forestgreen;'>intentionally alter</b> the climate. They saw colleagues engaged in asteroid detection as allies and friends in confronting global-scale environmental risks."
        },
        {
            "title": "Geoengineering: Managing Climate Change and Its Effects",
            "body": "<h3 style='color: forestgreen;'>Geoengineering and Its <b style='color: forestgreen;'>Consequences</b></h3>\nThe <b style='color: forestgreen;'>thickening</b> stratospheric veil has played a significant role in <b style='color: forestgreen;'>limiting</b> global temperature increases to <b style='color: forestgreen;'>within 2ºC</b> by the end of the century. Emission <b style='color: forestgreen;'>reductions</b> are successful, with some countries <b style='color: forestgreen;'>achieving</b> 90% less than their historical highs. Despite changes in <b style='color: forestgreen;'>rainfall patterns</b>, these remain within the <b style='color: forestgreen;'>limits</b> of adaptation, indicating the veil's <b style='color: forestgreen;'>minimal negative impact</b>.\n\n<h3 style='color: forestgreen;'>Changes Due to Geoengineering</h3>\nThe <b style='color: forestgreen;'>geoengineered</b> cooler climate has coincided with <b style='color: forestgreen;'>rising sea levels</b>, prompting significant changes and adaptation in <b style='color: forestgreen;'>coastal</b> regions. The <b style='color: forestgreen;'>oceans</b>, though <b style='color: forestgreen;'>changed</b>, retain their usability for <b style='color: forestgreen;'>fishing</b>, with <b style='color: forestgreen;'>liming</b> programs in some areas <b style='color: forestgreen;'>partially successful</b>. On <b style='color: forestgreen;'>land</b>, higher carbon dioxide levels foster <b style='color: forestgreen;'>Sahel</b> vegetation growth. Meanwhile, reactivation of the <b style='color: forestgreen;'>monsoon</b> is carefully balanced against preserving regions like the <b style='color: forestgreen;'>Mojave.</b>\n\n<h3 style='color: forestgreen;'>Mitigating and <b style='color: forestgreen;'></b>Engineering** Earth's Environment</h3>\nContinued efforts to <b style='color: forestgreen;'>manipulate</b> climate focus on <b style='color: forestgreen;'>glacier protection</b> and <b style='color: forestgreen;'>refreezing</b> in <b style='color: forestgreen;'>Greenland</b>. Speculative projects aim to <b style='color: forestgreen;'>change</b> the <b style='color: forestgreen;'>winds</b> in <b style='color: forestgreen;'>Antarctica</b> to <b style='color: forestgreen;'>thicken its ice cap</b>. Such <b style='color: forestgreen;'>engineering feats</b> are viewed romantically by some, likened to the art of <b style='color: forestgreen;'>kintsugi</b>, representing an earth made more <b style='color: forestgreen;'>whole</b> through intentional repair."
        }
    ]
}