{
    "meta": {
        "title": "The Science of Being Human",
        "author": "Marty Jopson",
        "publisher": "Unspecified",
        "pages": 158
    },
    "parts": [
        {
            "title": "Exploring What It Means to Be Human",
            "body": "<b style='color: forestgreen;'>The introduction</b> of \"The Science of Being Human\" explores <b style='color: forestgreen;'>what it means</b> to be human through a unique and <b style='color: forestgreen;'>scientific lens</b>. <b style='color: forestgreen;'>Marty Jopson</b> combines various scientific fields to examine human <b style='color: forestgreen;'>evolution</b>, interactions, and the <b style='color: forestgreen;'>role of technology</b> in our lives. He highlights the <b style='color: forestgreen;'>complexity</b> of humans and how our <b style='color: forestgreen;'>social interactions</b> defy simple rules. This <b style='color: forestgreen;'>eclectic approach</b> incorporates <b style='color: forestgreen;'>modern discoveries</b> about our biological processes and challenges faced in today's <b style='color: forestgreen;'>digital age</b>. Overall, Jopson <b style='color: forestgreen;'>celebrates</b> the <b style='color: forestgreen;'>intricacy</b> and uniqueness of the human condition."
        },
        {
            "title": "Modern Human Evolution and Lactase Persistence",
            "body": "<b style='color: forestgreen;'>Many argue</b> that modern humans are beyond <b style='color: forestgreen;'>evolution by natural selection</b>. Though we manipulate environments to fit our biology, <b style='color: forestgreen;'>evolution</b> continues subtly through societal and psychological pressures. Variation between individuals persists, driving change over time. While we might not quickly evolve into a new species, our genetics have shifted from 300,000 years ago, such as <b style='color: forestgreen;'>diversified skin color.</b> Human evolution is slow; species shifts typically span <b style='color: forestgreen;'>a million years.</b>\n\nSome evolutionary changes are noticeable in modern humans, like <b style='color: forestgreen;'>lactase persistence</b>. Mammals generally stop producing lactase after weaning, leading to lactose intolerance in <b style='color: forestgreen;'>two-thirds</b> of adults consuming milk, causing digestion issues. Yet, <b style='color: forestgreen;'>one-third</b> of humans continue to produce lactase, aiding in their ability to digest milk. This persistence reveals evolutionary adaptation in humans to dairy consumption.\n\n<b style='color: forestgreen;'>Lactase persistence</b> allows some humans to digest lactose beyond infancy, whereas many adults experience discomfort with milk. This trait shows modern evolutionary change, highlighting that although evolution may be subtle, it remains impactful over time. Lactase persistence is an advantage for those populations that historically relied on dairy, shaping dietary practices and health outcomes."
        },
        {
            "title": "Evolving Concept of Species",
            "body": "The concept of <b style='color: forestgreen;'>species</b> evolved over time, especially with the introduction of <b style='color: forestgreen;'>Darwin's theories</b> on <b style='color: forestgreen;'>evolution</b>. Initially, species were considered fixed, but with Darwin's work, it became apparent that species evolved over time. Scientists like Ernst Mayer introduced <b style='color: forestgreen;'>biological species concepts</b> that involved not only <b style='color: forestgreen;'>reproductive ability</b> but also <b style='color: forestgreen;'>geographical isolation</b>. However, defining species using these concepts has proven complex, leading to debates and confusion, as exemplified by the case of the <b style='color: forestgreen;'>Larus ring species</b>."
        },
        {
            "title": "The Domestication and Evolution of Humans and Skin Colour",
            "body": "In a remarkable <b style='color: forestgreen;'>study on domestication</b> by Dmitri Belyaev in 1959, silver foxes were selectively bred for <b style='color: forestgreen;'>tameness</b> at a farm in Novosibirsk, Siberia. Despite initial challenges during a politically risky time in the Soviet Union, the experiment thrived under Belyaev and his assistant Lyudmila Trut. Over generations, these foxes became more <b style='color: forestgreen;'>sociable</b> and physically changed, suggesting domestication causes both <b style='color: forestgreen;'>behavioral</b> and <b style='color: forestgreen;'>physical transformations</b>. This mirrors what may have occurred in human <b style='color: forestgreen;'>evolution</b>, where skull and social trait changes indicate that humans might have domesticated themselves, reflecting a similar selective <b style='color: forestgreen;'>advantage</b>.\n\nAnother breakthrough idea <b style='color: forestgreen;'>links domestication</b> to neural crest cells, vital during early human development. These cells contribute to various body structures and may influence traits associated with domestication, like <b style='color: forestgreen;'>reduced aggression</b> and <b style='color: forestgreen;'>physical features</b>. The drastic alteration in foxes' features during the domestication study aligns with this hypothesis, hinting that fewer neural crest cells might drive these changes. Although still a hypothesis, understanding this can shed light on why humans became highly <b style='color: forestgreen;'>sociable</b> and <b style='color: forestgreen;'>less aggressive</b>.\n\nThe complexity of <b style='color: forestgreen;'>skin colour</b> evolution is another captivating subject. Modern genetic analysis reveals that <b style='color: forestgreen;'>dark skin</b> evolved over a million years ago, prior to humans. However, <b style='color: forestgreen;'>light skin</b> adaptation in Europeans appeared about <b style='color: forestgreen;'>6,000 years ago</b>, suggesting a separate, later development. Interestingly, different genetic paths led to lighter skin in East Asians, showing that <b style='color: forestgreen;'>evolutionary pressures</b> differed globally. Although the exact reasons behind these adaptations remain debated, our understanding continues to grow, illuminating how complicated and intertwined our biological evolution truly is."
        },
        {
            "title": "Theories on Skin Color Evolution",
            "body": "<b style='color: forestgreen;'>Evolution of Skin Color</b>: The <b style='color: forestgreen;'>vitamin D-folate hypothesis</b> suggests skin color evolution relates to <b style='color: forestgreen;'>nutritional demands</b>, though some doubt its validity. Folate is vital for <b style='color: forestgreen;'>DNA repair</b> and <b style='color: forestgreen;'>cell division</b>, with <b style='color: forestgreen;'>UV light</b> causing folate breakdown, leading to <b style='color: forestgreen;'>darker skin</b> evolution for protection. Conversely, vitamin D synthesis requires sunlight, so <b style='color: forestgreen;'>lighter skin</b> appeared in areas with <b style='color: forestgreen;'>less UV exposure</b> to boost vitamin D production. An <b style='color: forestgreen;'>alternative theory</b> proposes that <b style='color: forestgreen;'>skin melanin</b> evolved to manage <b style='color: forestgreen;'>water conservation</b> through less permeability, becoming unnecessary in Europe. Neither theory is definitively proven, and it is likely both factors <b style='color: forestgreen;'>influence skin color evolution</b>."
        },
        {
            "title": "Understanding the Uncanny Valley",
            "body": "<b style='color: forestgreen;'>Rogue One</b> used the latest <b style='color: forestgreen;'>digital technology</b> to recreate <b style='color: forestgreen;'>Carrie Fisher</b> as <b style='color: forestgreen;'>Princess Leia</b> from <b style='color: forestgreen;'>1977</b> in a way that felt <b style='color: forestgreen;'>unnerving</b>. This effect is due to the <b style='color: forestgreen;'>\"uncanny valley\"</b> hypothesis, first introduced by <b style='color: forestgreen;'>Masahiro Mori</b> in <b style='color: forestgreen;'>1970</b>. As human-like animations approach realism but aren't perfect, they cause <b style='color: forestgreen;'>discomfort</b> instead of <b style='color: forestgreen;'>empathy</b>. The film <b style='color: forestgreen;'>The Polar Express</b> faced similar criticism due to its close-to-reality animations that seemed unsettling. Humans are adept at detecting <b style='color: forestgreen;'>imperfections</b> in these images, akin to spotting <b style='color: forestgreen;'>fake</b> or <b style='color: forestgreen;'>polluted</b> stimuli, as a <b style='color: forestgreen;'>survival instinct</b>."
        },
        {
            "title": "Examining Internet Addiction and Its Causes",
            "body": "## Internet Addiction in South Korea: A Growing Concern\n\nSouth Korea, known for its <b style='color: forestgreen;'>high internet penetration</b>, is facing a <b style='color: forestgreen;'>growing issue</b> of internet addiction. In 2013, a survey found that 7% of South Koreans between the ages of five and fifty-five were at risk of becoming addicted to the internet. Among <b style='color: forestgreen;'>teenagers</b>, this figure was even more alarming, with one in eight at risk. This growing concern has led South Korea to actively seek ways to understand and address the issue to prevent potential addiction.\n\n## Understanding Addiction: Beyond Drugs\n\nTraditionally, addiction was associated with <b style='color: forestgreen;'>substances</b> like cocaine, heroin, or alcohol. These substances alter brain chemistry, creating a dependency and unpleasant withdrawal symptoms. However, <b style='color: forestgreen;'>research</b> has shown that addiction is not only about substances; it’s about behaviors too, with activities that cause dopamine spikes being potentially addictive. An experiment by <b style='color: forestgreen;'>Kent Berridge</b> with rats demonstrated that wanting and liking are distinct, shedding light on why behavioral addictions like internet use can develop.\n\n## The Role of Dopamine in Internet and Game Addiction\n\nDopamine is a key player in addiction, regulating our <b style='color: forestgreen;'>wants</b> more than our <b style='color: forestgreen;'>likes</b>. Video games, like the infamous <b style='color: forestgreen;'>Flappy Bird</b>, showcase how simple games can become addictive by providing <b style='color: forestgreen;'>simple goals</b> that seem achievable. The game's mechanics encourage repetitive playing despite players not necessarily enjoying it. This reinforces understanding of behavioral addiction, a concern as more interactive online activities continue to emerge globally, prompting nations like South Korea to explore solutions tailored for such widespread phenomena."
        },
        {
            "title": "Understanding Alzheimer's: Bacteria Link and New Hopes",
            "body": "<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Understanding Alzheimer's Disease: Causes and Hypotheses</b></h3>\n\n<b style='color: forestgreen;'>Alzheimer's disease</b> presents with <b style='color: forestgreen;'>brain shrinkage</b>, <b style='color: forestgreen;'>plaques</b>, and <b style='color: forestgreen;'>tangles</b> visible under a microscope. Initially assumed to be caused by <b style='color: forestgreen;'>beta-amyloid plaques</b>, researchers suggested they obstruct brain function. Despite massive investments, efforts to treat or understand Alzheimer's based solely on this <b style='color: forestgreen;'>amyloid hypothesis</b> have been disappointing. Consequently, scientists have begun questioning this hypothesis, particularly since plaques are also found in \"<b style='color: forestgreen;'>super-agers</b>\", who show no symptoms.\n\n<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Exploring New Horizons: Amyloid Plaques and Gum Disease</b></h3>\n\nAlternative theories propose that Alzheimer's may be linked to <b style='color: forestgreen;'>gum disease</b>, particularly associated with <b style='color: forestgreen;'>bacteria Porphyromonas gingivalis</b>. Studies indicate its presence in <b style='color: forestgreen;'>brains with Alzheimer's-like conditions</b>, suggesting a <b style='color: forestgreen;'>causal link</b>. While the bacteria in brains of test mice produce <b style='color: forestgreen;'>amyloid plaques</b>, the exact pathway of how these bacteria reach the brain remains unclear. Some hypotheses include <b style='color: forestgreen;'>sneaking through white blood cells</b>. The connection suggests <b style='color: forestgreen;'>immune responses</b> may complicate Alzheimer's, but research is ongoing.\n\n<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Hopes for New Treatments</b></h3>\n\nThe link between Alzheimer's and gum disease opens possibilities for new treatments. <b style='color: forestgreen;'>Researchers in Australia</b> are developing a <b style='color: forestgreen;'>vaccine against Porphyromonas gingivalis</b>, and drug companies are exploring ways to <b style='color: forestgreen;'>target the bacteria</b>. If successful, <b style='color: forestgreen;'>dental hygiene improvements</b> could be an unexpected benefit of Alzheimer's treatments. However, establishing a <b style='color: forestgreen;'>definitive cure</b> remains a guarded hope."
        },
        {
            "title": "Human Hair Evolution Theories",
            "body": "<b style='color: forestgreen;'>Evolutionary Biologists</b> have long debated why humans lost most of their terminal <b style='color: forestgreen;'>hair</b> compared to chimpanzees. Some theories suggest that <b style='color: forestgreen;'>sexual selection</b> could be linked to <b style='color: forestgreen;'>hairy</b> men being seen as more desirable. However, <b style='color: forestgreen;'>parasites</b> like <b style='color: forestgreen;'>head lice</b> on hair or the need for <b style='color: forestgreen;'>heat regulation</b> in the <b style='color: forestgreen;'>African climate</b> might have driven this change. Less hair could lead to fewer <b style='color: forestgreen;'>parasites</b> or improve <b style='color: forestgreen;'>body temperature control</b>, especially with <b style='color: forestgreen;'>velus hairs</b> aiding in <b style='color: forestgreen;'>cooling</b>.\n\nDespite these theories, other primates didn't evolve similarly, causing scientists to ponder why humans did. While less hair helps in heat regulation, a <b style='color: forestgreen;'>fur covering</b> is beneficial for <b style='color: forestgreen;'>warmth at night</b>. This evolution may have coincided with the growth of human <b style='color: forestgreen;'>intelligence</b> and <b style='color: forestgreen;'>tool use</b>, such as creating <b style='color: forestgreen;'>clothing</b> for warmth, which could be quickly spread through <b style='color: forestgreen;'>language</b> and <b style='color: forestgreen;'>culture</b>. These factors combined might have influenced humans switching from fur-covered skin to appearing as \"naked apes\".\n\nThe fascinating hypothesis juxtaposes <b style='color: forestgreen;'>human evolution</b> and <b style='color: forestgreen;'>hair change</b> by linking it to <b style='color: forestgreen;'>cultural advancements</b> like clothing, allowing humans to survive without fur. This highlights the <b style='color: forestgreen;'>adaptive nature</b> of human evolution where intelligence permitted survival tactics to be passed across generations, supporting the view of humans' unique evolutionary path."
        },
        {
            "title": "Understanding Placebo and Nocebo Effects",
            "body": "<b style='color: forestgreen;'>The placebo effect</b> is an intriguing phenomenon where patients can experience real improvements in their condition even when treated with <b style='color: forestgreen;'>sugar pills</b> they know are not active drugs. This was shown in trials for irritable bowel syndrome where patients reported symptom relief despite taking inactive treatments. <b style='color: forestgreen;'>Ethical concerns</b> arise when placebos are used without patient consent, but recent research suggests informed consent doesn’t always negate effectiveness. Placebos can work because they <b style='color: forestgreen;'>restructure brain communication</b> to alleviate symptoms, demonstrating that some conditions are neural miscommunications rather than site-specific issues.\n\nThe concept of <b style='color: forestgreen;'>nocebo</b> is the flip side, where if patients are warned about potential side effects, they might actually experience them, as has been found in studies with control groups taking placebos. This reveals that <b style='color: forestgreen;'>mental expectations</b> can greatly influence the presence of symptoms, whether beneficial or detrimental. Understanding the placebo and nocebo effect challenges how <b style='color: forestgreen;'>clinical trials</b> are evaluated, blurring lines between actual drug efficacy and mind-induced improvements.\n\nThe quest for understanding how placebos work could involve investigating <b style='color: forestgreen;'>genetic predispositions</b> towards placebo efficacy. Research has identified <b style='color: forestgreen;'>specific genes</b> that correlate with increased responsiveness to placebos, opening new avenues for personalized treatment plans. Moreover, knowledge of such genetic influence can help decipher who might benefit more from placebo treatments, changing the landscape of <b style='color: forestgreen;'>medical prescriptions</b> and patient management by perhaps integrating placebo elements deliberately in treatment approaches."
        },
        {
            "title": "Queue Theory and Real-World Applications",
            "body": "<b style='color: forestgreen;'>Queue Theory</b> is a branch of mathematics focused on optimal line management, originating with <b style='color: forestgreen;'>Agner Erlang</b> in 1909. The basic categorization of queues uses a code of two letters and a number, defining arrival frequency, service time, and server count (e.g., D/D/1 for deterministic arrivals and service with 1 server). While the simplest <b style='color: forestgreen;'>D/D/1</b> queue rarely occurs with humans, a more common <b style='color: forestgreen;'>M/M/1</b> queue features random arrivals and service times, like in supermarkets where line delays can occur unpredictably. \n\nSuch random <b style='color: forestgreen;'>M/M/1 queues</b> manifest not only in supermarkets but also in other scenarios like public lavatories, where women's wait times are disproportionately longer due to a mismatch in facility numbers and usage time. Even increasing facilities doesn't guarantee equal waiting times, as designs often don't account for holistic seat allocation principles. Inequity persists despite efforts to adjust architectural designs based on rigorous queue mathematics.\n\nSolutions for efficient queuing, drawing from <b style='color: forestgreen;'>M/M/1 principles</b>, recommend adjusting facilities in women's restrooms to match load demands. Doubling women's facilities relative to men's is optimal, but it requires balancing spatial allocation disparities. Toilets take more space than urinals, complicating implementation. Solving these issues requires incorporating <b style='color: forestgreen;'>mathematical principles</b> into planning for real-world applications."
        }
    ]
}