{
    "meta": {
        "title": "Under the Microscope: A Brief History of Microscopy",
        "author": "William J Croft",
        "publisher": "World Scientific Publishing Co. Pte. Ltd.",
        "pages": 152
    },
    "parts": [
        {
            "title": "History and Evolution of Microscopy",
            "body": "The <b style='color: forestgreen;'>foreword</b> of \"Under the Microscope\" explores the history of humanity's fascination with the <b style='color: forestgreen;'>\"small world\"</b>, from early magnifying lenses to modern sophisticated techniques. The book covers the milestones in <b style='color: forestgreen;'>microscopy</b>, including <b style='color: forestgreen;'>van Leeuwenhoek's</b> high-resolution microscopes and the evolution of <b style='color: forestgreen;'>optical</b> and <b style='color: forestgreen;'>electron microscopes</b>, eventually leading to modern <b style='color: forestgreen;'>scanning probe microscopy</b>. It places significant emphasis on the increasing <b style='color: forestgreen;'>magnification</b> and measurement units such as <b style='color: forestgreen;'>microns</b> and <b style='color: forestgreen;'>nanometers</b> used in today's high-tech <b style='color: forestgreen;'>microscopes</b>, setting a context for the atomic-scale imaging.\n"
        },
        {
            "title": "Pioneers of Early Microscopy: Hooke and Leeuwenhoek",
            "body": "<b style='color: forestgreen;'>Robert Hooke</b> (1635-1703) was a pivotal figure in early <b style='color: forestgreen;'>microscopy</b>. Known for the book \"Micrographia,\" he coined the term <b style='color: forestgreen;'>\"cells\"</b> after observing the structure of <b style='color: forestgreen;'>cork</b>. Despite preferring <b style='color: forestgreen;'>compound microscopes</b>, he acknowledged the clarity of <b style='color: forestgreen;'>single lens instruments</b>. Hooke made major contributions, including <b style='color: forestgreen;'>Hooke's Law</b> of <b style='color: forestgreen;'>elasticity</b> and early theories regarding the <b style='color: forestgreen;'>wave nature</b> of light.\n\nAnother significant contributor was <b style='color: forestgreen;'>Antony van Leeuwenhoek</b>, a <b style='color: forestgreen;'>Dutch draper</b> (<b style='color: forestgreen;'>1632-1723</b>). Despite no formal education, he ground <b style='color: forestgreen;'>microscope lenses</b> and made groundbreaking <b style='color: forestgreen;'>biological observations</b>. Leeuwenhoek discovered <b style='color: forestgreen;'>bacteria</b>, <b style='color: forestgreen;'>sperm cells</b>, and <b style='color: forestgreen;'>blood cells</b>, contributing immensely to the field. Notably, he built over <b style='color: forestgreen;'>500 microscopes</b> and preferred single lens designs, contrary to Hooke's views.\n\nIn his interactions, Leeuwenhoek was known for his meticulous nature and maintained a strong relationship with the <b style='color: forestgreen;'>Royal Society</b> in London. His diverse work experience included roles such as <b style='color: forestgreen;'>surveyor</b> and <b style='color: forestgreen;'>wine assayer</b>. Through dedication, he raised <b style='color: forestgreen;'>scientific awareness</b> and his discoveries caught the attention of many contemporary <b style='color: forestgreen;'>scientists</b>. Known for meticulous methods, his exact surname's pronunciation remains a point of historic curiosity."
        },
        {
            "title": "Historical Foundations of Microscopy and Optics",
            "body": "<h3 style='color: forestgreen;'>Summary of Key Points: Early Exploration of Light and Optics</h3>\n\nThe chapter <b style='color: forestgreen;'>highlights the historical development</b> of microscopy, <b style='color: forestgreen;'>beginning with the Ancient Greeks</b>. It notes early observations such as <b style='color: forestgreen;'>Aristophanes' mention of glass globules</b> in Athens and <b style='color: forestgreen;'>Euclid's foundational work in optics</b>, around <b style='color: forestgreen;'>300 B.C.</b>. These figures laid the groundwork for understanding <b style='color: forestgreen;'>light as a straight line</b> and the phenomenon of <b style='color: forestgreen;'>refraction</b>, where light bends upon entering different media.\n\nImportant concepts like <b style='color: forestgreen;'>refraction</b> are explained with visual aids: a stick appearing bent in water, and soldiers changing direction on uneven terrain, illustrating light's behavior as it travels through <b style='color: forestgreen;'>different densities</b>. The transition from low- to high-density media (e.g., air to glass) further explains <b style='color: forestgreen;'>light bending</b> towards the surface. <b style='color: forestgreen;'>Curved surfaces on glass lead to lens formation</b>, demonstrating early understandings of <b style='color: forestgreen;'>optics and magnification</b>.\n\nThe discovery of a <b style='color: forestgreen;'>plano-convex lens at Nimrod</b> signifies early lens use, presumed to date back <b style='color: forestgreen;'>to the 700s B.C.</b>, though initially thought to be more decorative than functional. By the <b style='color: forestgreen;'>first century A.D.</b>, individuals like <b style='color: forestgreen;'>Seneca</b> discussed magnification through water globes. Innovations like spectacles in <b style='color: forestgreen;'>1280 Florence</b> amplified still-limited but intriguing <b style='color: forestgreen;'>optical knowledge</b>, spreading quickly across the world while laying the foundations for more advanced studies."
        },
        {
            "title": "Understanding Crystals' Symmetry and Structure",
            "body": "<b style='color: forestgreen;'>Crystals</b> are solid structures with <b style='color: forestgreen;'>periodically</b> arranged atoms, contrasting with <b style='color: forestgreen;'>glasses</b> and <b style='color: forestgreen;'>liquids</b> where atoms are <b style='color: forestgreen;'>randomly</b> arranged. The periodicity in crystals gives them unique <b style='color: forestgreen;'>properties</b>. A key concept is the <b style='color: forestgreen;'>\"law of constancy of interfacial angles\"</b> discovered by Nicolaus Steno in 1669, stating that angles between similar crystal faces are <b style='color: forestgreen;'>constant</b> across crystals of the same material. This finding led to understanding that crystal properties result from their <b style='color: forestgreen;'>internal structure</b>. Symmetry plays a crucial role in classifying crystals, which can be understood through <b style='color: forestgreen;'>symmetry operations</b> like rotations and mirrors. This helps organize the structure into <b style='color: forestgreen;'>six crystal systems</b>: cubic, tetragonal, hexagonal, orthorhombic, monoclinic, and triclinic, each defined by the <b style='color: forestgreen;'>axes</b> and <b style='color: forestgreen;'>angles</b> of their crystal structure.\n\nSymmetry in crystals is determined by <b style='color: forestgreen;'>axes</b>, <b style='color: forestgreen;'>planes</b>, and a <b style='color: forestgreen;'>center</b> of symmetry. Some crystals have <b style='color: forestgreen;'>2-fold</b> or <b style='color: forestgreen;'>3-fold symmetry axes</b>, and others like cubes display <b style='color: forestgreen;'>planes of symmetry</b> acting like mirrors. A third type of symmetry is the <b style='color: forestgreen;'>center of symmetry</b>, where for every feature, a copy is found at an equal distance on the opposite side. With a mix of these elements, crystals fall into <b style='color: forestgreen;'>32 point groups</b>, describing the <b style='color: forestgreen;'>morphology</b> of crystals. However, these point groups don't fully capture the <b style='color: forestgreen;'>atomic arrangements</b> in a crystal. Historically, naturalists believed crystals were made of <b style='color: forestgreen;'>basic building blocks</b>, a theory supported by <b style='color: forestgreen;'>Abbe Rene Just Haiiy</b> despite his inability to see these blocks with his microscopes. The repetition of the smallest structural unit fits into one of <b style='color: forestgreen;'>14 Bravais lattices</b> that describe the crystal's spatial arrangement, pre-dating von Laue's demonstration by over half a century.\n\nUnderstanding these concepts aids in applying <b style='color: forestgreen;'>polarizing microscopes</b>, which reveal crystal properties by exploiting these <b style='color: forestgreen;'>symmetries</b> using <b style='color: forestgreen;'>polarized light</b>. For example, features like <b style='color: forestgreen;'>anisotropy</b> or <b style='color: forestgreen;'>isotropy</b> relate to how light interacts differently with crystals of varying symmetry. Early scientists who contributed to this field often combined tools like <b style='color: forestgreen;'>Nicol prisms</b>, <b style='color: forestgreen;'>Canada balsam</b>, and thin sections for studying rocks and crystals. With advancements in <b style='color: forestgreen;'>polarizing techniques</b>, these methods now significantly enhance <b style='color: forestgreen;'>mineralogical</b>, <b style='color: forestgreen;'>geological</b>, and <b style='color: forestgreen;'>chemical</b> study, informing practical applications in scientific research today."
        },
        {
            "title": "Polarized Light and Crystal Properties Overview",
            "body": "<h3 style='color: forestgreen;'>Polarized Light and Crystal Properties</h3>\n\nIn <b style='color: forestgreen;'>crystals</b>, directional and <b style='color: forestgreen;'>value properties</b> can be represented by <b style='color: forestgreen;'>vector surfaces</b>. For example, in <b style='color: forestgreen;'>cubic crystals</b>, <b style='color: forestgreen;'>thermal expansion</b> appears isotropic, forming a <b style='color: forestgreen;'>sphere</b>. However, in <b style='color: forestgreen;'>lower symmetry</b> crystals like <b style='color: forestgreen;'>hexagonal or tetragonal</b>, expansion forms a <b style='color: forestgreen;'>revolution ellipsoid</b>. The <b style='color: forestgreen;'>optical properties</b>, such as the <b style='color: forestgreen;'>velocity of light</b> in a crystal, have vector surfaces like a <b style='color: forestgreen;'>sphere</b> in cubic crystals, making them <b style='color: forestgreen;'>optically isotropic</b>. <b style='color: forestgreen;'>Non-cubic crystals</b> split light into two <b style='color: forestgreen;'>polarized rays</b> — the <b style='color: forestgreen;'>ordinary ray</b> (spherical vector surface) and the <b style='color: forestgreen;'>extraordinary ray</b> (ellipsoid vector surface)."
        },
        {
            "title": "Reflected Light Microscopy Highlights",
            "body": "<h3 style='color: forestgreen;'>Summary Chunk</h3>\n\n<b style='color: forestgreen;'>Light Microscopy</b>'s history is filled with <b style='color: forestgreen;'>explorations</b> into both <b style='color: forestgreen;'>transparent</b> and <b style='color: forestgreen;'>opaque</b> materials. While <b style='color: forestgreen;'>biological materials</b> were initially more revealing, metals posed challenges due to their surface-level observations. In <b style='color: forestgreen;'>1664, Henry Power</b> documented <b style='color: forestgreen;'>metal surfaces</b>, noting <b style='color: forestgreen;'>irregularities</b> and <b style='color: forestgreen;'>vitrification</b> of sparks, while <b style='color: forestgreen;'>Robert Hooke</b> delved into this phenomenon in his famous <b style='color: forestgreen;'>\"Micrographia\"</b> work. Hooke's <b style='color: forestgreen;'>compound microscope</b> observations nurtured the development of metal study, although his metallurgical insights were limited to external features like <b style='color: forestgreen;'>scratches on a razor</b>. \n\n<h3 style='color: forestgreen;'>Metallurgical Advances</h3>\n\n<b style='color: forestgreen;'>Antonie van Leeuwenhoek</b>, known for his exploration of <b style='color: forestgreen;'>microscopic world</b>, contributed to metals' study by identifying <b style='color: forestgreen;'>crystalline structures</b> in <b style='color: forestgreen;'>the 1700s</b>. Later, <b style='color: forestgreen;'>Henry Clifton Sorby</b>, in <b style='color: forestgreen;'>1850</b>, advanced metal microscopy. Despite limited initial awareness, Sorby refined <b style='color: forestgreen;'>etching techniques</b> and identified <b style='color: forestgreen;'>microstructures in steel</b>, laying foundational <b style='color: forestgreen;'>metallurgical principles</b>. His <b style='color: forestgreen;'>polishing</b> and <b style='color: forestgreen;'>magnification</b> methods were novel, serving as a <b style='color: forestgreen;'>lens into metal's micro-world</b>. Sorby's microscope <b style='color: forestgreen;'>advancements</b> contributed significantly to metallurgy, underpinning modern techniques. \n\n<h3 style='color: forestgreen;'>Reflected Light and Scientific Developments</h3>\n\nThrough advances like <b style='color: forestgreen;'>R. Beck's reflector</b> and <b style='color: forestgreen;'>Lieberkuhn’s mirror</b>, greatly improved <b style='color: forestgreen;'>microscopy of opaque structures</b> emerged. Sorby’s use of <b style='color: forestgreen;'>reflected light</b> techniques distinguished textures and compositions, critical for studying metals like <b style='color: forestgreen;'>iron and steel</b>. As science progressed, tools like <b style='color: forestgreen;'>electron-probe micro-analyzers</b> provided refined ways to analyze opaque minerals, aligned with observed <b style='color: forestgreen;'>optical properties</b> like <b style='color: forestgreen;'>brightness</b> and <b style='color: forestgreen;'>hardness</b>. This led to broader applications in <b style='color: forestgreen;'>Materials Science</b> and <b style='color: forestgreen;'>Forensic Science</b>, revealing the depth and <b style='color: forestgreen;'>complexity of the microstructures</b> in <b style='color: forestgreen;'>metallurgical and other scientific fields</b>."
        },
        {
            "title": "Beginnings of Electron Microscopy",
            "body": "Electron microscopy has many contributors, with <b style='color: forestgreen;'>Max Knoll</b> and <b style='color: forestgreen;'>Ernst Ruska</b> making notable progress in <b style='color: forestgreen;'>1931</b>. They built a <b style='color: forestgreen;'>magnetic lens</b> microscope, leading to advancements in electron microscope development. <b style='color: forestgreen;'>Günther Rüdenberg</b> filed a patent for the electron microscope using multiple lenses the same year. The electron microscope's capability to see below atomic levels stems from electrons' <b style='color: forestgreen;'>small size</b> compared to atoms, with techniques like <b style='color: forestgreen;'>Transmission Electron Microscopy (TEM)</b> enhancing this ability. <b style='color: forestgreen;'>Electron guns</b> and <b style='color: forestgreen;'>magnetic lenses</b> form the core of the electron microscope, which captures images through fluorescent materials."
        },
        {
            "title": "Electron Diffraction and its Historical Development",
            "body": "<b style='color: forestgreen;'>Electron diffraction</b> is a powerful method used in <b style='color: forestgreen;'>electron microscopes</b> to study the properties and structure of <b style='color: forestgreen;'>crystals</b>. It builds upon Max von Laue's discovery of X-ray diffraction in 1912, showing that crystals can diffract X-rays and electrons into a <b style='color: forestgreen;'>periodic pattern</b>, helping identify materials and their characteristics. In 1912, von Laue received a <b style='color: forestgreen;'>Nobel Prize</b> for his work, which was further simplified by <b style='color: forestgreen;'>W.H. Bragg</b> using Bragg's Law, allowing for the precise calculation of crystal structure based on the diffraction pattern."
        },
        {
            "title": "Chemical Composition Analysis via Microscopy Techniques",
            "body": "<b style='color: forestgreen;'>Optical Microscopy</b> uses <b style='color: forestgreen;'>polarized light</b> for analyzing chemical <b style='color: forestgreen;'>composition</b> of small samples, like in forensic or materials science. This technique, once widespread, is becoming obsolete due to the rise of instruments like the <b style='color: forestgreen;'>Electron Probe Microanalyser (EPMA)</b>, which enable precise analysis at higher costs. Unfortunately, <b style='color: forestgreen;'>optical methods</b> are no longer commonly taught in universities, except in certain institutes like the <b style='color: forestgreen;'>McCrone Institute of Chicago</b>.\n\n<b style='color: forestgreen;'>X-Rays and Electrons</b>: The basics of the <b style='color: forestgreen;'>X-Ray process</b> began with Wilhelm Conrad Röntgen's discovery, leading to the identification of different <b style='color: forestgreen;'>radiation types</b> like K and L by Barkla. Later, the diffraction works by Max von Laue, and significant contributions by W. H. Bragg, and his son, confirmed the periodic nature of atoms and led to the development of <b style='color: forestgreen;'>X-ray spectrographs</b> for material analysis. <b style='color: forestgreen;'>Henry Moseley</b> revolutionized understanding atomic numbers through his X-ray spectrometry work with elements.\n\n<b style='color: forestgreen;'>Early X-ray Discoveries</b>: Moseley's studies proved the <b style='color: forestgreen;'>periodic table's</b> completeness and helped predict new elements. His pioneering work was cut short due to his early death in World War I. <b style='color: forestgreen;'>EPMA Development</b>: Raymond Castaing developed the <b style='color: forestgreen;'>first microprobe</b> for <b style='color: forestgreen;'>chemical analysis</b> by modifying an electron microscope. Castaing detailed how localized analysis was possible by focusing an <b style='color: forestgreen;'>electron beam</b> and measuring <b style='color: forestgreen;'>secondary X-rays</b>. Despite its age, this technique strikes a balance between <b style='color: forestgreen;'>cost and efficacy</b> for detailed compositional analysis."
        },
        {
            "title": "Atomic-Level Microscopic Techniques in Modern Studies",
            "body": "<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Quantum Microscopy and Molecule Imaging</b></h3>\n\nThe <b style='color: forestgreen;'>Scannning Probe Microscopes (SPM)</b>, including the <b style='color: forestgreen;'>Scanning Tunneling Microscope (STM)</b>, revolutionized microscopy by allowing visualization at an <b style='color: forestgreen;'>atomic level</b>. The STM achieves this through an <b style='color: forestgreen;'>atomically sharp probe</b> and quantum tunneling, overcoming limitations of traditional microscopes. Several issues such as vibration isolation, probe sharpening, and precise scanning movements were ingeniously addressed, which allowed visualization of the <b style='color: forestgreen;'>atomic arrangement on surfaces</b>.\n\n<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Atomic Force and New Measurement Modes</b></h3>\n\nThe <b style='color: forestgreen;'>Atomic Force Microscope (AFM)</b> emerged as a derivative of the STM, enabling study of <b style='color: forestgreen;'>non-conductive surfaces</b>. AFM uses an ultra-sharp tip to scan the surface topography and operates in <b style='color: forestgreen;'>contact or tapping modes</b>. It's employed in varied environments including <b style='color: forestgreen;'>liquid</b>, making it useful for biological samples. Besides topography, AFM supports techniques like <b style='color: forestgreen;'>Lateral Force Microscopy</b> or <b style='color: forestgreen;'>Chemical Force Microscopy</b>, which investigate <b style='color: forestgreen;'>frictional forces and molecular interactions</b>.\n\n<h3 style='color: forestgreen;'><b style='color: forestgreen;'>Biofilms and Advanced Imaging Techniques</b></h3>\n\n<b style='color: forestgreen;'>Confocal Microscopy</b> solved the limitations of scattering by employing a confocal setup for better depth resolution, revealing structures like <b style='color: forestgreen;'>biofilms</b> in detail. It aids in studies like drug effect on <b style='color: forestgreen;'>biofilms</b> related to infections and implants. With <b style='color: forestgreen;'>rising demand for compact circuits</b>, the use of microscopes for <b style='color: forestgreen;'>imaging and manipulating molecules</b> anchors the advancement toward <b style='color: forestgreen;'>nanotechnology</b>, where precision control at the molecular level intersects both <b style='color: forestgreen;'>microscopy</b> and <b style='color: forestgreen;'>materials science</b>."
        },
        {
            "title": "Acoustic Microscopy and Ultrasonic Imaging",
            "body": "<b style='color: forestgreen;'>Acoustic Microscopy</b> is a <b style='color: forestgreen;'>technology</b> that uses <b style='color: forestgreen;'>sound waves</b> to produce <b style='color: forestgreen;'>images</b> with <b style='color: forestgreen;'>microscopic resolutions</b>. Initially pioneered by <b style='color: forestgreen;'>Sergei Y. Sokolov</b> in the 1920s, acoustic waves were explored for detecting flaws in metals due to their ability to penetrate <b style='color: forestgreen;'>materials opaque</b> to light. Later advancements allowed these waves to be used in a reflective microscopy setting. Scanning acoustic microscopes (SAMs) have developed to provide <b style='color: forestgreen;'>high-resolution imaging</b> and detect <b style='color: forestgreen;'>internal defects</b> in various materials, including biological tissues and <b style='color: forestgreen;'>opaque materials</b>.\n\nThis <b style='color: forestgreen;'>ultrasonic technique</b> involves sending a <b style='color: forestgreen;'>pulsed sound wave</b> that reflects back, providing details about <b style='color: forestgreen;'>contrast in density</b> changes within the examined materials. Two primary advantages of acoustic microscopy are its ability to examine <b style='color: forestgreen;'>opaque materials</b> and produce contrast based on mechanical properties. Practical uses extend to <b style='color: forestgreen;'>medical imaging</b>, <b style='color: forestgreen;'>non-destructive testing</b>, and <b style='color: forestgreen;'>fetal examinations</b>, showcasing changes in <b style='color: forestgreen;'>tissue density</b> with high contrasts similar to or exceeding those of X-rays.\n\nAs the technology advanced, SAMs evolved from a <b style='color: forestgreen;'>transmission mode</b> to a <b style='color: forestgreen;'>reflection mode</b> focusing on resolving issues of lens alignment. Most modern SAMs use <b style='color: forestgreen;'>surface waves</b> to image features beneath opaque surfaces. These devices have become vital for analyzing <b style='color: forestgreen;'>optically opaque materials</b> and applications like <b style='color: forestgreen;'>quality control</b> in <b style='color: forestgreen;'>integrated circuit manufacture</b>. Acoustic microscopes provide <b style='color: forestgreen;'>non-destructive inspection</b>, examining features such as surface <b style='color: forestgreen;'>cracks</b>, <b style='color: forestgreen;'>defects</b>, and <b style='color: forestgreen;'>boundaries</b>, bridging <b style='color: forestgreen;'>high resolution acoustic</b> methods with conventional testing."
        }
    ]
}