{
    "meta": {
        "title": "Unreasonable Hospitality: The Remarkable Power of Giving People More Than They Expect",
        "author": "Will Guidara",
        "category": "Business/Customer Service",
        "publisher": "Optimism Press, an imprint of Penguin Random House LLC",
        "pages": 288
    },
    "parts": [
        {
            "title": "The Value of Unreasonable Hospitality",
            "body": "<b style='color: forestgreen;'>Simon Sinek</b> highlights our innate need for <b style='color: forestgreen;'>belonging</b> and how <b style='color: forestgreen;'>remote work</b> and <b style='color: forestgreen;'>digital communication</b> have intensified <b style='color: forestgreen;'>loneliness</b> in recent times. He introduces \"<b style='color: forestgreen;'>Unreasonable Hospitality,\"</b> a <b style='color: forestgreen;'>book</b> by <b style='color: forestgreen;'>Will Guidara</b> about transforming <b style='color: forestgreen;'>hospitality</b> into a powerful <b style='color: forestgreen;'>connection tool</b> beyond the restaurant world. <b style='color: forestgreen;'>Guidara</b>'s journey from an average dining spot to the <b style='color: forestgreen;'>best</b> in the world underlines the significance of making people <b style='color: forestgreen;'>feel valued</b>. Sinek encourages every entity, not just <b style='color: forestgreen;'>restaurants,</b> to foster hospitality, aligning <b style='color: forestgreen;'>service experiences</b> with genuine <b style='color: forestgreen;'>human interactions</b>, urging us all to be <b style='color: forestgreen;'>unreasonable</b> in our empathy and <b style='color: forestgreen;'>service.</b>"
        },
        {
            "title": "Magical Hospitality Experience & Importance of Intention",
            "body": "<b style='color: forestgreen;'>Chef Boulud</b> and his team at a <b style='color: forestgreen;'>renowned restaurant</b> transformed a deeply sorrowful evening into a <b style='color: forestgreen;'>memorable experience</b> for the narrator and his father. Despite being one of the <b style='color: forestgreen;'>saddest nights</b> of their lives, the meal provided by Chef Boulud offered an <b style='color: forestgreen;'>oasis of comfort</b> and understanding, underscoring the profound impact that <b style='color: forestgreen;'>hospitality and service</b> can have on people's lives. The <b style='color: forestgreen;'>father and son</b> felt <b style='color: forestgreen;'>comfort and relief</b> during their time of grief, highlighting that working in <b style='color: forestgreen;'>service</b> is noble and has the power to create <b style='color: forestgreen;'>positive, magical moments</b> for people, even during their most difficult times.\n\n<b style='color: forestgreen;'>The narrator</b> reflects on the lessons learned from their father about <b style='color: forestgreen;'>intention</b> and <b style='color: forestgreen;'>responsibility</b>. Growing up, the narrator spent weekends at their father's workplace, learning the importance of <b style='color: forestgreen;'>precision, organization, and setting priorities</b>. Their father was incredibly intentional in everything he did, from business to personal life. The narrator, inspired by their father, plotted their life goals from a young age, ultimately pursuing a career in hospitality. This chapter of the narrator's life, filled with hospitality experiences, <b style='color: forestgreen;'>reinforces</b> the importance of <b style='color: forestgreen;'>intention</b> in every decision, shaping an impactful journey in the <b style='color: forestgreen;'>restaurant industry</b>."
        },
        {
            "title": "Rule of 95/5: Creative Impactful Hospitality",
            "body": "The Rule of <b style='color: forestgreen;'>95/5</b> is all about smartly allocating <b style='color: forestgreen;'>95%</b> of your business expenses rigorously, leaving <b style='color: forestgreen;'>5%</b> for extravagant guest experiences that make a lasting impression. For instance, even a small detail like a uniquely designed spoon in a gelato cart can captivate guests, as seen when the museum director bought gelato for curators who all admired the spoons. This rule became pivotal at <b style='color: forestgreen;'>Eleven Madison Park</b>, where slightly less costly wines were paired with courses, saving budget to eventually surprise guests with a rare, expensive glass. This approach was successful in elevating guest satisfaction and making dining experiences unforgettable.\n\nAdopting the Rule of <b style='color: forestgreen;'>95/5</b> also involved managing staffing costs effectively at the restaurant. Regular staff expenses were controlled, but occasionally a significant amount was spent on team experiences, like a <b style='color: forestgreen;'>team-building retreat</b> or a lavish staff party. These splurges were made possible by saving wisely throughout the year. The <b style='color: forestgreen;'>Unreasonable Hospitality</b> initiative, for example, epitomized this rule when a spontaneous purchase of sleds offered a family a memorable experience in Central Park. This approach, learned from formative experiences, helped cultivate a culture where disciplined spending met creative, impactful guest engagement."
        },
        {
            "title": "Refining Hospitality and Service",
            "body": "The restaurant realized the importance of <b style='color: forestgreen;'>balancing</b> high-end excellence with approachable service. They decided to educate their team in both technical skills and heartfelt <b style='color: forestgreen;'>hospitality</b>. Instead of overloading staff with <b style='color: forestgreen;'>extreme knowledge</b>, they focused on the <b style='color: forestgreen;'>essence</b> of what guests enjoy: great food and genuine connection. By simplifying the wine and food knowledge to what’s truly important, they empowered staff to feel <b style='color: forestgreen;'>confident</b> and provide <b style='color: forestgreen;'>memorable experiences</b>.\n\nThe managers rejected <b style='color: forestgreen;'>overly difficult</b> tests that didn’t serve their purpose and instead focused on letting the staff succeed by mastering <b style='color: forestgreen;'>essentials</b>. Encouraging <b style='color: forestgreen;'>team communication</b> and developing a solid ground allowed them to aspire to become one of New York’s top restaurants. This shift emphasized the philosophy of making things <b style='color: forestgreen;'>fun</b> and <b style='color: forestgreen;'>dynamic</b> without losing sight of the restaurant’s original <b style='color: forestgreen;'>ambitions</b>."
        },
        {
            "title": "Underappreciation of Ancillary Programs and Empowerment at EMP",
            "body": "The chunk highlights the <b style='color: forestgreen;'>underappreciation of coffee, cocktails, and so-called 'ancillary programs'</b> at fine-dining restaurants, traditionally overshadowed by food and wine. It emphasizes the <b style='color: forestgreen;'>progress in beer and cocktail quality</b> outside these restaurants, suggesting that these programs were <b style='color: forestgreen;'>lackluster due to a lack of attention</b>. The text compares the expected <b style='color: forestgreen;'>excellence of wine programs</b> to the <b style='color: forestgreen;'>mediocrity of other beverages</b>, noting that even a <b style='color: forestgreen;'>hole-in-the-wall coffee shop</b> could deliver superior coffee compared to high-end dining venues.\n\nThe author highlights a shift when <b style='color: forestgreen;'>enthusiastic team members were given ownership of beverage programs</b> at EMP. Kirk, a young employee passionate about beer, developed a highly regarded beer program by implementing his passion and learning about stock management and inventory. His dedication sparked enthusiasm among colleagues, and EMP's beer program became <b style='color: forestgreen;'>renowned nationwide</b>. Similarly, other employees transformed the <b style='color: forestgreen;'>tea and cocktail offerings</b>, changing them from an afterthought to remarkable, carefully curated experiences, showcasing the <b style='color: forestgreen;'>positive impact of delegating ownership</b> and responsibility."
        },
        {
            "title": "Balancing Ambitions and Team Harmony",
            "body": "<b style='color: forestgreen;'>Working in a fast-paced restaurant like EMP means balancing</b> endless tasks with <b style='color: forestgreen;'>supporting each other.</b> Friction arises when everyone cares deeply about success but has differing opinions on achieving it. Conflict can threaten collaboration, so adopting practices like <b style='color: forestgreen;'>\"don't go to bed angry\"</b> help resolve issues by addressing them immediately. Sometimes disagreements lead to finding a \"<b style='color: forestgreen;'>third option,</b>\" such as transforming traditional, decorative table chargers into useful items to improve dining experience, showcasing the value of collaboration."
        },
        {
            "title": "Hope and Disappointment in the Michelin Guide",
            "body": "<b style='color: forestgreen;'>In</b> <b style='color: forestgreen;'>2008</b>, with a <b style='color: forestgreen;'>buzz</b> surrounding Eleven Madison Park, the restaurant anticipated being included in the Michelin Guide due to its achievements. However, when the list was released, the <b style='color: forestgreen;'>team was crushed</b> as they were not included, meaning an inclusion was at least one year away and three years before possibly achieving the <b style='color: forestgreen;'>coveted third star</b>.\n\nThe disappointment was hard for the team, but the owner encouraged them to channel their frustrations into improvement, playing offense as the best strategy. <b style='color: forestgreen;'>However</b>, the <b style='color: forestgreen;'>economy</b> took a downturn with a global recession impacting business significantly. <b style='color: forestgreen;'>Revenue fell</b>, leading to moves to cut expenses while still preserving the guest experience."
        },
        {
            "title": "Reviving Hotel Cuisine at NoMad",
            "body": "<b style='color: forestgreen;'>The hotel concept at the NoMad was to bring back luxurious hotel restaurants like those run by César Ritz and Auguste Escoffier</b>. The neighborhood of the new site was rundown, which offered the incentive to rejuvenate it. This opportunity allowed the team to manage a new hotel restaurant and was advantageous, as they did not need to invest money they didn’t have. The excitement was met with the challenge of speaking to Danny Meyer, owner of Eleven Madison Park, who initially didn’t see the partnership coexisting with ownership. <b style='color: forestgreen;'>Danny’s real proposal was for them to purchase EMP</b>. This notion, although daunting, was met with determination to figure out the unknown."
        },
        {
            "title": "Building Culture at NoMad",
            "body": "<b style='color: forestgreen;'>Jeff</b> played a crucial role in the <b style='color: forestgreen;'>NoMad</b>'s success, the only major hire <b style='color: forestgreen;'>from outside</b> during my tenure. We invested heavily in <b style='color: forestgreen;'>training</b> before the opening, ensuring the team knew each aspect of the service and the <b style='color: forestgreen;'>company culture</b>. Previous <b style='color: forestgreen;'>EMP members</b> reviewed my speeches to highlight important concepts, fostering our <b style='color: forestgreen;'>core values</b>. Documenting these ideas into a <b style='color: forestgreen;'>book</b> was invaluable, proving every company should delineate their values."
        },
        {
            "title": "Key Industry Insights and Achievements",
            "body": "The excerpt <b style='color: forestgreen;'>focuses</b> on <b style='color: forestgreen;'>Kevin Browne</b> and various <b style='color: forestgreen;'>notable figures</b> in the culinary world such as <b style='color: forestgreen;'>Daniel Boulud</b> and <b style='color: forestgreen;'>David Chapman's</b> interactions, and the significance of <b style='color: forestgreen;'>New York Times</b> reviews. There is mention of <b style='color: forestgreen;'>brainstorming</b> sessions related to <b style='color: forestgreen;'>Dreamweavers</b>, an integral strategic planning method used for <b style='color: forestgreen;'>consistency</b> and <b style='color: forestgreen;'>creativity</b>. The narrative indicates the importance of achieving <b style='color: forestgreen;'>excellence</b> with consultative and <b style='color: forestgreen;'>improvisational hospitality</b> skills. Various industry relationships with <b style='color: forestgreen;'>Paul Bolles-Beaven</b> and <b style='color: forestgreen;'>Richard Coraine</b> at <b style='color: forestgreen;'>top-tier restaurants</b> reinforce the themes of <b style='color: forestgreen;'>collaboration</b> and <b style='color: forestgreen;'>commitment</b>.\n\nThe text details core activities within renowned establishments such as <b style='color: forestgreen;'>Eleven Madison Park</b> and <b style='color: forestgreen;'>Campton Place</b>. Significant attention is given to the <b style='color: forestgreen;'>partnership</b> between <b style='color: forestgreen;'>Floyd Cardoz</b> and <b style='color: forestgreen;'>Barkha Cardoz</b>, illustrating essential elements of <b style='color: forestgreen;'>leadership</b> and <b style='color: forestgreen;'>mentorship</b>. Aspects of <b style='color: forestgreen;'>offensive strategies</b> dealing with challenges are presented, alongside themes like pursuing <b style='color: forestgreen;'>hospitality excellence</b> and <b style='color: forestgreen;'>unreasonable hospitality</b>. The text emphasizes the synergy between <b style='color: forestgreen;'>experiential learning</b> and <b style='color: forestgreen;'>strategic foresight</b>, underscoring the evolving dynamics of the <b style='color: forestgreen;'>service industry</b> for continuous <b style='color: forestgreen;'>innovation</b> and growth."
        }
    ]
}