{
    "meta": {
        "title": "Woke Racism: How a New Religion Has Betrayed Black America",
        "author": "John McWhorter",
        "category": "Non-fiction, Social Commentary",
        "publisher": "Portfolio / Penguin",
        "pages": 206
    },
    "parts": [
        {
            "title": "Preface Overview: A Call to Recognize Harmful Ideologies",
            "body": "The preface of John McWhorter's \"Woke Racism\" defines a new ideology, referred to as a <b style='color: forestgreen;'>religion</b>, that the author argues is harming <b style='color: forestgreen;'>Black America</b> under the guise of antiracism. While traditional <b style='color: forestgreen;'>debate</b> with die-hard believers seems hopeless, McWhorter urges others to recognize the ideology's <b style='color: forestgreen;'>flaws</b>. His work criticizes the <b style='color: forestgreen;'>moral</b> and <b style='color: forestgreen;'>intellectual</b> inconsistencies of this movement, showing how despite its proclaimed intent to be inclusive, it ends up <b style='color: forestgreen;'>damaging</b> the very communities it aims to protect. McWhorter's aim is to foster genuine <b style='color: forestgreen;'>social justice</b> outside these tumultuous ideological shackles and advocate for a more <b style='color: forestgreen;'>practical</b>, liberal alternative."
        },
        {
            "title": "The Elect's New Religious Tenets",
            "body": "<b style='color: forestgreen;'>The Elect</b> believe in fervent <b style='color: forestgreen;'>antiracism</b>, almost like a <b style='color: forestgreen;'>religion</b>, demanding others adhere to their perspective. They see <b style='color: forestgreen;'>white privilege</b> as an inherent issue, akin to <b style='color: forestgreen;'>original sin</b>, urging acknowledgment without offering <b style='color: forestgreen;'>absolution</b>. These ideas permeate <b style='color: forestgreen;'>all ages</b> and <b style='color: forestgreen;'>society levels</b>, making it hard for <b style='color: forestgreen;'>intellectual</b>, <b style='color: forestgreen;'>moral</b>, and <b style='color: forestgreen;'>artistic culture</b> to thrive without fear of being labeled <b style='color: forestgreen;'>racist</b>. Their <b style='color: forestgreen;'>superstition</b> and <b style='color: forestgreen;'>rituals</b> resemble those seen in <b style='color: forestgreen;'>religions</b>, while their <b style='color: forestgreen;'>preachers</b>, like <b style='color: forestgreen;'>DiAngelo and Kendi</b>, perpetuate their beliefs."
        },
        {
            "title": "Religious Nature of Elect Activism",
            "body": "The Elect hold the belief that testifying to one’s <b style='color: forestgreen;'>privilege</b> translates to real-world change, ignoring its abstract nature. At Northwestern Law School, <b style='color: forestgreen;'>professors</b> denounced themselves as racists, regardless of their individual beliefs, similar to confessing <b style='color: forestgreen;'>original sin</b>. This behavior mimics <b style='color: forestgreen;'>Christianity’s</b> concept of original sin, where being born white is akin to having inherent, unearned privilege. Yet, the response of embracing teachings akin to <b style='color: forestgreen;'>religious doctrine</b>—like those of <b style='color: forestgreen;'>DiAngelo</b> and <b style='color: forestgreen;'>Coates</b>—is emphasized, even as privilege doesn’t vanish. <b style='color: forestgreen;'>Elect ideology</b> celebrates writings that criticize white contributions during events like 9/11 with <b style='color: forestgreen;'>mockery</b> rather than seeking <b style='color: forestgreen;'>enlightenment</b> or change. It is a form of <b style='color: forestgreen;'>worship</b>, embracing the self-mortiﬁcation akin to confessing to sin. Ultimately, their activism seems to require maintaining a vision of a world that is always in need of <b style='color: forestgreen;'>moral cleansing</b>."
        },
        {
            "title": "The Rise of Elect Ideology: A New Religion?",
            "body": "<b style='color: forestgreen;'>Elect Ideology</b> appears to blend with religious-like fervor, as shown by instances where <b style='color: forestgreen;'>protests</b> were prioritized over public <b style='color: forestgreen;'>health guidelines</b> in New York, highlighting a divergence from traditional rule adherence. This suggests an overriding belief system that can dismiss scientific fact when in <b style='color: forestgreen;'>conflict</b> with its tenets. Medical professionals, despite facing contradictions, often failed to condemn such actions, reflecting the <b style='color: forestgreen;'>religion-like power</b> of Elect ideology.\n\n<b style='color: forestgreen;'>Social Pressure</b> and <b style='color: forestgreen;'>contradiction</b> are rampant within the movement. Social media and public spheres witness <b style='color: forestgreen;'>hostility</b> to any perceived dissent, as noted when a person was criticized for merely saying they \"agree\" with Black Lives Matter, indicating a <b style='color: forestgreen;'>dogma-like</b> expectation of unwavering support. Moreover, demands in various sectors like <b style='color: forestgreen;'>employment and academia</b>—from changes in protest language to strict social justice adherence—mimic the rigidity usually found in religious movements, showcasing the profound societal impact and reach of these beliefs."
        },
        {
            "title": "Electism as a Modern Religion",
            "body": "Electism, viewed as a <b style='color: forestgreen;'>modern religion</b>, revolves around <b style='color: forestgreen;'>battling power differentials</b>, especially racism, through spreading their views as <b style='color: forestgreen;'>ultimate truth</b>. Critics of this ideology argue that it damages the welfare of black people instead of genuinely helping them overcome their struggles. Key criticisms include ignoring real issues such as <b style='color: forestgreen;'>school violence</b> among black youth and <b style='color: forestgreen;'>misplacing black undergraduates</b> into schools where they fail to thrive."
        },
        {
            "title": "School Discipline and Racial Discrepancies",
            "body": "In 2019, <b style='color: forestgreen;'>Commission on Civil Rights</b> reported that black boys face discrimination in schools, seen as disruptive compared to white kids. However, studies show they commit more violent acts. Overlooking this means hampering black students' education. For instance, <b style='color: forestgreen;'>Philadelphia</b> schools observed 70% violent actions from black or Latino students - consistent with national statistics. Teachers note underreporting and reduced suspensions retained misbehavior. New York City initiatives found reducing black boys' suspensions weakened classroom control. Calls for unfair discipline suggest, detrimentally, that they can't succeed without racism being the sole reason."
        },
        {
            "title": "Cultural Inertia and 'Acting White' Stigma",
            "body": "This passage discusses how societal <b style='color: forestgreen;'>norms</b> and historical factors have influenced perceptions and <b style='color: forestgreen;'>behaviors</b> within black communities beyond mere <b style='color: forestgreen;'>racism</b>. It highlights the <b style='color: forestgreen;'>\"acting white\"</b> stigma that can discourage educational efforts among black students, tracing it back to <b style='color: forestgreen;'>desegregation</b> challenges, rather than just contemporary racism. The piece points out the differences between past and current <b style='color: forestgreen;'>racism</b>, noting how certain cultural <b style='color: forestgreen;'>memes</b> persist even after initial racist triggers have faded. Influential works, like <b style='color: forestgreen;'>Stuart Buck’s \"Acting White\"</b>, are cited to show that these traits often extend beyond their original circumstances, suggesting <b style='color: forestgreen;'>cultural inertia</b>. The text argues that focusing solely on eliminating racism isn't sufficient for overcoming educational challenges, as legacy cultural attitudes also play a role."
        },
        {
            "title": "Dealing with the Elect and Confronting Dogma",
            "body": "This chapter addresses <b style='color: forestgreen;'>dealing with the Elect</b>, an uncompromising group with rigid ideologies. The <b style='color: forestgreen;'>term “Elect”</b> describes those with unyielding beliefs that the solution to social issues is dogma similar to religious fanaticism. Facing them involves two interpretations: working within their presence and finding a way to work around them. The text advises what not to do, emphasizing that <b style='color: forestgreen;'>discussion with the Elect is futile</b> since they pursue conversion, not dialogue. They equate microaggressions with physical assault, holding self-righteous positions regarding race and identity.\n\nThe section challenges <b style='color: forestgreen;'>modern victimhood narratives</b>, asserting that many claims are exaggerated or fabricated by those seeking significance, not truth. McWhorter argues that acknowledging racism is not excusing unchecked claims of victimhood. <b style='color: forestgreen;'>Privileging feelings without logic or evidence cements racism</b> by treating black people as incapable of erring. The solution to Elect-driven ideology requires <b style='color: forestgreen;'>standing up to accusations of racism courageously</b> and not surrendering rational thought to avoid false charges. This call to push back involves calmly rebutting the Elect’s dictate without resorting to violence or fear."
        },
        {
            "title": "Standing Firm Against Shaming Tactics",
            "body": "<b style='color: forestgreen;'>This section emphasizes the need for </b>civil valor<b style='color: forestgreen;'> in confronting the Elect's ideology. It's compared to the bravery in war, urging society to resist </b>baseless accusations<b style='color: forestgreen;'> and </b>shaming<b style='color: forestgreen;'> that aim to control. The text encourages individuals to remain </b>steadfast<b style='color: forestgreen;'> against being labeled as racists, advocating for reason over fear.</b> The narrative suggests that both historic figures like <b style='color: forestgreen;'>Solzhenitsyn</b> and various contemporary examples demonstrate surviving and thriving despite social media lynch mobs. The author argues that many survive by saying <b style='color: forestgreen;'>NO</b>, standing up against pressure, implying it's not a moral failing.**"
        }
    ]
}