{
    "meta": {
        "title": "Writing a Proposal for Your Dissertation: Guidelines and Examples",
        "author": "Steven R. Terrell",
        "category": "Academic Writing/Research Guide",
        "publisher": "The Guilford Press",
        "pages": 298
    },
    "parts": [
        {
            "title": "Mastering the Dissertation Proposal",
            "body": "Writing a dissertation <b style='color: forestgreen;'>proposal</b> is tough, and it's the starting point of your doctoral <b style='color: forestgreen;'>journey</b>—crucial for <b style='color: forestgreen;'>success</b> but where many students stall. This book emphasizes proposal writing, which consists of defining a clear <b style='color: forestgreen;'>research problem</b>, stating its <b style='color: forestgreen;'>purpose</b>, asking relevant <b style='color: forestgreen;'>questions</b>, and laying out a <b style='color: forestgreen;'>detailed plan</b> for your study. You'll find support for finding and developing your problem statement, reviewing <b style='color: forestgreen;'>literature</b>, and choosing between <b style='color: forestgreen;'>quantitative</b> and <b style='color: forestgreen;'>qualitative</b> research methods. A strong proposal is critical as half of students don't graduate because they can't clarify what they want to research. If you're struggling to start, it's likely because the \"problem is the problem\" – meaning students struggle to focus their research into a precise problem statement."
        },
        {
            "title": "Crafting a Strong Problem Statement",
            "body": "This text discusses <b style='color: forestgreen;'>writing problem statements</b> for research proposals. To formulate a <b style='color: forestgreen;'>good problem statement</b>, it should have the following characteristics: it must be <b style='color: forestgreen;'>clear and concise</b>, include all <b style='color: forestgreen;'>variables</b> considered, and omit any <b style='color: forestgreen;'>researcher bias</b>. For instance, a problem statement can focus on the <b style='color: forestgreen;'>high failure rate</b> of algebra students at a specific institution, providing <b style='color: forestgreen;'>background</b> and <b style='color: forestgreen;'>significance</b> supported by <b style='color: forestgreen;'>literature</b>, to justify its investigation.\n\n<b style='color: forestgreen;'>Attributes of a good problem statement</b> include its relevance to the <b style='color: forestgreen;'>researcher</b>, a <b style='color: forestgreen;'>manageable scope</b>, the <b style='color: forestgreen;'>researcher's preparedness</b> with knowledge and resources, the feasibility to <b style='color: forestgreen;'>collect and analyze data</b>, <b style='color: forestgreen;'>practical or theoretical significance</b>, and adherence to <b style='color: forestgreen;'>ethical standards</b>. Following these criteria ensures the study's <b style='color: forestgreen;'>viability</b>. Ultimately, a well-crafted problem statement acts as a <b style='color: forestgreen;'>cornerstone</b> for your proposal, completed with structured purpose, research questions, and hypotheses for validation."
        },
        {
            "title": "Reflections on Mixed Methodologies and Adapting to Unsuccessful Research Outcomes",
            "body": "This section illustrates a professor's research journey related to <b style='color: forestgreen;'>mixed methodologies</b> and tackling a failed <b style='color: forestgreen;'>intervention study</b>. \nIn <b style='color: forestgreen;'>mixed methods research</b>, both <b style='color: forestgreen;'>quantitative</b> and <b style='color: forestgreen;'>qualitative</b> approaches are merged to deeply understand a research question. For instance, quantitative data might imply one thing, but qualitative interviews can explain unexpected results. Here, it’s crucial to examine \n\n<b style='color: forestgreen;'>what happens when a research plan fails</b> - it's part of research reality. A failed hypothesis doesn’t necessarily mean failure—it shows what doesn’t work and paves the way for future studies. The core lesson is designing a <b style='color: forestgreen;'>good study</b> by strictly following a well-crafted proposal, regardless of outcome.\n\nWhen developing your research questions, integrate them with problem and purpose statements, ensuring coherence. Observing how a researcher adjusted their approach and learned from an unplanned outcome emphasizes adaptability in valid research design."
        },
        {
            "title": "Chapter 3 Proposal: Research Methodology Basics",
            "body": "Chapter 3 of your proposal is crucial as it details the <b style='color: forestgreen;'>research method</b> that drives your dissertation. There are different types of research methods, like <b style='color: forestgreen;'>quantitative</b>, <b style='color: forestgreen;'>qualitative</b>, or <b style='color: forestgreen;'>mixed methods</b>, each with distinct philosophies and procedures. To choose the right method, understand <b style='color: forestgreen;'>research paradigms</b>—the philosophical lens guiding your study. Components of these paradigms include <b style='color: forestgreen;'>axiology</b> (beliefs about ethics), <b style='color: forestgreen;'>ontology</b> (beliefs about reality), <b style='color: forestgreen;'>epistemology</b> (researcher’s role), and <b style='color: forestgreen;'>methodology</b> (approach to research questions). Scientists must define their paradigm as quantitative researchers aim for <b style='color: forestgreen;'>objectivity</b> and qualitative researchers seek <b style='color: forestgreen;'>meaning</b> through close participant interaction.\n\nAn important step in Chapter 3 is identifying your study's <b style='color: forestgreen;'>population</b> and establishing a <b style='color: forestgreen;'>sample</b> using either <b style='color: forestgreen;'>random</b> (probabilistic) or <b style='color: forestgreen;'>nonrandom</b> (nonprobabilistic) methods. \n\nQuantitative methods usually employ random sampling for <b style='color: forestgreen;'>generalizability</b>, ensuring that the sample represents the whole <b style='color: forestgreen;'>population</b> accurately, thus avoiding <b style='color: forestgreen;'>sampling bias</b> and <b style='color: forestgreen;'>sampling error</b>. Techniques such as <b style='color: forestgreen;'>stratified</b>, <b style='color: forestgreen;'>cluster</b>, and <b style='color: forestgreen;'>systematic sampling</b> help achieve this representativeness. A small demonstration using a hypothetical group illustrated how sampling errors could occur when selecting samples from a population, emphasizing the importance of strategic sampling techniques."
        },
        {
            "title": "Sampling Methods in Research",
            "body": "When conducting <b style='color: forestgreen;'>research</b>, it’s essential to understand the concepts of <b style='color: forestgreen;'>random</b> and <b style='color: forestgreen;'>nonrandom sampling</b>.\n\n1. <b style='color: forestgreen;'>Simple Random Sampling</b> gives everyone in the population an equal chance to be selected, reducing <b style='color: forestgreen;'>sampling bias</b>. This is useful when polling voters, where demographics like <b style='color: forestgreen;'>political party</b> should be reflected in the sample.\n\n2. Careful <b style='color: forestgreen;'>caveats</b> include ensuring a <b style='color: forestgreen;'>large sample size</b> to reduce <b style='color: forestgreen;'>sampling error</b>, and ensuring every population member has an equal chance of selection, crucial in <b style='color: forestgreen;'>probabilistic sampling</b>.\n\n3. <b style='color: forestgreen;'>Cluster Sampling</b> involves selecting whole groups and is used when true random sampling isn’t feasible. This may introduce bias if groups vary greatly.\n\nThe goal in sampling is to reflect the population while mitigating biases, critical for ethical and accurate research outcomes."
        },
        {
            "title": "Types of Quantitative Data",
            "body": "We delve into different types of numeric <b style='color: forestgreen;'>data</b> in quantitative research, which affects the <b style='color: forestgreen;'>study design</b> and analysis. The four types are: <b style='color: forestgreen;'>nominal data</b>, like gender or ethnicity, which are simple category counts; <b style='color: forestgreen;'>ordinal data</b>, such as class rank, which involves <b style='color: forestgreen;'>ranking</b> but not equal increments; <b style='color: forestgreen;'>interval data</b>, like test scores, where intervals are equal but not necessarily an absolute scale; and <b style='color: forestgreen;'>ratio data</b>, such as weight, where a true <b style='color: forestgreen;'>zero</b> exists and we can compare ratios. Understanding these data types is crucial for researchers to choose the appropriate analysis."
        },
        {
            "title": "Research Design and Validity Control",
            "body": "This section delves further into <b style='color: forestgreen;'>quantitative research designs</b>, emphasizing their various forms and how each can control or fail to control <b style='color: forestgreen;'>threats to validity</b>. It introduces <b style='color: forestgreen;'>experimental designs</b> classified as <b style='color: forestgreen;'>pre-experimental</b>, <b style='color: forestgreen;'>quasi-experimental</b>, and <b style='color: forestgreen;'>true experimental designs</b>. Each design varies in terms of control, with <b style='color: forestgreen;'>true experiments</b> offering the highest level of reliability due to random assignment of subjects to groups. This allows hypotheses testing and definite conclusions about causal relationships. <b style='color: forestgreen;'>Pre-experimental designs</b> are noted for their lower control and are often used to explore ideas.\n\n<b style='color: forestgreen;'>Pre-experimental designs</b> are explained with examples such as the <b style='color: forestgreen;'>One-Shot Case Study</b> and <b style='color: forestgreen;'>One-Group Pretest-Posttest Design</b>, each demonstrating differences in group setup and measurement points. A <b style='color: forestgreen;'>static group comparison</b> is highlighted as two groups are only measured after the treatment, lacking pretest data, thus not controlling for many validity threats. For more robust research, <b style='color: forestgreen;'>quasi-experimental designs</b> like <b style='color: forestgreen;'>nonequivalent control group design</b> offer improved internal validity by utilizing pre-existing groups with treatment assignments, mitigating some validity threats. Meanwhile, <b style='color: forestgreen;'>time-series designs</b> analyze data over time, showing changes post-intervention."
        },
        {
            "title": "Qualitative Research Methods",
            "body": "<b style='color: forestgreen;'>Chapter 6</b> delves into <b style='color: forestgreen;'>Qualitative Research Methods</b>, which differ from <b style='color: forestgreen;'>Quantitative Methods</b> by focusing on understanding the \"<b style='color: forestgreen;'>who?</b>\", \"<b style='color: forestgreen;'>what?</b>\", \"<b style='color: forestgreen;'>when?</b>\", \"<b style='color: forestgreen;'>where?</b>\", and <b style='color: forestgreen;'>\"why?\"</b> questions. Unlike quantitative research that uses numbers to define events, qualitative research gathers text-based data to explore social life through <b style='color: forestgreen;'>Exploratory, Descriptive,</b> and <b style='color: forestgreen;'>Explanatory</b> research. There are six common methodologies: <b style='color: forestgreen;'>Narrative, Phenomenological, Ethnographic, Case Studies, Grounded Theory,</b> and <b style='color: forestgreen;'>Content Analysis</b> research, each providing unique insights into human experiences."
        },
        {
            "title": "Qualitative Data Analysis and Credibility",
            "body": "<b style='color: forestgreen;'>Analyzing qualitative data</b> involves finding <b style='color: forestgreen;'>patterns</b>, <b style='color: forestgreen;'>concepts</b>, and <b style='color: forestgreen;'>relationships</b> to answer research questions. Unlike quantitative research, there is no <b style='color: forestgreen;'>standard method</b> for analysis. Key aspects include <b style='color: forestgreen;'>reliability</b>, focusing on <b style='color: forestgreen;'>data process dependability</b> - such as consistent interview guidelines and procedure. It's essential to ensure interview transcriptions are accurate, often by checking recordings while reviewing transcripts. This <b style='color: forestgreen;'>familiarization</b> with data is crucial before starting analysis.\n\n<b style='color: forestgreen;'>Qualitative analysis</b> may begin alongside data collection, adjusting interviews and literature reviews as needed. Although no single \"best way\" exists, common approaches include <b style='color: forestgreen;'>narrative analysis</b>—identifying themes in stories; <b style='color: forestgreen;'>phenomenological analysis</b>—understanding experience essence; and <b style='color: forestgreen;'>ethnographic analysis</b>—triangulating data from an insider's perspective. <b style='color: forestgreen;'>Grounded theory</b> involves open coding, axial coding, and developing theories based on data. While these methodologies involve flexibility, <b style='color: forestgreen;'>credibility</b> and <b style='color: forestgreen;'>trustworthiness</b> remain central to a robust qualitative study."
        },
        {
            "title": "Participants and Research Procedures",
            "body": "<b style='color: forestgreen;'>Participants</b> for the research will be females living in NYC homeless shelters. A <b style='color: forestgreen;'>purposive sample</b> of 12-15 will be identified for <b style='color: forestgreen;'>interviews</b> after obtaining institutional approval. The interviews focus on circumstances leading to the shelter stay. Before this, the researcher will <b style='color: forestgreen;'>study homelessness literature</b> in the US. Participants will sign a <b style='color: forestgreen;'>consent form</b> assuring anonymity, volunteer participation, and no interference with their <b style='color: forestgreen;'>government services</b>. The results are to develop a <b style='color: forestgreen;'>theory</b> on homelessness among women."
        },
        {
            "title": "Summary of Presentation and Attrition Studies",
            "body": "The <b style='color: forestgreen;'>first section</b> outlined the <b style='color: forestgreen;'>plan for presenting results</b>, which will be shared in <b style='color: forestgreen;'>Chapters 4 and 5</b> of a <b style='color: forestgreen;'>dissertation report</b> and given to the tutoring service owners. The <b style='color: forestgreen;'>quantitative and qualitative data</b> will help produce a report to assess the tutors' effectiveness.\n\nIn the <b style='color: forestgreen;'>second section</b>, we learned about a study regarding <b style='color: forestgreen;'>military academy attrition</b>. It aims to create a <b style='color: forestgreen;'>screening tool</b> to improve <b style='color: forestgreen;'>admissions</b> by studying factors leading to students leaving the academy. Qualitative and <b style='color: forestgreen;'>quantitative data</b> will be collected and analyzed to align identified factors."
        },
        {
            "title": "Research Methodologies Overview",
            "body": "The text discusses different types of research methodologies, with a focus on qualitative, quantitative, and mixed methods approaches. For <b style='color: forestgreen;'>qualitative research</b>, <b style='color: forestgreen;'>validity</b> involves ensuring data collection is consistent. <b style='color: forestgreen;'>Triangulation</b> and <b style='color: forestgreen;'>member checking</b> are strategies used for maintaining validity. <b style='color: forestgreen;'>Mixed methods research</b> involves combining qualitative and quantitative data to explore a research question more comprehensively. This approach often requires merging data sets and analyzing them together to provide insights. The design for mixed methods could be <b style='color: forestgreen;'>sequential-exploratory</b>, where qualitative data is gathered first or <b style='color: forestgreen;'>concurrent</b>, where data is collected simultaneously. Understanding both <b style='color: forestgreen;'>sampling methods</b> and <b style='color: forestgreen;'>research design</b> helps guide the study."
        }
    ]
}