{
    "meta": {
        "title": "100 Days of Growth",
        "author": "Sujan Patel & Rob Wormley",
        "category": "Business/Startup Growth",
        "publisher": "UNKNOWN",
        "pages": 105
    },
    "parts": [
        {
            "title": "Growth Strategies for Startups - Initial Tactics and Their Implementation",
            "body": "In the book \"100 Days of Growth,\" the authors discuss various marketing strategies to help startups grow. They highlight tactics like giving away <b style='color: forestgreen;'>free company t-shirts</b> to enhance brand awareness and customer loyalty. Another strategy is sending a <b style='color: forestgreen;'>personalized welcome email</b> to new customers, offering a friendly digital \"hi,\" much like a mom-and-pop shop's welcome. The authors also suggest the <b style='color: forestgreen;'>VIP Beta Launch</b>, enticing prospects with exclusive access, and using <b style='color: forestgreen;'>Help A Reporter Out (HARO)</b> for free publicity. Crafting an <b style='color: forestgreen;'>education-focused email series</b> demonstrates your willingness to help potential customers and communicate value through a <b style='color: forestgreen;'>promise-oriented headline</b> on your site, catching visitors' interest in mere seconds."
        },
        {
            "title": "Building Credibility with Weekly Roundups",
            "body": "<b style='color: forestgreen;'>Blog regularly</b> for <b style='color: forestgreen;'>business credibility</b>. Use <b style='color: forestgreen;'>Weekly Roundup posts</b> to build your reputation by sharing industry content and prove you have the right ideas and solutions. <b style='color: forestgreen;'>Curate and share</b> quality posts from others to <b style='color: forestgreen;'>boost your standing</b> in your sector."
        },
        {
            "title": "Reactivating Inactive Users",
            "body": "The <b style='color: forestgreen;'>Inactive Users Email</b> strategy is useful for getting users who signed up for your service but forgot about it to interact with your product again. Many <b style='color: forestgreen;'>SaaS or app companies</b> face the issue of <b style='color: forestgreen;'>inactive users</b>, and a direct way to engage them is through <b style='color: forestgreen;'>engagement-driven emails</b>. These emails serve to remind users of your service and motivate them to come back, thus potentially increasing <b style='color: forestgreen;'>app usage</b> and <b style='color: forestgreen;'>customer retention</b>.\n\nTo implement this, you need to <b style='color: forestgreen;'>track user behavior</b> and use tools that allow you to <b style='color: forestgreen;'>send automated emails</b> to inactive users. First, <b style='color: forestgreen;'>sign up for an automation tool</b> to help manage these emails. Consider what kind of <b style='color: forestgreen;'>messages</b> would re-engage users, and set up email campaigns that automatically trigger based on user inactivity. Doing this can help in <b style='color: forestgreen;'>reactivating forgotten users</b> who might become valuable customers again."
        },
        {
            "title": "Boost Engagement with User-Generated Content",
            "body": "<b style='color: forestgreen;'>User-generated content</b> is a great way to boost <b style='color: forestgreen;'>engagement</b> and <b style='color: forestgreen;'>reach</b> new audiences, especially on <b style='color: forestgreen;'>social media</b> like Facebook and Twitter. This strategy involves <b style='color: forestgreen;'>content produced</b> by your <b style='color: forestgreen;'>followers</b>, which also helps <b style='color: forestgreen;'>illustrate brand loyalty</b>. Some companies run these campaigns for <b style='color: forestgreen;'>three main reasons</b>: strengthening <b style='color: forestgreen;'>brand reputation</b>, leveraging <b style='color: forestgreen;'>user experiences</b>, and requiring <b style='color: forestgreen;'>minimal ongoing management</b> after setup.\n\nTo implement a <b style='color: forestgreen;'>User-Generated Content (UGC) campaign</b>, start by deciding on a <b style='color: forestgreen;'>concept</b> that focuses on your products and target <b style='color: forestgreen;'>customers</b>. Look at <b style='color: forestgreen;'>successful examples</b> like <b style='color: forestgreen;'>Warby Parker</b> or <b style='color: forestgreen;'>Starbucks</b> for inspiration. Once planned, spread the <b style='color: forestgreen;'>word</b> about your campaign and encourage <b style='color: forestgreen;'>loyal customers</b> to participate, which will help stimulate the campaign's <b style='color: forestgreen;'>momentum</b>."
        },
        {
            "title": "The Win-Back Email Strategy",
            "body": "## The Win-Back Email\n\nThe <b style='color: forestgreen;'>Win-Back Email</b> is a strategy to re-engage former customers who have stopped buying from you. <b style='color: forestgreen;'>Smart business owners</b> see the value in connecting with these past customers, realizing it's often easier to sell to people familiar with their brand. <b style='color: forestgreen;'>Win-Back Emails</b> showcase new features, offer special deals, and include strong <b style='color: forestgreen;'>CTAs</b> to persuade them to return.\n\n<b style='color: forestgreen;'>Step 1:</b> Identify past customers who left 60-120 days ago. <b style='color: forestgreen;'>Step 2:</b> Craft a <b style='color: forestgreen;'>persuasive email</b> emphasizing new features and offers. <b style='color: forestgreen;'>Step 3:</b> Send the email, analyze results, and adjust as needed. <b style='color: forestgreen;'>Tools</b> like VERO and Customer.io can automate the process, helping you win back these valuable contacts."
        }
    ]
}