{
    "meta": {
        "title": "Balinese Textiles: A Journey Through Tradition and Artistry",
        "author": "Sylvia Fraser-Lu",
        "category": "Art & Photography, Cultural Studies",
        "publisher": "Halaman Publishing",
        "pages": 160
    },
    "parts": [
        {
            "title": "Bali Textiles: A Cultural Tapestry",
            "body": "<b style='color: forestgreen;'>Bali Textiles</b>: This book focuses on the <b style='color: forestgreen;'>rich cultural tapestry</b> represented by textiles in Bali, exploring their <b style='color: forestgreen;'>manufacture</b>, <b style='color: forestgreen;'>use</b>, and <b style='color: forestgreen;'>significance</b>. The authors were inspired by the <b style='color: forestgreen;'>living qualities</b> these fabrics adopt, extending beyond their material form, to embody cultural meanings. An <b style='color: forestgreen;'>important collection</b> at the <b style='color: forestgreen;'>Basel Museum of Ethnography</b> serves as the foundation of this work, showcasing a wide range of textiles rather than just seeking antiquity or aesthetics. The authors draw upon their <b style='color: forestgreen;'>extensive research</b>, demonstrating textiles as a <b style='color: forestgreen;'>cultural language</b> highlighting their <b style='color: forestgreen;'>socio-semiotic</b> significance in Balinese <b style='color: forestgreen;'>rituals</b> and <b style='color: forestgreen;'>daily life</b>. This work aims to both document and preserve this intensive craft amid pressure from modern commercial influences, while celebrating Bali's ability to blend tradition with <b style='color: forestgreen;'>innovative creativity</b>."
        },
        {
            "title": "Bali's Textile Traditions in Cultural Context",
            "body": "<b style='color: forestgreen;'>Summary of the Textile Text</b>\n\nBali's <b style='color: forestgreen;'>textile</b> tradition is deeply intertwined with its <b style='color: forestgreen;'>culture</b> and <b style='color: forestgreen;'>history</b>. From ancient times, cloth-making adapted as <b style='color: forestgreen;'>tourism</b> reshaped the island. Certain textiles like <b style='color: forestgreen;'>double ikat</b> had <b style='color: forestgreen;'>complicated techniques</b> and were historically rooted in <b style='color: forestgreen;'>Bali's culture</b> and at times influenced by <b style='color: forestgreen;'>China</b> and <b style='color: forestgreen;'>India</b>. Despite these influences, Balinese textiles evolved <b style='color: forestgreen;'>independently</b>, reflecting a rich <b style='color: forestgreen;'>diversity</b> and <b style='color: forestgreen;'>creativity</b> that depicts Bali's unique priorities. <b style='color: forestgreen;'>Textiles</b> aren't just for <b style='color: forestgreen;'>decoration</b>; they hold specific <b style='color: forestgreen;'>functions</b> and <b style='color: forestgreen;'>meanings</b> in Balinese society. \n\nThe <b style='color: forestgreen;'>Purana Bali</b> text suggests inhabitants initially didn't know rice cultivation or metalworking, highlighting historical transitions, such as using <b style='color: forestgreen;'>bark cloth</b> for attire before acquiring <b style='color: forestgreen;'>cotton</b> knowledge. The <b style='color: forestgreen;'>gods</b> introduced weaving and dyeing techniques, making <b style='color: forestgreen;'>textiles</b> bearers of <b style='color: forestgreen;'>religious and social significance</b>. <b style='color: forestgreen;'>Textile lamak</b>, for instance, serves a specific ceremonial role, particularly on <b style='color: forestgreen;'>temple festivals</b>, showing the deeply <b style='color: forestgreen;'>spiritual connection</b> Balinese society holds with <b style='color: forestgreen;'>textiles</b>."
        },
        {
            "title": "Songket Weaving Techniques",
            "body": "In a <b style='color: forestgreen;'>Backstrap Loom</b>, the warp is stretched between a warp beam and the breast-cum-cloth beam, with the weaver controlling the tension by leaning forward or backward. This \nmethod requires great <b style='color: forestgreen;'>skill and strength</b>. Various elements like the *bamboo reed* for spacing and beating the *sword stick* for extending sheds are crucial. The songket process is unique due to the inclusion of \"nuduk,\" a specialized task that very few can perform, typically done by <b style='color: forestgreen;'>Brahman women</b> and skilled weavers. Typically, the costly <b style='color: forestgreen;'>nuduk stage</b> is poorly compensated despite the vital role it plays in pattern programming."
        },
        {
            "title": "Ritual Textiles - Bebali Overview",
            "body": "<b style='color: forestgreen;'>Bebali</b>: <b style='color: forestgreen;'>Ritual Textiles</b>\n\nIn Balinese culture, <b style='color: forestgreen;'>bebali cloths</b> have significant ceremonial importance, often used in <b style='color: forestgreen;'>rites of passage</b>. These <b style='color: forestgreen;'>sacred textiles</b> are worn or used in rituals for <b style='color: forestgreen;'>transitional life phases</b> such as <b style='color: forestgreen;'>birth</b> and <b style='color: forestgreen;'>death services</b>. At the <b style='color: forestgreen;'>Badung market</b> in Bali's capital, <b style='color: forestgreen;'>Denpasar</b>, one can find a variety of these <b style='color: forestgreen;'>ritual accessories</b> including <b style='color: forestgreen;'>wangsul</b> and other <b style='color: forestgreen;'>sacred fabrics</b> distinct to the <b style='color: forestgreen;'>Balinese tradition</b>. Depending on the <b style='color: forestgreen;'>colors and patterns</b>, these cloths serve various ceremonial roles, including adorning <b style='color: forestgreen;'>temple guardians</b> or dressing <b style='color: forestgreen;'>statues</b> for offerings. They are particularly important for <b style='color: forestgreen;'>high-caste families</b> who monopolize their production and have the longstanding <b style='color: forestgreen;'>knowledge</b> of their ritual application."
        },
        {
            "title": "210-Day Birthday Ritual Using Sacred Cloths",
            "body": "<b style='color: forestgreen;'>Chapter 5</b> details a ritual involving <b style='color: forestgreen;'>children's transition</b> to earthliness after 210 days. In this <b style='color: forestgreen;'>purification ceremony</b>, a <b style='color: forestgreen;'>Brahman priest</b> purifies a child, previously manifested as divine, now making contact with the earth through a ritual. <b style='color: forestgreen;'>Sacred cloths</b>, <b style='color: forestgreen;'>wangsul</b>, and <b style='color: forestgreen;'>bebali</b> are essential. The <b style='color: forestgreen;'>child is replaced</b> during a ritual by a <b style='color: forestgreen;'>pumpkin, banana blossom</b>, or <b style='color: forestgreen;'>cucumber</b> as a changeling surrounded by sacred objects to <b style='color: forestgreen;'>banish evil forces</b>. Holy water is involved in purifying these changeling objects, including rice as symbols of well-being. The real child subsequently undergoes a similar ritual involving a bebali cloth, signifying its new stage of life.\n\nAdditionally, the <b style='color: forestgreen;'>changeling ritual</b> involves a procession with sacred items, and once completed, the purified changeling, clothed in special fabrics—often of <b style='color: forestgreen;'>asymmetrical stripes</b>, is honored similarly to the child. This symbolizes the <b style='color: forestgreen;'>dual principles</b> in Balinese thought where growth comes from asymmetrically but complementarily aligned forces. Finally, after dispelling negativity with the changeling, the real child is ritually cleaned and dressed in bebali cloth before the priest and deity, marking this passage with a symbolic hair-cutting and water ceremony, representing a cleansing from life's impurities and misguidances."
        },
        {
            "title": "Poleng: Symbolism and Ritual Use",
            "body": "<b style='color: forestgreen;'>Poleng</b> has a <b style='color: forestgreen;'>significant role</b> in <b style='color: forestgreen;'>Balinese rituals and traditions</b>. These black-and-white checked cloths are used as <b style='color: forestgreen;'>badges for humans</b>, especially in sacred dances like <b style='color: forestgreen;'>baris</b>, where they signify the <b style='color: forestgreen;'>dual nature</b> and <b style='color: forestgreen;'>guardian</b> functions. Men wear <b style='color: forestgreen;'>poleng</b> during ceremonies, serving both as a <b style='color: forestgreen;'>protective garment</b> and a fashion choice. However, <b style='color: forestgreen;'>poleng</b> isn't used for all clothing types; it's mainly <b style='color: forestgreen;'>worn</b> as a <b style='color: forestgreen;'>kampuk</b> or <b style='color: forestgreen;'>sash</b> for men and <b style='color: forestgreen;'>sashes</b> for women. The use of poleng shows the <b style='color: forestgreen;'>wearer's role</b> as a <b style='color: forestgreen;'>human representative</b> for netherworld deities.\n\nPoleng represents the <b style='color: forestgreen;'>Balinese concept of dualism</b>, known as <b style='color: forestgreen;'>ruwa bhineda</b>, embodying the opposing yet interconnected forces like <b style='color: forestgreen;'>light and dark</b>, <b style='color: forestgreen;'>good and bad</b>. Balinese see poleng as more than just a pattern—it symbolizes the <b style='color: forestgreen;'>balance</b>, illustrating how white (<b style='color: forestgreen;'>divine, pure</b>) contrasts and complements black (<b style='color: forestgreen;'>demonic, dark</b>). These cloths are essential in warrior rituals and protective roles, enhancing one's connection to <b style='color: forestgreen;'>spiritual and physical balance</b> in Balinese culture."
        },
        {
            "title": "Geringsing: Sacred Fabrics of Tenganan",
            "body": "<b style='color: forestgreen;'>Geringsing</b> refers to magical <b style='color: forestgreen;'>fabrics</b> from Tenganan Pegeringsingan in Bali, made using the <b style='color: forestgreen;'>double ikat</b> method. They are important to the <b style='color: forestgreen;'>ritualistic</b> society, where <b style='color: forestgreen;'>Indra</b> is celebrated as both the creator and designer of these fabrics. The creation process involves <b style='color: forestgreen;'>resist patterns</b> applied to both warp and weft threads before weaving. The textiles symbolize <b style='color: forestgreen;'>purity</b> and identity within the community, acting as <b style='color: forestgreen;'>protective</b> garments during rituals. Their <b style='color: forestgreen;'>designs</b> often include red, brown, blue, and black-violet with <b style='color: forestgreen;'>structural patterns</b>, reflecting ancient <b style='color: forestgreen;'>narratives</b> and <b style='color: forestgreen;'>geometric motifs</b>.\n\n<b style='color: forestgreen;'>Nieuwenkamp</b>, a Dutch explorer, was among the first to discover these <b style='color: forestgreen;'>cloths</b>. He noted their <b style='color: forestgreen;'>complex technique</b> and <b style='color: forestgreen;'>ancestral patterns</b>. Tourist exposure has increased but <b style='color: forestgreen;'>Tenganan's</b> society remains dedicated to preserving its <b style='color: forestgreen;'>ritual traditions</b>. These fabrics reflect a <b style='color: forestgreen;'>universal aesthetic appeal</b> and are worn for <b style='color: forestgreen;'>celebrations</b> and <b style='color: forestgreen;'>community rituals</b>. Different geringsing cloths serve distinct purposes like <b style='color: forestgreen;'>breast cloths</b>, <b style='color: forestgreen;'>sashes</b>, or outer garments, embodying both <b style='color: forestgreen;'>artistic merit</b> and <b style='color: forestgreen;'>spiritual importance</b>."
        }
    ]
}