{
    "meta": {
        "title": "Code as Creative Medium",
        "author": "Golan Levin and Tega Brain",
        "category": "Computational Art and Design",
        "publisher": "The MIT Press",
        "pages": 289
    },
    "parts": [
        {
            "title": "Summary of the Introduction",
            "body": "<b style='color: forestgreen;'>Code as Creative Medium</b>, written by Golan Levin and Tega Brain, acts as a comprehensive guide for artists, designers, programmers, and educators interested in \nincorporating coding into artistic and design projects. With a <b style='color: forestgreen;'>focus</b> on combining <b style='color: forestgreen;'>art</b> and <b style='color: forestgreen;'>technology</b>, this handbook addresses a gap in traditional coding education by emphasizing the \"why\" behind coding, dedicating itself to <b style='color: forestgreen;'>creative exploration</b> rather than merely the technical \"how.\" It provides <b style='color: forestgreen;'>assignments</b> and <b style='color: forestgreen;'>exercises</b> that can adapt to diverse learning styles and encourages innovation and thoughtfulness. The narrative also underscores the importance of <b style='color: forestgreen;'>cultural impact</b> and <b style='color: forestgreen;'>diversity</b> in creative coding. By drawing on decades of experience and a global community, the book offers a <b style='color: forestgreen;'>unique approach</b> to teaching and <b style='color: forestgreen;'>rethinking</b> the use of computational tools in a creative context."
        },
        {
            "title": "Code as Creative Medium Overview",
            "body": "<b style='color: forestgreen;'>Code as Creative Medium</b> is a book designed to explore the intersection of coding and creativity. Even though it doesn't contain direct code samples, it offers <b style='color: forestgreen;'>assignments</b> aimed at integrating art and software while ensuring these tasks remain applicable across evolving technologies. The <b style='color: forestgreen;'>online repository</b> complements the book by providing code to support learning. The book suggests that these assignments can be used in varied educational contexts—from a <b style='color: forestgreen;'>kitchen table</b> to *university*. Its goal is to enrich one’s experience between art and coding, offering <b style='color: forestgreen;'>lifelong learning</b> opportunities regardless of the platform used. \n\nThis approach ensures the <b style='color: forestgreen;'>relevance</b> of these exercises by no longer tying them to a specific programming language. The book beckons its audience to adapt and extend examples, promoting <b style='color: forestgreen;'>interactive learning</b>. Its mission is to stimulate creativity within computational art and push the boundaries beyond the established <b style='color: forestgreen;'>STEM fields</b>. By doing so, it hopes readers will explore the potential of <b style='color: forestgreen;'>artistic</b> and <b style='color: forestgreen;'>technical</b> intersections through their unique journey."
        },
        {
            "title": "Drawing Machine",
            "body": "<b style='color: forestgreen;'>Exploring Drawing</b>: Create a <b style='color: forestgreen;'>program</b> that changes how we think about <b style='color: forestgreen;'>drawing</b>. It can be a <b style='color: forestgreen;'>tool, toy, game, or performance instrument</b>. The main aim is to show the unique features of your creation by producing <b style='color: forestgreen;'>three drawings</b> with it. Consider whether your <b style='color: forestgreen;'>system</b> enhances or questions drawing practices.\n\n<b style='color: forestgreen;'>Learning Goals</b>: The task encourages exploring the <b style='color: forestgreen;'>drawing process</b>, evaluating <b style='color: forestgreen;'>creative tools</b>, and working with <b style='color: forestgreen;'>gesture data</b>. You can experiment in various ways, like letting <b style='color: forestgreen;'>drawings come to life</b>, creating a tool used by multiple people, or pushing physical boundaries like drawing without a flat surface. The <b style='color: forestgreen;'>meaning</b> here is to spark creativity beyond standard tools like <b style='color: forestgreen;'>Photoshop</b> or <b style='color: forestgreen;'>Illustrator</b> and to possibly challenge assumptions about drawing. Make your tool expressive rather than just functional."
        },
        {
            "title": "One-Button Game Assignment",
            "body": "The <b style='color: forestgreen;'>One-Button Game</b> assignment aims to push students to conceptualize and execute a game controlled by only one button. The brief encourages exploration of how engaging gameplay can occur despite a simple control mechanism. Students are advised to brainstorm playful, meaningful games that do not require multiple inputs. This exercise serves to foster creativity and innovation by imposing constraints that compel students to rethink traditional game mechanics. \n\nThe <b style='color: forestgreen;'>learning objectives</b> involve understanding and applying fundamentals of game design while focusing on user interaction and experience. Students must consider how to convey richness and variety in gameplay using a limited control scheme. This assignment prompts instructors to let students explore <b style='color: forestgreen;'>variations</b> where they could adapt classic games to a one-button interface or create interactive stories needing minimal input. Overall, the task develops skills in creativity, user engagement, and problem-solving within software constraints."
        },
        {
            "title": "Creating Browser Extensions: Unorthodox Online Interventions",
            "body": "<h3 style='color: forestgreen;'>Summary Title: Creating Browser Extensions: Unorthodox Online Interventions  </h3>\n\n#<h3 style='color: forestgreen;'>Summary Chunk:  </h3>\nA <b style='color: forestgreen;'>browser extension</b> fundamentally changes the way a <b style='color: forestgreen;'>web browser</b> functions or appears, offering a starting point for creative <b style='color: forestgreen;'>online intervention</b>. Extensions can modify webpage appearances, add layers of information, redirect viewers, or engage users with added functionalities. Popular use cases include <b style='color: forestgreen;'>advertisement blocking</b>, identity obscuring, and <b style='color: forestgreen;'>fact-checking</b> utilities. This assigned task involves crafting and <b style='color: forestgreen;'>publishing</b> an extension that creatively alters or enhances one’s internet experience, pushing boundaries of <b style='color: forestgreen;'>poetic or critical</b> web engagement.  \n\nTo develop students' understanding, the task encourages familiarizing first with web page <b style='color: forestgreen;'>structure</b> and browser <b style='color: forestgreen;'>APIs</b>, requiring hands-on experience in modifying websites or experimenting with simple interventions before creating full extensions. Extensions could leverage external <b style='color: forestgreen;'>data sources</b> or provide <b style='color: forestgreen;'>multiuser interactions</b>, requiring <b style='color: forestgreen;'>thorough understanding</b> of web technologies like WebSockets. This project will highlight the browser's role as a mediator between the user and the <b style='color: forestgreen;'>online world</b> and present a chance to creatively <b style='color: forestgreen;'>disrupt</b> or <b style='color: forestgreen;'>augment</b> this relationship for broader cultural or activist objectives. Critics of system norms like software studies scholars inspire such explorations into browser functionality and <b style='color: forestgreen;'>internet experience</b>.  \n\nAs browser extensions can extend cultural impact and raise awareness, they may also face <b style='color: forestgreen;'>restrictions</b> from platforms like the Chrome Web Store, which adhere to their business <b style='color: forestgreen;'>models</b>—particularly those that challenge business interests or established standards."
        },
        {
            "title": "Personal Prosthetic - New Body Verb Exploration",
            "body": "The <b style='color: forestgreen;'>Personal Prosthetic</b> assignment encourages students to design a prosthetic that responds to the wearer's environment or actions, allowing for \"<b style='color: forestgreen;'>a new verb</b> for the body.\" This involves creating a device that can sense inputs like <b style='color: forestgreen;'>movement</b> or <b style='color: forestgreen;'>temperature</b> and respond through actions, possibly using <b style='color: forestgreen;'>machine learning.</b> Consider how the <b style='color: forestgreen;'>location</b> of your project influences its perception and overall <b style='color: forestgreen;'>meaning</b>. This exercise aims to examine the intersection of <b style='color: forestgreen;'>technology</b> and <b style='color: forestgreen;'>the human body</b>, encouraging students to think of prosthetics as extensions that <b style='color: forestgreen;'>augment</b>, <b style='color: forestgreen;'>replace</b>, or <b style='color: forestgreen;'>signal</b> human capabilities. \n\nIn making it meaningful, the assignment urges students to see prosthetics not just as tools for restoring normality but as opportunities to redefine <b style='color: forestgreen;'>identity</b> and <b style='color: forestgreen;'>ability.</b> Students can explore concepts of <b style='color: forestgreen;'>costumes</b>, <b style='color: forestgreen;'>performance</b>, and <b style='color: forestgreen;'>biomimicry</b> to invent new <b style='color: forestgreen;'>anatomies</b> and <b style='color: forestgreen;'>appendages</b> that challenge <b style='color: forestgreen;'>biological norms</b>. This can lead to thought-provoking discussions about typical and atypical bodies, encouraging a reframing of how we view <b style='color: forestgreen;'>disability</b> and <b style='color: forestgreen;'>technological enhancement.</b> The project invites creative <b style='color: forestgreen;'>reimagination</b> of <b style='color: forestgreen;'>social</b> and <b style='color: forestgreen;'>cultural rituals,</b> allowing the design of prosthetics to become a form of narrative or commentary on technology's role in society."
        },
        {
            "title": "Creating Virtual Masks and Costumes",
            "body": "<b style='color: forestgreen;'>Sun</b>ing your face or body for your <b style='color: forestgreen;'>project</b>: Your task is to create a unique virtual mask or <b style='color: forestgreen;'>costume</b> that interacts with human <b style='color: forestgreen;'>movement</b> using either live data through motion capture or computer vision. This can involve interpreting the <b style='color: forestgreen;'>coordinates</b> of facial features or the <b style='color: forestgreen;'>positions</b> of body joints as captured by devices like a standard <b style='color: forestgreen;'>webcam</b> or specialized sensors. The virtual design can serve various purposes, from ritualistic to <b style='color: forestgreen;'>practical</b>, or even playful. You could transform your <b style='color: forestgreen;'>identity</b> into something non-human, conceal personal info, or reflect one's actions in a game setting. Key <b style='color: forestgreen;'>requirements</b> include documenting and <b style='color: forestgreen;'>justifying</b> your artistic and technical decisions along with rehearsing and recording a <b style='color: forestgreen;'>performance</b> involving your software.\n\n<b style='color: forestgreen;'>Creating</b> augmented realities with your tool: There are numerous <b style='color: forestgreen;'>variations</b> on how you can pursue this assignment. You might use pre-recorded <b style='color: forestgreen;'>data</b> to animate a convincing character, craft an <b style='color: forestgreen;'>information visualization</b>, or even integrate <b style='color: forestgreen;'>sound</b> with movements. Explore <b style='color: forestgreen;'>visualizing</b> how a body's presence alters an environment. The aim is to survey the tools and <b style='color: forestgreen;'>possibilities</b> in motion capture, employ <b style='color: forestgreen;'>algorithmic</b> techniques to create your virtual representation, and uncover new <b style='color: forestgreen;'>aesthetic</b> and conceptual narratives through human movement in software."
        },
        {
            "title": "Interactive Creativity with Code",
            "body": "In this section, you are encouraged to explore <b style='color: forestgreen;'>creativity with code</b> through diverse <b style='color: forestgreen;'>assignments</b> and <b style='color: forestgreen;'>exercises</b>. The focus is on developing a <b style='color: forestgreen;'>synesthetic instrument</b>, an audiovisual device that generates <b style='color: forestgreen;'>sounds and visuals</b> interactively in real time. The keys to the project are <b style='color: forestgreen;'>expressiveness</b> and <b style='color: forestgreen;'>predictability</b>, allowing for a wide range of possibilities based on the performer's interactions. Think about how <b style='color: forestgreen;'>inputs</b> (like a keyboard or mouse) connect with <b style='color: forestgreen;'>outputs</b> (visual and sound) through <b style='color: forestgreen;'>mapping</b> strategies eg. cursor speed affecting sound pitch.\n\nDive deeper into the <b style='color: forestgreen;'>historical context</b> of similar projects and consider constraints that might encourage <b style='color: forestgreen;'>innovation</b>, such as using a specific tool or interface for performance. Another option is to design for a <b style='color: forestgreen;'>single user</b>, which contrasts with the typical design for mass user experiences. This approach emphasizes <b style='color: forestgreen;'>system responsiveness</b> over the mere aesthetics of the output. The goal is to create a tool that’s easy to <b style='color: forestgreen;'>understand</b> but hard to <b style='color: forestgreen;'>master</b>, allowing users to express and refine their creativity continuously. An awareness of how sound and visuals interact will guide the design for an optimal, creative experience."
        },
        {
            "title": "Artistic Programming Education: Key Considerations",
            "body": "<b style='color: forestgreen;'>Teaching Programming to Artists and Designers</b> raises unique challenges, given the contrasting learning styles compared to computer science students. <b style='color: forestgreen;'>Heather Dewey-Hagborg</b> argues that it's vital for artists to engage in <b style='color: forestgreen;'>project-based learning</b>. The <b style='color: forestgreen;'>joy</b> of working on <b style='color: forestgreen;'>self-driven projects</b> outweighs the importance of programming <b style='color: forestgreen;'>language proficiency</b>. Similarly, <b style='color: forestgreen;'>Daniel Shiffman</b> emphasizes the importance of <b style='color: forestgreen;'>embracing uncertainty</b> in creative settings, where mistakes are valuable learning sources, contrasting with the <b style='color: forestgreen;'>precision-focused</b> computer science approach.\n\n<b style='color: forestgreen;'>Lauren McCarthy</b> highlights that for art students, <b style='color: forestgreen;'>code</b> is just another medium for <b style='color: forestgreen;'>expression</b>, rather than a <b style='color: forestgreen;'>technical skill</b> designed to manage complexity. Influenced by <b style='color: forestgreen;'>logical structures</b>, it's crucial for them to see programming from diverse perspectives. Educator <b style='color: forestgreen;'>Phœnix Perry</b> suggests integrating <b style='color: forestgreen;'>basic math</b> with <b style='color: forestgreen;'>visual output</b> as many students lack confidence in math. Emphasizing <b style='color: forestgreen;'>visual/auditory language</b> helps in <b style='color: forestgreen;'>conceptual understanding</b>. These educators underscore the need for teaching strategies that consider the <b style='color: forestgreen;'>creativity</b> and <b style='color: forestgreen;'>expressive needs</b> inherent to artists and designers, fostering an environment for <b style='color: forestgreen;'>experimentation</b> and <b style='color: forestgreen;'>learning through making</b> without the focus on <b style='color: forestgreen;'>technical correctness</b>."
        },
        {
            "title": "The Importance of Mistakes and Adaptability",
            "body": "When teaching programming or coding, <b style='color: forestgreen;'>errors and troubleshooting</b> can actually be helpful moments. <b style='color: forestgreen;'>Daniel Shiffman</b> mentions that getting stuck during a lecture can be a learning experience for students, showing them that even experienced programmers encounter problems. Although these moments can be personally stressful, they remind everyone that problem-solving is part of the process. Similarly, <b style='color: forestgreen;'>Winnie Soon</b> finds that when code fails unexpectedly in class, it teaches students about the <b style='color: forestgreen;'>imperfection and reality</b> of programming. It forces educators to adapt and improvise to continue covering important content."
        },
        {
            "title": "Effective Teaching Strategies in Computational Arts",
            "body": "The chunk discusses various teaching <b style='color: forestgreen;'>techniques</b> and <b style='color: forestgreen;'>advice</b> for educators, especially in computational arts courses. Key points include:\n\n1. <b style='color: forestgreen;'>Respect & Accommodation</b>: Use questionnaires for gathering students' <b style='color: forestgreen;'>background</b> and <b style='color: forestgreen;'>concerns</b>. Implement a <b style='color: forestgreen;'>code of conduct</b> to prohibit harassment and ensure inclusivity.\n2. <b style='color: forestgreen;'>Debugging</b>: Teachers should not fear admitting they don't know something. <b style='color: forestgreen;'>Collaborate</b> with students to debug code and involve them actively.\n3. <b style='color: forestgreen;'>Critique Techniques</b>: Use <b style='color: forestgreen;'>structured critique</b> processes, enabling students to feedback meaningfully. Collaborative notepads can improve the critique process.\n4. <b style='color: forestgreen;'>Feedback</b>: Regular student journals and <b style='color: forestgreen;'>research sprints</b> help integrate cultural context with code teaching.\n\nOverall, the strategies highlight building an inclusive and motivating learning environment."
        },
        {
            "title": "Authors and Contributors Overview",
            "body": "This segment lists the individuals featured in the <b style='color: forestgreen;'>Author</b> and <b style='color: forestgreen;'>Contributor</b> sections, spotlighting artists, educators, and programmers like <b style='color: forestgreen;'>Tega Brain</b>, <b style='color: forestgreen;'>Golan Levin</b>, <b style='color: forestgreen;'>Heather Dewey-Hagborg</b>, and <b style='color: forestgreen;'>Taeyoon Choi</b>. It highlights their professional backgrounds, educational pursuits, and contributions to computational art and design. Individuals like <b style='color: forestgreen;'>R. Luke DuBois</b> and <b style='color: forestgreen;'>Zachary Lieberman</b> have noteworthy accomplishments, such as co-authoring software and engaging in international exhibitions. Their collective works illustrate a diverse array of projects, emphasizing social interactivity and technological exploration."
        }
    ]
}