{
    "meta": {
        "title": "Dynamics of Self-Organized and Self-Assembled Structures",
        "author": "Rashmi C. Desai and Raymond Kapral",
        "category": "Science/Physics/Chemistry",
        "publisher": "University of Toronto",
        "pages": 344
    },
    "parts": [
        {
            "title": "Understanding Self-Organized Structures",
            "body": "The book <b style='color: forestgreen;'>explores</b> how <b style='color: forestgreen;'>self-organized</b> and <b style='color: forestgreen;'>self-assembled structures</b> form spontaneously in <b style='color: forestgreen;'>physical</b> and <b style='color: forestgreen;'>biological</b> systems that are <b style='color: forestgreen;'>out of equilibrium</b>. It discusses how <b style='color: forestgreen;'>complex patterns</b> emerge from <b style='color: forestgreen;'>cooperative interactions</b> among system constituents and provides ways to model these patterns. By combining <b style='color: forestgreen;'>equilibrium</b> and <b style='color: forestgreen;'>nonequilibrium</b> concepts like <b style='color: forestgreen;'>free-energy</b> functional and <b style='color: forestgreen;'>amplitude equations</b>, it aims to explain <b style='color: forestgreen;'>pattern formation</b> in diverse systems, such as <b style='color: forestgreen;'>liquid crystals</b>, <b style='color: forestgreen;'>chemical reactions</b>, and <b style='color: forestgreen;'>biological processes</b>. The work is interdisciplinary, drawing from physics, chemistry, and materials science, thus making it a valuable resource for students and researchers across multiple fields."
        },
        {
            "title": "Phase Separation Kinetics",
            "body": "<b style='color: forestgreen;'>Phase separation kinetics</b> involves the transformation of a disordered system into an ordered state composed of coexisting phases. This is initiated by a sudden change, like a temperature quench, leading the system to a <b style='color: forestgreen;'>nonequilibrium state</b> which then evolves into an ordered equilibrium state. The process may involve uniform (spinodal) or heterogeneous (nucleation) pathways. <b style='color: forestgreen;'>Late-stage domain growth</b> follows <b style='color: forestgreen;'>power laws</b> dependent on the fluctuating variables that drive the separation, such as the <b style='color: forestgreen;'>order parameter</b> indicating the concentration of a species. The growth pattern can differ for conserved and nonconserved order parameters.\n\nDuring phase separation, the <b style='color: forestgreen;'>order parameter</b> undergoes spatial changes, notably in regions between phases. These changes are characterized by the <b style='color: forestgreen;'>structure factor</b> which gives insights into the <b style='color: forestgreen;'>density fluctuations</b> and spatial correlations in the transition from disorder to order. The <b style='color: forestgreen;'>structure factor</b> is key in scattering experiments that monitor such transitions, and it shows time evolution in nonequilibrium conditions. The study of such phenomena employs techniques from <b style='color: forestgreen;'>nonequilibrium statistical mechanics</b> and <b style='color: forestgreen;'>nonlinear dynamics</b>."
        },
        {
            "title": "Model B Systems & Dynamics",
            "body": "<b style='color: forestgreen;'>Conserved order parameter systems</b> like binary alloys and <b style='color: forestgreen;'>spin-exchange Ising models</b> are described by Model B Langevin equations. In these systems, the order parameter is <b style='color: forestgreen;'>conserved</b> over time, maintaining its average value. The equation introduces a <b style='color: forestgreen;'>current</b> related to the order parameter, influenced by <b style='color: forestgreen;'>chemical potential</b> and <b style='color: forestgreen;'>thermal noise</b>. This leads to the <b style='color: forestgreen;'>Cahn–Hilliard–Cook equation</b> when ignored noise, focusing on late-stage domain growth in phase separation where the <b style='color: forestgreen;'>average domain size grows</b> over time.\n\nIn <b style='color: forestgreen;'>critical quenches</b>, the dimensionless Model B equation simplifies to represent dynamics post-quench, involving scaling variables. Experiments confirm that <b style='color: forestgreen;'>domain size</b> in these systems scales with time, <b style='color: forestgreen;'>R(t) ∼ t^1/3</b>, independent of dimension, as seen in both simulations and theory. <b style='color: forestgreen;'>Dynamic scaling</b> ensures that patterns remain statistically similar over time, barring global changes. This scaling applies across various materials, ensuring <b style='color: forestgreen;'>self-similarity</b> in their morphological evolution."
        },
        {
            "title": "Interfacial Shape Distribution and Dynamics in Phase-Separating Systems",
            "body": "The <b style='color: forestgreen;'>interfacial structure</b> in systems undergoing phase separation can be characterized by the <b style='color: forestgreen;'>interfacial shape distribution (ISD)</b>, which records the probability of finding <b style='color: forestgreen;'>interface patches</b> with specific principal curvatures (κ1, κ2). These distributions help in understanding the <b style='color: forestgreen;'>underlying geometry</b> of phase-separating systems, particularly in looking at <b style='color: forestgreen;'>symmetric two-phase systems</b>. The study highlights that at <b style='color: forestgreen;'>late-stage times</b>, ISDs reveal a dominance of <b style='color: forestgreen;'>saddle-shaped (hyperbolic) patches</b>.\n\nWhen exploring model <b style='color: forestgreen;'>dynamical systems*, differences are noted between </b>model A (nonconserved)<b style='color: forestgreen;'> and </b>model B (conserved)<b style='color: forestgreen;'> dynamics. Model B systems, in particular, exhibit more </b>complex interplays<b style='color: forestgreen;'> involving </b>hydrodynamic and elastic effects<b style='color: forestgreen;'>, which can influence </b>phase segregation kinetics<b style='color: forestgreen;'>. Such complexity underscores the need for specialized models and simulations to truly understand </b>coarsening processes<b style='color: forestgreen;'> in different materials, such as </b>polymer melts<b style='color: forestgreen;'> and </b>binary alloys**."
        },
        {
            "title": "Gibbs–Thomson Effect and Ostwald Ripening",
            "body": "The <b style='color: forestgreen;'>Gibbs–Thomson</b> boundary condition describes the effect of curvature on chemical potential near an interface between phases. In the context of <b style='color: forestgreen;'>Ostwald ripening</b>, a <b style='color: forestgreen;'>small minority-phase cluster</b> tends to <b style='color: forestgreen;'>evaporate</b> by diffusing through the majority phase until it reaches a large enough size where it starts <b style='color: forestgreen;'>growing</b>. This results in <b style='color: forestgreen;'>Laplace's equation</b> determining the chemical potential in the majority phase, while the boundary condition accounts for curvature effects on the chemical potential. The <b style='color: forestgreen;'>interface velocity</b> is driven by imbalances in the diffusion current across the interface and is influenced by the radius of curvature.\n\nFor <b style='color: forestgreen;'>spherical minority-phase domains</b>, there's an equilibrium condition dictated by <b style='color: forestgreen;'>supersaturation</b> levels and <b style='color: forestgreen;'>curvature</b> effects. If the interface velocity is positive, the domain grows, otherwise it shrinks. The critical radius, <b style='color: forestgreen;'>Rc</b>, separates these regimes: domains larger than <b style='color: forestgreen;'>Rc</b> grow by accreting material from the surrounding phase, while smaller domains shrink, leading to a <b style='color: forestgreen;'>power-law</b> behavior, indicating <b style='color: forestgreen;'>R^3 dependency</b> on time for particle <b style='color: forestgreen;'>shrinkage</b> and <b style='color: forestgreen;'>growth dynamics</b> at late stages in systems governed by these dynamics."
        },
        {
            "title": "Overview of Modulated Phases in Competing Interaction Systems",
            "body": "The system with short-range interactions exhibits homogeneous disorder when in its equilibrium state. In systems with both short-range and long-range <b style='color: forestgreen;'>repulsive interactions</b>, modulated phases such as <b style='color: forestgreen;'>stripes</b> and <b style='color: forestgreen;'>hexagonal arrangements</b> appear. These patterns can form during phase separation processes, where the short-range attractive forces encourage clustering, while long-range repulsive interactions promote spreading, resulting in <b style='color: forestgreen;'>periodic patterns</b>.\n\nThe equilibrium of these systems can be analyzed by examining the <b style='color: forestgreen;'>free energy</b> landscape, where one determines the order parameter profile that minimizes the free energy. The <b style='color: forestgreen;'>equilibrium phase diagram</b> for a system with competing interactions shows distinct regions corresponding to <b style='color: forestgreen;'>stripe</b>, <b style='color: forestgreen;'>hexagonal</b>, and <b style='color: forestgreen;'>disordered phases</b>. In these systems, phase transitions may occur, which can often be first order, especially between stripe and hexagonal phases."
        },
        {
            "title": "Domain Morphology and Defect Dynamics",
            "body": "<b style='color: forestgreen;'>Competing interactions</b> result in domain morphologies that evolve over time. <b style='color: forestgreen;'>Monodisperse systems</b> develop into <b style='color: forestgreen;'>hexagonal patterns</b> and anneal defects through processes like <b style='color: forestgreen;'>T1</b> (neighbor switching) and <b style='color: forestgreen;'>T2</b> (coalescence of droplets). In these systems, <b style='color: forestgreen;'>topological defects</b> such as <b style='color: forestgreen;'>disclinations</b> and <b style='color: forestgreen;'>dislocations</b> arise, which affect <b style='color: forestgreen;'>orientational</b> and <b style='color: forestgreen;'>translational order</b> during late-stage evolution. The <b style='color: forestgreen;'>Burgers vector</b> helps to understand defect dynamics. The dominant mechanism in <b style='color: forestgreen;'>Langmuir films</b> is typically <b style='color: forestgreen;'>T1</b>, while for froths, <b style='color: forestgreen;'>T2</b> dominates. <b style='color: forestgreen;'>Simulations</b> can help visualize the time evolution of <b style='color: forestgreen;'>orientational</b> and <b style='color: forestgreen;'>translational order parameters</b>, showing progression toward a <b style='color: forestgreen;'>crystalline state</b>."
        },
        {
            "title": "Understanding Rough Interfaces and KPZ Equation Dynamics",
            "body": "This section explores how <b style='color: forestgreen;'>diffusively rough interfaces</b> behave and links to the <b style='color: forestgreen;'>Kuramoto-Sivashinsky (KPZ) equation</b> used for dynamics of nearly flat interfaces in <b style='color: forestgreen;'>non-conserved models</b>, like a solid growing into a supercooled liquid. It indicates such equations are relevant for describing <b style='color: forestgreen;'>self-organized critical states</b> in systems like supercooled liquids. These states appear without needing to finely adjust other conditions, but eventually decay due to <b style='color: forestgreen;'>nucleation</b> where droplets form and expand. The decay rate, known as the <b style='color: forestgreen;'>nucleation rate</b>, is described mathematically to mirror real phenomena, indicating when KPZ equations apply, ensuring timely predictions of interface behaviors before nucleation effects prevail."
        },
        {
            "title": "Chemical Front Instabilities in Autocatalytic Reactions",
            "body": "<b style='color: forestgreen;'>Front Instabilities</b>: Transverse instability in chemical reactions can arise due to differences in diffusion rates between reacting species. For cubic autocatalytic reactions, a scenario can be considered where an autocatalyst <b style='color: forestgreen;'>B</b> consumes a fuel <b style='color: forestgreen;'>A</b>. In a system initially separated by a planar front (B on one side, A on the other), the interplay of different diffusion rates (DA and DB) can cause the front to remain planar or become unstable and develop structure across its width.\n\n<b style='color: forestgreen;'>Front Dynamics</b>: If DB is significantly larger than DA, the faster diffusion of B will smooth out non-planarities in the front, keeping it <b style='color: forestgreen;'>planar</b>. On the other hand, if DB is much smaller, non-planarities will grow, leading to <b style='color: forestgreen;'>instabilities</b>. A critical ratio of DA/DB exists where these instabilities arise. Experiments have confirmed such <b style='color: forestgreen;'>instabilities</b> in systems like the iodate-arsenous acid reaction, where new structures in the form of waves or cellular patterns emerge from initial planar fronts."
        },
        {
            "title": "Front Repulsion and Labyrinthine Patterns",
            "body": "<h3 style='color: forestgreen;'>Understanding Front Repulsion and Emergence of Labyrinthine Patterns</h3>\n\nIn systems with front repulsion and competing interactions, nonlocal free energy can create stable domains. The <b style='color: forestgreen;'>c+<sub>A</sub></b> phase benefits from a long-range repulsive coupling due to the <b style='color: forestgreen;'>rapid diffusion</b> of species <b style='color: forestgreen;'>B</b>. Evaluating <b style='color: forestgreen;'>nonlocal free energy</b> using the <b style='color: forestgreen;'>Green function</b> reveals stability possibilities in <b style='color: forestgreen;'>one-dimensional domains</b>. Such coupling affects front dynamics, influencing domain <b style='color: forestgreen;'>size stability</b> against shrinkage. \n\nFront repulsion extends to <b style='color: forestgreen;'>two dimensions</b> by forming structures such as <b style='color: forestgreen;'>labyrinthine patterns</b> through transverse instabilities in chemical systems. Curvature and nonlocal interactions become significant, especially when transverse instabilities lead to complex patterns from initial <b style='color: forestgreen;'>disk conditions</b>. These patterns form due to <b style='color: forestgreen;'>rapid inhibitor diffusion</b>, contrasting with behavior in systems like <b style='color: forestgreen;'>Model A</b>, without this repulsion."
        },
        {
            "title": "Complex Ginzburg-Landau Equation and Hopf Bifurcation",
            "body": "The <b style='color: forestgreen;'>complex Ginzburg–Landau (CGL) equation</b> is a key equation used for <b style='color: forestgreen;'>oscillatory patterns</b> near a <b style='color: forestgreen;'>Hopf bifurcation</b>. This equation characterizes the <b style='color: forestgreen;'>slow modulation</b> of an <b style='color: forestgreen;'>oscillatory pattern</b>'s amplitude across space and time. It’s widely applicable across various <b style='color: forestgreen;'>physical systems</b> due to its foundation in assumptions about slow changes and weak nonlinearity in physical systems.\n\nIn a <b style='color: forestgreen;'>Hopf bifurcation</b>, a stable steady state can lose stability, leading to <b style='color: forestgreen;'>oscillations</b>—this is captured by the Hopf normal form. This normal form is the basis for understanding the transition of systems from <b style='color: forestgreen;'>steady states</b> to <b style='color: forestgreen;'>limit cycles</b> (oscillations) when parameters cross certain thresholds. The <b style='color: forestgreen;'>CGL equation</b> emerges as a universal tool to capture these phenomena, offering insight into the modulation of amplitude and <b style='color: forestgreen;'>spatial patterns</b> within these evolving systems."
        },
        {
            "title": "Spiral Waves and Line Defects in Complex Oscillatory Media",
            "body": "In the context of complex oscillatory media, spiral waves can develop <b style='color: forestgreen;'>line defects</b> when the <b style='color: forestgreen;'>local dynamics</b> becomes <b style='color: forestgreen;'>period-doubled</b> or even <b style='color: forestgreen;'>chaotic</b>. These line defects are characterized by a 2π phase shift across them. In Fig. 27.1, we see how <b style='color: forestgreen;'>period-1</b> and <b style='color: forestgreen;'>period-2 limit cycles</b> differ in phase space representation: period-1 cycles display single-loop trajectories while period-2 cycles make two loops before closing.\n\nExperiments reveal these line defects in <b style='color: forestgreen;'>period-2 spiral waves</b> within the <b style='color: forestgreen;'>Belousov–Zhabotinsky reaction</b>, as illustrated in Fig. 27.2. Period-doubling in spiral waves results in a <b style='color: forestgreen;'>synchronization line defect</b> that complements the typical spiral structure observed in <b style='color: forestgreen;'>period-1 regimes</b>. Understanding these complex structures is crucial for analyzing spatiotemporal patterns in <b style='color: forestgreen;'>chaotic oscillatory systems</b>. In complex oscillatory media, line defects disrupt the symmetry of spiral waves, affecting their dynamics and the overall pattern formation within the medium."
        },
        {
            "title": "Protein-Induced Pattern Formation in Biomembranes",
            "body": "The discussed models explore *protein*–*lipid* interactions in biological systems, specifically *GMC proteins* and *acidic lipids* in cell membranes. These *interactions* can lead to *microdomain formation*, influenced by both *chemical reactions* and *phase separation*. GMC proteins interact with the membrane, switching between *binding* and *unbinding* states, controlled by *phosphorylation* and *dephosphorylation* processes via a mechanism known as the *myristoyl-electrostatic (ME) switch*. *Phosphorylation* by *PKC* prompts proteins to unbind and move to the *cytosol*, whereas *dephosphorylation* allows them to return to the membrane. This dynamic influences the *microdomain* structures, essential for various cellular functions like *signaling*.\n\nThe model quantitatively analyzes this *protein-induced* pattern formation. The membrane consists of *acidic* and *neutral lipids*, with the interaction primarily involving the acidic lipids and *GMC proteins*. The *protein* states include membrane-bound, *unphosphorylated*, and *phosphorylated* forms. These interactions are crucial for understanding the organization of biomembranes and their functioning in cellular processes, showcasing the complexity of interactions in living systems."
        },
        {
            "title": "Active Nematic Dynamics",
            "body": "<h3 style='color: forestgreen;'>Active Nematic Systems:</h3>\n\nIn systems with <b style='color: forestgreen;'>self-propelled particles</b>, phenomena such as <b style='color: forestgreen;'>flocking</b> emerge due to orientational <b style='color: forestgreen;'>long-range order</b>. In a <b style='color: forestgreen;'>continuum hydrodynamic model</b> of an <b style='color: forestgreen;'>active nematic liquid crystal</b> on a substrate, elements like <b style='color: forestgreen;'>nematic order parameter</b> and <b style='color: forestgreen;'>local concentration</b> are critical. Here, behaviors diverge from equilibrium models, displaying heightened <b style='color: forestgreen;'>fluctuations</b> in <b style='color: forestgreen;'>density</b> and <b style='color: forestgreen;'>velocity</b> due to the interplay of <b style='color: forestgreen;'>concentration and velocity fields</b> in the nonlinear <b style='color: forestgreen;'>continuity equation</b>. Equations for the <b style='color: forestgreen;'>nematic director's dynamics</b> involve terms reflecting <b style='color: forestgreen;'>friction</b> and non-equilibrium stresses, introducing unique scaling laws like <b style='color: forestgreen;'>N-scaling</b> density fluctuations in 2D systems."
        }
    ]
}