{
    "meta": {
        "title": "Email Attraction: Get What You Want Every Time You Hit Send",
        "author": "Kim Arnold",
        "category": "Business Communication",
        "publisher": "Rethink Press",
        "pages": 125
    },
    "parts": [
        {
            "title": "The Value of Essential Email Skills",
            "body": "<b style='color: forestgreen;'>Kim Arnold</b>'s book on becoming better at <b style='color: forestgreen;'>email</b> communication is crucial because many spend <b style='color: forestgreen;'>years</b> (six on average) buried in their <b style='color: forestgreen;'>inbox</b>. With little training, people struggle with <b style='color: forestgreen;'>inefficient</b> emails that waste time and cause <b style='color: forestgreen;'>frustration</b>. Good news—<b style='color: forestgreen;'>email</b> can be incredibly <b style='color: forestgreen;'>effective</b>, saving you time if done <b style='color: forestgreen;'>correctly</b>. The book aims to help you become \"The Big Email Enchilada,\" turning your email skills into a <b style='color: forestgreen;'>superpower</b> to cut down those six years to even two or one by improving your <b style='color: forestgreen;'>communication</b> strategy."
        },
        {
            "title": "Avoid Emotional Emails & Effective Email Communication",
            "body": "<b style='color: forestgreen;'>Avoid emotional emails</b>: Before sending emails when <b style='color: forestgreen;'>emotional</b>, wait at least an <b style='color: forestgreen;'>hour</b> to <b style='color: forestgreen;'>calm down</b>. Consider if the <b style='color: forestgreen;'>email</b> will get <b style='color: forestgreen;'>desired results</b> or just appease <b style='color: forestgreen;'>immediate feelings</b>. <b style='color: forestgreen;'>Read aloud</b> to check if you'd say it face-to-face and get <b style='color: forestgreen;'>impartial advice</b> to <b style='color: forestgreen;'>avoid unnecessary conflict</b>.\n\n<b style='color: forestgreen;'>Effective Communication Tips</b>: Consider the <b style='color: forestgreen;'>recipient's perspective</b>; think about their <b style='color: forestgreen;'>style and preferences</b>. Use the <b style='color: forestgreen;'>three Ws</b>: <b style='color: forestgreen;'>Who</b> you're writing to, <b style='color: forestgreen;'>What</b> you want, and <b style='color: forestgreen;'>Why</b> they should care. Create a <b style='color: forestgreen;'>two-way conversation</b> to engage your reader and avoid being a <b style='color: forestgreen;'>\"party bore\"</b>. Use <b style='color: forestgreen;'>clear</b> and <b style='color: forestgreen;'>engaging</b> language rather than stiff language to connect."
        },
        {
            "title": "Emails and Visual Appeal - Drawing Parallels with Gourmet Cuisine",
            "body": "<h3 style='color: forestgreen;'>How Emails are Like Gourmet Meals</h3>\n\n<b style='color: forestgreen;'>Fancy chefs</b> have a way of making dishes visually <b style='color: forestgreen;'>appealing</b> before you taste them - your <b style='color: forestgreen;'>emails</b> should do the same. Just like we judge food <b style='color: forestgreen;'>visually</b>, readers judge emails by how they look at first glance. A messy email is like a greying steak; unappealing and <b style='color: forestgreen;'>forgettable</b>. To make emails attractive, <b style='color: forestgreen;'>create</b> spaces and make them <b style='color: forestgreen;'>easy</b> to read with short <b style='color: forestgreen;'>sentences</b> and <b style='color: forestgreen;'>paragraphs</b>. This attracts readers and helps them focus on your important message.\n\n<h3 style='color: forestgreen;'>The Power of White Space in Emails</h3>\n\nJust like a <b style='color: forestgreen;'>cavernous lobby</b>, white space in your emails creates a sense of <b style='color: forestgreen;'>calm</b> and importance. Too many words create chaos and <b style='color: forestgreen;'>overwhelm</b> - it feels like climbing a \"word wall.\" <b style='color: forestgreen;'>Short</b> sentences and <b style='color: forestgreen;'>generous</b> spacing make messages <b style='color: forestgreen;'>clear</b> and leave room for <b style='color: forestgreen;'>important</b> information. This makes your emails <b style='color: forestgreen;'>engaging</b> and easier to handle, turning your writing into a more <b style='color: forestgreen;'>effective</b> communication tool."
        },
        {
            "title": "Mastering Effective Email Call-to-Actions",
            "body": "The section discusses the importance of having a clear, concise, and compelling <b style='color: forestgreen;'>call-to-action (CTA)</b> in your emails. It emphasizes that a CTA should ask for <b style='color: forestgreen;'>one thing only</b>, be direct, offer a clear and manageable next step, include a <b style='color: forestgreen;'>timeframe</b>, and ideally be short, preferably one sentence. The text provides examples of common mistakes, like being too vague or <b style='color: forestgreen;'>overwhelming</b> with multiple requests, and offers solutions on how to improve them. Key tips include dividing tasks into separate emails, using numbered lists for multiple requests, and always including a strong <b style='color: forestgreen;'>verb</b> and deadline."
        },
        {
            "title": "Proofread Before Sending",
            "body": "Imagine crafting an email and being ready to hit <b style='color: forestgreen;'>send</b>. Hold on! Reviewing and editing your email is crucial. A slip of the keyboard, like missing an ‘l’ in ‘public’, can lead to <b style='color: forestgreen;'>embarrassing typos</b>. Research indicates typos can make us appear less <b style='color: forestgreen;'>intelligent</b>. Like dating, people often judge others by their <b style='color: forestgreen;'>grammar</b>, so it’s worth ensuring your email is error-free.\n\nTo perfect your email, try these steps: Reading it <b style='color: forestgreen;'>out loud</b> helps spot awkward phrasing or mistakes. Aim for an email length of about <b style='color: forestgreen;'>eighty words</b>, focusing on the necessary. Apply the <b style='color: forestgreen;'>HEC Hamburger</b> technique with a <b style='color: forestgreen;'>hook</b>, <b style='color: forestgreen;'>explanation</b>, and <b style='color: forestgreen;'>CTA</b>. Check its appearance and use tools like <b style='color: forestgreen;'>Grammarly</b> for spellcheck, but do a manual <b style='color: forestgreen;'>proofread</b> too. Editing enhances your credibility and effectiveness significantly."
        }
    ]
}