{
    "meta": {
        "title": "Freedom of Expression®: Resistance and Repression in the Age of Intellectual Property",
        "author": "Kembrew McLeod",
        "category": "Intellectual Property Law, Censorship, Copyright",
        "publisher": "University of Minnesota Press",
        "pages": 392
    },
    "parts": [
        {
            "title": "A Foreword on Questioning Laws",
            "body": "In the <b style='color: forestgreen;'>foreword</b>, Lawrence Lessig talks about how Americans revere laws without questioning them, unlike <b style='color: forestgreen;'>lawyers</b> who see laws as arguments to be examined. He illustrates that <b style='color: forestgreen;'>Kembrew McLeod</b>, the author, approaches the complex world of <b style='color: forestgreen;'>intellectual property laws</b> like a seasoned lawyer. McLeod, through humor and insight, questions these laws’ justifications that often <b style='color: forestgreen;'>restrict freedom</b> and stifle <b style='color: forestgreen;'>creativity</b>. His book, a call for change, aims to help non-lawyers demand meaningful explanations from the legal system, spotlighting the <b style='color: forestgreen;'>absurdity</b> of current laws that don't fit with modern <b style='color: forestgreen;'>technological advancements</b>."
        },
        {
            "title": "The Fight for Open Genetic and Cultural Information",
            "body": "<b style='color: forestgreen;'>Francis Collins</b>, head of the <b style='color: forestgreen;'>Human Genome Project (HGP)</b>, sang \"This Gene is My Gene\" to emphasize free access to genetic data. He contrasted HGP’s freely accessible <b style='color: forestgreen;'>genome map</b> with the private <b style='color: forestgreen;'>Celera Genomics’</b> draft, which was controlled by corporations. This reflected a broader <b style='color: forestgreen;'>privatization trend</b> affecting both cultural and genetic commons, leading to less public domain. An example of cultural privatization is the ownership and control over folk songs like <b style='color: forestgreen;'>\"This Land Is Your Land\"</b> by Woody Guthrie, which critiques <b style='color: forestgreen;'>private property</b> yet ironically is itself restricted by <b style='color: forestgreen;'>copyright</b> laws preventing lyrical adaptations."
        },
        {
            "title": "Copyright Battles and Musical Borrowing",
            "body": "In the following section, the <b style='color: forestgreen;'>King estate</b> is discussed in terms of its <b style='color: forestgreen;'>stringent control</b> over the late civil rights leader Martin Luther King Jr.'s works, notably the \"I Have a Dream\" speech. On the 30th anniversary of the speech, <b style='color: forestgreen;'>USA Today reprinted it</b> leading to the King estate suing for <b style='color: forestgreen;'>copyright infringement</b>. This incident reflects the estate's focus on <b style='color: forestgreen;'>commercial gain</b>, evident from their restrictions on quoting the speech without payment. An anecdote highlights the high cost and restrictive conditions for reprinting even a few sentences from the speech in scholarly works.\n\nThe narrative transitions to a discussion on how the <b style='color: forestgreen;'>blues music genre</b> was similarly commercialized, focusing on <b style='color: forestgreen;'>Led Zeppelin</b> using elements from blues artist <b style='color: forestgreen;'>Willie Dixon</b> without credit. This is parallel to how early blues artists borrowed and shared music freely. The story reflects a broader theme of <b style='color: forestgreen;'>cultural appropriation</b> and <b style='color: forestgreen;'>the shift</b> from communal to commercial ownership. This <b style='color: forestgreen;'>transition impacts creativity</b> and access, similar to <b style='color: forestgreen;'>gene patents limiting scientific research</b>, discussed later. Dixon's comparison of the simplicity of music-sharing in the past with the complexity and <b style='color: forestgreen;'>ownership issues of today</b> highlights ongoing challenges in maintaining a <b style='color: forestgreen;'>commons-style artistic or scientific environment</b>."
        },
        {
            "title": "Exploitation of Indigenous Knowledge and Biopiracy",
            "body": "<h3 style='color: forestgreen;'>The Exploitative Nature of Intellectual Property Rights</h3>\n\nU.S. companies exploit indigenous knowledge by using <b style='color: forestgreen;'>local plant knowledge</b> without compensation, as seen with <b style='color: forestgreen;'>MGI Pharma</b>'s drug from Brazil's \"<b style='color: forestgreen;'>jaborandi plant</b>.\" Indigenous contributions, like cultivating diverse corn varieties, are <b style='color: forestgreen;'>unrecognized</b> and <b style='color: forestgreen;'>unprotected</b> compared to lab-based, <b style='color: forestgreen;'>patented innovations</b>. Intellectual property rights favor wealthy nations, devaluing traditional knowledge and ignoring its collective nature. <b style='color: forestgreen;'>Vandana Shiva</b> calls these practices \"<b style='color: forestgreen;'>biopiracy</b>.\"\n\nIndigenous communities' centuries of labor result in economic loss under <b style='color: forestgreen;'>global patent systems</b>, leading to <b style='color: forestgreen;'>uncompensated usage</b> by rich corporations. This deepens wealth inequality and strips protection from traditional knowledge systems. Efforts to protect these resources are ongoing but face challenges due to the <b style='color: forestgreen;'>economic vs. moral</b> property rights debate."
        },
        {
            "title": "Legal Precedents and Challenges of Sampling in Music",
            "body": "In the late 20th century, <b style='color: forestgreen;'>musical sampling</b> rose to prominence, highlighted by the <b style='color: forestgreen;'>case of 2 Live Crew</b>. This group parodied \"Pretty Woman\" by altering its lyrics, leading to a lawsuit from Roy Orbison's publishing company. However, the <b style='color: forestgreen;'>Supreme Court ruled in favor of 2 Live Crew</b>, recognizing the song as a fair use parody. Despite this victory, legal precedents remain unclear, especially regarding more fragmented samples used by artists like Public Enemy. The court's decision emphasized that commercial success doesn't automatically negate <b style='color: forestgreen;'>fair use</b> if it maintains a balance of creativity between the old and new works. \n\nMoving forward, changes in <b style='color: forestgreen;'>copyright enforcement altered early hip-hop's creative process</b>. Artists like Public Enemy began reproducing sounds using studio musicians rather than sampling directly from records, driven by high sample-clearance costs. Despite being rooted in commercially-driven legal systems, the <b style='color: forestgreen;'>expression of creativity through sampling continues to face financial and procedural hurdles</b>. For example, the licensing for Kanye West's album involved complex negotiations when using minimal samples."
        },
        {
            "title": "The Complexities of Copyright and Sampling in the Music Industry",
            "body": "<b style='color: forestgreen;'>Grandmaster Flash</b> sampled Liquid Liquid's \"Cavern,\" a <b style='color: forestgreen;'>popular track</b> in the downtown club scene, creating flashpoints in the <b style='color: forestgreen;'>copyright debate.</b> The record company launched a <b style='color: forestgreen;'>lawsuit</b> that dragged on for years, yet Liquid Liquid's bassist, Richard McGuire, recalls feeling <b style='color: forestgreen;'>honored</b> by the sample, despite its <b style='color: forestgreen;'>legal complications.</b> This mirrors conflicts in the industry, such as <b style='color: forestgreen;'>Kraftwerk's</b> displeasure when Afrika Bambaataa used their music for \"Planet Rock,\" mainly due to lack of <b style='color: forestgreen;'>credit.</b> This <b style='color: forestgreen;'>sampling culture</b> sparked notable legal battles but also reflects the <b style='color: forestgreen;'>dynamic, collaborative</b> nature of music creation.\n\nTim Quirk of Too Much Joy faced a <b style='color: forestgreen;'>surreal encounter</b> with Warner over a five-second film <b style='color: forestgreen;'>audio sample</b> they wanted to use, highlighting the <b style='color: forestgreen;'>financial traps</b> record companies set to ensnare artists into <b style='color: forestgreen;'>deeper debt.</b> This shift emphasizes <b style='color: forestgreen;'>corporate interests</b> over individual creatives. The <b style='color: forestgreen;'>sampling legalities</b> often exclude the original artists, echoing the struggles of <b style='color: forestgreen;'>George Clinton,</b> who lost control over his music due to <b style='color: forestgreen;'>dodgy contracts.</b> This system often favors <b style='color: forestgreen;'>corporate profits</b> over the creative voices it claims to protect."
        },
        {
            "title": "Negativland's Media Pranks and Copyright Commentary",
            "body": "<b style='color: forestgreen;'>Negativland</b> pulled off a *prank* by falsely linking their song to a *real murder case*, grabbing media attention that spiraled out of control. They remixed this in their album <b style='color: forestgreen;'>Helter Stupid</b> to reflect on how <b style='color: forestgreen;'>mass media</b> confounds truth and fiction. This mirrors <b style='color: forestgreen;'>Public Enemy's</b> approach, who challenged media narratives about themselves. Despite a lack of legal grounding, the story illustrates how significant events can capture widespread attention, often spotlighting the absurdity and power dynamics inherent in media systems.\n\nNegativland's <b style='color: forestgreen;'>media prank</b> introduced themes of <b style='color: forestgreen;'>pranks</b> and <b style='color: forestgreen;'>copyright law</b> that intrigued the author to trademark \"freedom of expression®\". He succeeded in registering the trademark for \"printed matter\", inviting commentary on how intangible cultural concepts can become legally controlled. Inspired, he executed a media prank involving a punk-rock magazine, landing him coverage in Massachusetts’s <b style='color: forestgreen;'>Hampshire Gazette</b>, spotlighting how media can amplify absurdities inherent in legal systems. His pranks underlined how easily <b style='color: forestgreen;'>media</b> can be exploited to create narratives in a landscape where copyright disputes challenge creative expression."
        },
        {
            "title": "Art, Copyright, and Legal Battles: Koons to Corporates",
            "body": "<h3 style='color: forestgreen;'>Art and Legal Boundaries: Koons and Rogers</h3>\n\n<b style='color: forestgreen;'>Jeff Koons</b>, an artist known for his controversial style, often pushes the boundaries of <b style='color: forestgreen;'>copyright laws</b>. In 1988, he based his artwork, <b style='color: forestgreen;'>String of Puppies</b>, on a mass-produced postcard photo by <b style='color: forestgreen;'>Art Rogers</b>. When Rogers discovered Koons' work, he sued, leading to a landmark case regarding <b style='color: forestgreen;'>fair use</b> in art. Although Koons' team argued it was a transformation under fair use, the court disagreed, ruling it was <b style='color: forestgreen;'>copyright infringement</b>. This case highlights the <b style='color: forestgreen;'>fine line artists tread</b> when using existing works and emphasizes that creativity may not always align with legal definitions of <b style='color: forestgreen;'>fair use</b>.\n\n<h3 style='color: forestgreen;'>Corporate Influence on Artistic Expression</h3>\n\nCorporations increasingly engage in <b style='color: forestgreen;'>lawsuits</b> to protect their <b style='color: forestgreen;'>trademarks</b>, often hindering <b style='color: forestgreen;'>artistic expression</b>. For example, <b style='color: forestgreen;'>Mattel</b> sued artist <b style='color: forestgreen;'>Tom Forsythe</b> for his provocative <b style='color: forestgreen;'>Food Chain Barbie</b> series, citing trademark infringement. Despite winning the case, Forsythe’s legal battle was long and costly, underscoring the <b style='color: forestgreen;'>financial challenges artists face</b>. Exhibits like the <b style='color: forestgreen;'>Illegal Art</b> show, which critiques corporate culture and incorporates works from artists like Forsythe, question the <b style='color: forestgreen;'>balance of </b>artistic freedom and commercial interests<b style='color: forestgreen;'>. These legal battles highlight how </b>copyright laws** can create a chilling effect on creativity, stifling expression under the threat of litigation."
        },
        {
            "title": "Creativity, Authorship, and Ethics",
            "body": "<b style='color: forestgreen;'>Collage</b> art plays with the idea of absence of the author, serving more as a <b style='color: forestgreen;'>curator</b> in the creative process. <b style='color: forestgreen;'>David Bowie</b> leveraged this by having a <b style='color: forestgreen;'>mash-up contest</b>, but the fine print exploited creators by taking all rights to their work \"for exploitation throughout the universe.\" This raises <b style='color: forestgreen;'>ethical concerns</b>; while artists may dislike having their work altered, culture sharing challenges the notion of <b style='color: forestgreen;'>absolute authorial control</b>. The <b style='color: forestgreen;'>philosophical shift</b> on authorship has roots stretching back to figures like <b style='color: forestgreen;'>John Locke</b>, redefined further by recording technologies, which complicate ownership and redefine the \"<b style='color: forestgreen;'>death of the author</b>.\"\n\nThis evolution hit a visible point with <b style='color: forestgreen;'>John Lennon's</b> \"posthumous forced reunion\" with the <b style='color: forestgreen;'>Beatles</b> for recordings, engaging ethically as the author can't consent. <b style='color: forestgreen;'>Jimi Hendrix</b> and other deceased artists were used in ads, echoing <b style='color: forestgreen;'>Thomas Edison's</b> idea that sound could be manipulated without the <b style='color: forestgreen;'>creator's consent</b>. This culminates in the <b style='color: forestgreen;'>ethics</b> of who controls an artist's work posthumously and who profits from it, raising questions about the right to use such legacies. However, the potential of collage and remix as <b style='color: forestgreen;'>free political speech</b> remains a critical concern, highlighting the balance between <b style='color: forestgreen;'>creative freedom</b> and <b style='color: forestgreen;'>intellectual property laws</b>."
        },
        {
            "title": "Peretti vs. Nike iD: Freedom of Expression Clash",
            "body": "Jonah Peretti <b style='color: forestgreen;'>criticizes</b> Nike for their <b style='color: forestgreen;'>rigid policy</b> on personalizing shoes, highlighting <b style='color: forestgreen;'>contradictions</b> in Nike's advertising of the iD program as promoting <b style='color: forestgreen;'>freedom of expression.</b> Nike repeatedly <b style='color: forestgreen;'>denies</b> Peretti's personalization, citing their right to <b style='color: forestgreen;'>cancel</b> orders, and Peretti uses this platform to <b style='color: forestgreen;'>sarcastically</b> request an image depicting a <b style='color: forestgreen;'>child worker</b>. This exchange highlights the <b style='color: forestgreen;'>corporate control</b> over <b style='color: forestgreen;'>individual expression</b> and the <b style='color: forestgreen;'>ethical issues</b> concerning <b style='color: forestgreen;'>sweatshop labor</b>. It shows a clash between consumer <b style='color: forestgreen;'>desires for personalization</b> and <b style='color: forestgreen;'>corporate policies</b> that limit freedom when <b style='color: forestgreen;'>controversy arises</b>."
        },
        {
            "title": "The Privatization of Public Spaces and Resources",
            "body": "<b style='color: forestgreen;'>Corporations</b> have negatively impacted public spaces and resources, limiting <b style='color: forestgreen;'>free speech</b> and accessibility. Many shoppɪng malls, now substitutes for <b style='color: forestgreen;'>downtowns</b>, restrict <b style='color: forestgreen;'>speech</b> and <b style='color: forestgreen;'>protests</b> through legal actions against individuals like <b style='color: forestgreen;'>Steve Downs</b>, highlighting how <b style='color: forestgreen;'>private property</b> can manipulate public freedoms. Elsewhere, organizations like Nike have attempted to <b style='color: forestgreen;'>control public space</b> to promote brands. However, activists like <b style='color: forestgreen;'>0100101110101101.ORG</b> have pushed back with <b style='color: forestgreen;'>pranks</b>, emphasizing <b style='color: forestgreen;'>artistic expression</b> over corporate control. \n\nThe <b style='color: forestgreen;'>privatization</b> extends into natural resources, echoing President <b style='color: forestgreen;'>Harry S. Truman’s</b> warning against allowing <b style='color: forestgreen;'>private interests</b> to exploit <b style='color: forestgreen;'>public goods</b>. Despite corporate claims of better resource management, <b style='color: forestgreen;'>John Sulston</b> criticizes this shift for undermining the <b style='color: forestgreen;'>public good</b>. Yet, examples like <b style='color: forestgreen;'>free weather data</b> showcase <b style='color: forestgreen;'>gift economies</b> successfully contributing to both <b style='color: forestgreen;'>economic growth</b> and <b style='color: forestgreen;'>public welfare</b>. These <b style='color: forestgreen;'>communal efforts</b> often emerge as a <b style='color: forestgreen;'>counterbalance</b> to aggressive profit-driven privatization, fostering <b style='color: forestgreen;'>sociability</b> and <b style='color: forestgreen;'>collaboration</b> over rigid market norms, highlighting a stark <b style='color: forestgreen;'>contrast</b> with corporations like Ford prioritizing profit over <b style='color: forestgreen;'>safety.</b>"
        },
        {
            "title": "Issues with Privatization and its Impacts",
            "body": "<b style='color: forestgreen;'>Water Resource Management</b>\n\nThis section discusses <b style='color: forestgreen;'>issues with privatizing water resources</b> in developing countries. Once water becomes private property, it is controlled by “the market,” meaning <b style='color: forestgreen;'>those who can pay</b> get access. An example is <b style='color: forestgreen;'>Coca-Cola’s plant in India</b> that consumes significant local water, leaving villagers with shortages. The <b style='color: forestgreen;'>market-driven choice</b> can be profitable but socially destructive. \n\n<b style='color: forestgreen;'>Privatization of Warfare</b>\n\nThe privatization of warfare is examined through the <b style='color: forestgreen;'>use of private contractors in wars</b>. By the second Gulf War, the ratio of <b style='color: forestgreen;'>contractors to soldiers</b> went drastically up, with <b style='color: forestgreen;'>one-third of costs</b> going to private U.S. firms. Examples include the <b style='color: forestgreen;'>Halliburton scandal</b>, where they overcharged for importing oil into Iraq. Such examples illustrate \"inefficient and costly\" privatization and highlight the irrational nature of war."
        },
        {
            "title": "Impact of DMCA and Privatization on Innovation and Academia",
            "body": "The impact of the <b style='color: forestgreen;'>Digital Millennium Copyright Act</b> (<b style='color: forestgreen;'>DMCA</b>) and excessive <b style='color: forestgreen;'>intellectual-property laws</b> are evident in the tech and academic sectors. Professor Felten's team had to move their conference out of the <b style='color: forestgreen;'>United States</b> to evade legal challenges under DMCA. When <b style='color: forestgreen;'>researchers</b> fear arrest or legal threats, innovation and <b style='color: forestgreen;'>vulnerability research</b> are stifled. Even <b style='color: forestgreen;'>Richard Clarke</b>, a former head of Bush's <b style='color: forestgreen;'>Cyberspace Security</b>, lobbied unsuccessfully for a change due to the law's \"chilling effect.\"\n\nThe DMCA's flaws extend to academia. Academic journals are being acquired by private entities, impacting the <b style='color: forestgreen;'>free exchange</b> of knowledge. Often, <b style='color: forestgreen;'>professors</b> must surrender their rights to their work because academic careers rely on being published in peer-reviewed journals. The growing trend of <b style='color: forestgreen;'>privatization</b> threatens the traditional academic <b style='color: forestgreen;'>\"gift economy,\"</b> where the aim is to share knowledge openly, and authors are rewarded via reputational boosts rather than monetary gains. Even classroom material is becoming harder to access. For instance, many professors have to remove journal articles from courses due to costly license demands, undermining education's primary goal of <b style='color: forestgreen;'>knowledge dissemination</b>."
        },
        {
            "title": "Metallica's Backlash and RIAA's Legal Campaign",
            "body": "<b style='color: forestgreen;'>Metallica</b>'s early success was fueled by cassette <b style='color: forestgreen;'>tape-trading</b>, a practice similar to today's file-sharing. In the 1980s, fans exchanged demo tapes, which played a significant role in the band's rise. Despite their initial support, Metallica opposed digital file-sharing, leading to public backlash. Drummer <b style='color: forestgreen;'>Lars Ulrich</b> became an unpopular figure during the <b style='color: forestgreen;'>Napster battle</b>, where he and other musicians saw file-sharing as theft, while some argued it was a form of modern-day radio that could generate interest in buying albums.\n\nThe <b style='color: forestgreen;'>RIAA</b> began lawsuits against individual file-sharers, including children and grandparents, charging hefty fines for infringement in the early 2000s. Despite these efforts, CD sales began to rise again, suggesting file-sharing might actually boost sales by acting like promotional radio. Meanwhile, <b style='color: forestgreen;'>BigChampagne</b>, a data firm, showed record labels how file-sharing provided valuable market insights. At the same time, historians compare this phase to the early 1900s when Henry Ford was sued for patent infringement, indicating that technology resistance can stifle innovation and public goodwill."
        },
        {
            "title": "Rise of Independent Music Labels",
            "body": "<b style='color: forestgreen;'>In the early 1990s</b>, <b style='color: forestgreen;'>independent music labels</b> emerged as a reaction against the <b style='color: forestgreen;'>big record companies</b>. They introduced a community-driven model where <b style='color: forestgreen;'>artists support</b> each other. <b style='color: forestgreen;'>Iowa's Dave Zollo</b> started Trailer Records to <b style='color: forestgreen;'>self-release</b> music, proving indie labels like <b style='color: forestgreen;'>Touch & Go</b> followed a similar <b style='color: forestgreen;'>profit-sharing model</b>. This shift enabled <b style='color: forestgreen;'>greater creative freedom</b>, contrasting the <b style='color: forestgreen;'>narrow profit-focused</b> mindset of <b style='color: forestgreen;'>major labels</b>. Music's <b style='color: forestgreen;'>diverse expressions</b> flourished under these models, providing a <b style='color: forestgreen;'>healthier future</b> beyond the constraints of <b style='color: forestgreen;'>mainstream industry</b>."
        },
        {
            "title": "Comprehensive Bibliography Overview",
            "body": "<b style='color: forestgreen;'>This section presents a bibliography of various sources</b> including books, articles, and press releases on topics like <b style='color: forestgreen;'>technology, music, and legal issues</b>. Distinct entries involve notable figures or works, such as <b style='color: forestgreen;'>Woody Guthrie, Bob Dylan</b>, and cases involving <b style='color: forestgreen;'>intellectual property</b>. It indicates comprehensive referencing to support research across law, culture, and technology. Prominent themes relate to <b style='color: forestgreen;'>copyright, innovation, and public domain</b>. Additionally, there are mentions of <b style='color: forestgreen;'>organizations and authors</b> who hold significance in their fields, offering insights into evolving discussions around <b style='color: forestgreen;'>media and ownership.</b>"
        }
    ]
}