{
    "meta": {
        "title": "Matchmakers: The New Economics of Multisided Platforms",
        "author": "David S. Evans and Richard Schmalensee",
        "category": "Business/Economics",
        "publisher": "Harvard Business Review Press",
        "pages": 280
    },
    "parts": [
        {
            "title": "Understanding Matchmakers in Business",
            "body": "The book \"Matchmakers\" by David Evans and Richard Schmalensee explains how some of the <b style='color: forestgreen;'>biggest and most exciting companies</b> today act as <em style='color: forestgreen;'>matchmakers</em> by connecting different groups, like drivers and passengers. This model deviates from traditional firms' economics: it focuses on bringing customer groups together instead of selling products. Examples include tech giants like <b style='color: forestgreen;'>Apple</b> and startups like <b style='color: forestgreen;'>Airbnb</b>. The book reveals how this business model uses platforms to <em style='color: forestgreen;'>reduce friction</em> and facilitate transactions, requiring new strategies distinct from conventional methods."
        },
        {
            "title": "Multifaceted Network Effects and Business Strategy",
            "body": "<b style='color: forestgreen;'>Economists</b> explored how <b style='color: forestgreen;'>network effects</b> in different industries could shape businesses' operations and strategies. It emerged that <b style='color: forestgreen;'>single-sided theories</b> were inadequate for businesses involving <b style='color: forestgreen;'>multiple customer types</b>. <b style='color: forestgreen;'>OpenTable's</b> struggles illustrate how attracting restaurants alone didn't fuel growth; a balance of diners and <b style='color: forestgreen;'>restaurants</b> was necessary. Similarly, in the <b style='color: forestgreen;'>VCR standards war</b>, VHS triumphed because it deftly attracted both content providers and consumers, emphasizing the need for focusing on <b style='color: forestgreen;'>indirect network effects</b> involving <b style='color: forestgreen;'>matching two distinct customer sides.</b>"
        },
        {
            "title": "Multisided Platforms and Pricing Strategies",
            "body": "<b style='color: forestgreen;'>Multisided platforms</b> have become crucial in today's economy, significantly impacted by <b style='color: forestgreen;'>pricing strategies</b>. These platforms differ from traditional businesses as their pricing involves balancing <b style='color: forestgreen;'>interdependent demands</b> across different participant groups. The <b style='color: forestgreen;'>Financial Times</b> example illustrates how pricing influences both <b style='color: forestgreen;'>readership</b> and <b style='color: forestgreen;'>advertising revenue</b>, showcasing the complexity of managing such platforms. Unlike traditional firms, multisided platforms may set prices below production costs, maintain <b style='color: forestgreen;'>zero</b> or even <b style='color: forestgreen;'>negative prices</b> (paying the user), to stimulate participation on the <b style='color: forestgreen;'>subsidy side</b>, while profits are covered by the <b style='color: forestgreen;'>money side</b>. This <b style='color: forestgreen;'>pricing strategy</b> is not about attracting critical mass temporarily but is often a permanent fixture in the platform's model, as observed in sectors like <b style='color: forestgreen;'>video games</b> and <b style='color: forestgreen;'>credit cards</b>."
        },
        {
            "title": "Creating and Managing Platform Value",
            "body": "<h3 style='color: forestgreen;'>Matchmakers: Creators of Value</h3>\n<b style='color: forestgreen;'>Uber</b> and similar companies like <b style='color: forestgreen;'>Lyft</b> and <b style='color: forestgreen;'>Didi Kuaidi</b> are reshaping transportation by providing value to consumers and drivers, causing declines in traditional taxi businesses. This trend, known as <b style='color: forestgreen;'>creative destruction</b>, sees taxi drivers protesting globally as <b style='color: forestgreen;'>taxi medallions</b> fall in price. Businesses need to adapt or risk being surpassed by these efficient <b style='color: forestgreen;'>multisided platforms</b> that modify frictions, pricing, and governance to optimize their <b style='color: forestgreen;'>economic principles</b>.\n\nIn <b style='color: forestgreen;'>China</b> during the late 1990s, businesses faced <b style='color: forestgreen;'>high transaction costs</b> due to poor infrastructure, like limited communication and weak legal systems. <b style='color: forestgreen;'>Alibaba</b> capitalized on this by launching B2B platforms that eased communication and <b style='color: forestgreen;'>trust issues</b> for SMEs. They facilitated trade by providing tools to showcase products and ensure <b style='color: forestgreen;'>reliable transactions</b>. As a result, Alibaba became the <b style='color: forestgreen;'>largest B2B marketplace</b>, significantly reducing barriers for SMEs by creating value through friction reduction, amid high <b style='color: forestgreen;'>GDP growth</b> and a demand for retail innovation. This contrasted with America’s <b style='color: forestgreen;'>B2B exchanges</b>, which generally failed due to insufficient frictions to overcome."
        },
        {
            "title": "Strategies to Achieve Critical Mass",
            "body": "<b style='color: forestgreen;'>YouTube</b> followed a <b style='color: forestgreen;'>zigzag strategy</b> by pushing both <b style='color: forestgreen;'>uploads</b> and <b style='color: forestgreen;'>views</b> to reach <b style='color: forestgreen;'>critical mass</b>. They <b style='color: forestgreen;'>simultaneously engaged</b> in various strategies to <b style='color: forestgreen;'>attract uploaders</b> and <b style='color: forestgreen;'>viewers</b>, but often focused more on one group on certain days. For example, in 2005, <b style='color: forestgreen;'>YouTube's upgrades</b> catered more to <b style='color: forestgreen;'>viewers</b>. Some platforms, like <b style='color: forestgreen;'>OpenTable</b>, used a <b style='color: forestgreen;'>two-step strategy</b>, focusing first on <b style='color: forestgreen;'>restaurants</b> to attract enough of them before <b style='color: forestgreen;'>consumers</b> joined.\n\nPlatforms can also use a <b style='color: forestgreen;'>commitment strategy</b> where one group invests only if another group is committed. They often use <b style='color: forestgreen;'>self-supply</b>, providing initial content or services themselves to attract users. <b style='color: forestgreen;'>Marquee customers</b> or popular figures can also be engaged early to generate <b style='color: forestgreen;'>momentum</b>. Finally, <b style='color: forestgreen;'>shaping expectations</b> can persuade customers on both sides about the platform's potential, often attracting early adopters even if the platform isn’t fully developed yet."
        },
        {
            "title": "Pricing Dynamics in Multisided Platforms",
            "body": "<b style='color: forestgreen;'>Multisided</b> platforms must <b style='color: forestgreen;'>balance</b> pricing structures for <b style='color: forestgreen;'>profitability</b>. This involves understanding the <b style='color: forestgreen;'>sensitivity</b> of each side to price changes and <b style='color: forestgreen;'>deciding</b> whether to <b style='color: forestgreen;'>subsidize</b> one group to attract them, enhancing value for the other group. For example, credit card companies often <b style='color: forestgreen;'>subsidize cardholders</b> with <b style='color: forestgreen;'>rewards</b> while charging <b style='color: forestgreen;'>merchants</b> higher fees. <b style='color: forestgreen;'>Search engines</b> like Google provide <b style='color: forestgreen;'>free search services</b> to users, funded by advertisers who are the <b style='color: forestgreen;'>money side</b>. Platforms must set prices wisely to <b style='color: forestgreen;'>avoid losing money</b> and ensure that interactions are profitable."
        },
        {
            "title": "Challenges and Evolution in Mobile Platforms",
            "body": "<b style='color: forestgreen;'>Symbian</b> struggled due to <b style='color: forestgreen;'>complexity</b> and <b style='color: forestgreen;'>fragmentation</b>. Being owned by multiple handset makers, each wanting unique features, made <b style='color: forestgreen;'>software development difficult</b>. Developers faced challenges with <b style='color: forestgreen;'>APIs</b>, needing to <b style='color: forestgreen;'>customize apps</b> for different handset makers. Symbian was also <b style='color: forestgreen;'>bound by mobile carriers</b> who imposed <b style='color: forestgreen;'>restrictions</b> on handsets. As a result, Symbian couldn't easily <b style='color: forestgreen;'>introduce innovations</b> to its OS and faced a <b style='color: forestgreen;'>tedious process</b> of negotiating with carriers.\n\nApple, recognizing the potential of cell phones to harm its iPod business, chose to control every aspect of <b style='color: forestgreen;'>iPhone development</b>, from hardware to OS design. Initially, third-party apps weren't allowed to protect software integrity. Meanwhile, Google acquired <b style='color: forestgreen;'>Android</b> in 2005, aiming for an <b style='color: forestgreen;'>open-source mobile OS</b>. Android's strategy focused on creating an ecosystem that encouraged collaboration among <b style='color: forestgreen;'>handset makers</b> and <b style='color: forestgreen;'>carriers</b>, countering Apple's exclusive carrier deals. This <b style='color: forestgreen;'>openness</b> attracted many partners and helped Android <b style='color: forestgreen;'>gain popularity</b>, despite initial struggles to break into the iPhone-dominated market."
        },
        {
            "title": "Facebook, Rules, & Platform Governance",
            "body": "<b style='color: forestgreen;'>Lindsay Lohan</b> was kicked off <b style='color: forestgreen;'>Facebook</b> for using a <b style='color: forestgreen;'>fake name</b>, a violation of its rules, showcasing how <b style='color: forestgreen;'>Facebook</b> enforces policies to maintain a pleasant community. Facebook’s <b style='color: forestgreen;'>User Operations</b> team works diligently to monitor and regulate user behavior. The effective policing of users enhances the platform’s value, similar to how <b style='color: forestgreen;'>stock exchanges</b> and <b style='color: forestgreen;'>multisided platforms</b> create trust and enforce rules. Platforms are vigilant in <b style='color: forestgreen;'>reducing negative behavior</b> to maintain their <b style='color: forestgreen;'>community's integrity</b> and <b style='color: forestgreen;'>value to advertisers and users</b>. \n\nPlatforms like <b style='color: forestgreen;'>MySpace</b> failed due to lack of control over inappropriate content and fake accounts, unlike <b style='color: forestgreen;'>Facebook</b> which excelled in maintaining a real-network environment. Enforcement of <b style='color: forestgreen;'>rules</b> helps platforms minimize <b style='color: forestgreen;'>negative behavior</b> which can include fraud, offensive material, and unsafe conditions. Those platforms that establish rules and remove misbehaving users, like <b style='color: forestgreen;'>Google's penalty</b> on <b style='color: forestgreen;'>JCPenney</b> for unethical SEO practices, create better environments for all participants."
        },
        {
            "title": "M-PESA's Launch and Adoption Strategy",
            "body": "In the mid-2000s, <b style='color: forestgreen;'>Kenya</b> had significant rural <em style='color: forestgreen;'><b style='color: forestgreen;'>banking challenges</b></em>. <b style='color: forestgreen;'>Safaricom</b> and <b style='color: forestgreen;'>Vodafone</b> partnered to create <b style='color: forestgreen;'>M-PESA</b>, a platform enabling users to transfer e-money via mobile phones, addressing a critical <em style='color: forestgreen;'><b style='color: forestgreen;'>money movement issue</b></em> for Kenyans. To enable this, they needed a <b style='color: forestgreen;'>network</b> of cash-in and cash-out (<b style='color: forestgreen;'>CICO</b>) <em style='color: forestgreen;'><b style='color: forestgreen;'>agents</b></em> to facilitate physical transactions. These agents were often small <em style='color: forestgreen;'><b style='color: forestgreen;'>businesses</b></em> like gas stations or post offices, who also sold airtime and other products.\n\nLaunching M-PESA required solving the <em style='color: forestgreen;'><b style='color: forestgreen;'>chicken-and-egg problem</b></em>; getting people to adopt a new system when its value depended on widespread adoption was difficult. It grew by launching a marketing campaign targeting those needing to <b style='color: forestgreen;'>\"Send Money Home\"</b> and by ensuring CICO agents were accessible in both rural and urban areas. M-PESA incentivized users with a pricing structure that promoted <b style='color: forestgreen;'>recruitment of others</b> onto the platform. Its success was measurable in significant increases in registered users and transaction volumes over the early years, eventually reaching substantial market penetration and transaction volumes relative to GDP."
        },
        {
            "title": "Success of M-PESA and its Impact",
            "body": "<b style='color: forestgreen;'>M-PESA</b> led a mobile <b style='color: forestgreen;'>payments revolution</b> in <b style='color: forestgreen;'>Kenya</b> due to its adaptable platform; by <b style='color: forestgreen;'>2015</b>, it enabled services like <b style='color: forestgreen;'>saving</b> and <b style='color: forestgreen;'>loans</b> with <b style='color: forestgreen;'>M-Shwari</b> through the Commercial Bank of Africa at competitive rates. <b style='color: forestgreen;'>Safaricom</b>, with <b style='color: forestgreen;'>32,000 merchants</b> using Lipa Na M-PESA, positioned itself as vital for transactions, reducing the relevance of traditional <b style='color: forestgreen;'>banking</b> by leveraging its extensive <b style='color: forestgreen;'>agent network</b> and simplicity, thus facilitating <b style='color: forestgreen;'>economic growth</b>. This model, however, wasn't easy to implement and followed through with necessary enhancements.\n\n<b style='color: forestgreen;'>As of late 2015</b>, M-PESA operated four interlinked platforms: sender-receiver, user-agent, financial services, and merchant-user. This model showcased to other <b style='color: forestgreen;'>African</b> countries how mobile money can enhance <b style='color: forestgreen;'>economic development</b> by providing financial services without establishing physical <b style='color: forestgreen;'>bank branches</b>. Inspired by M-PESA, mobile money practices started in <b style='color: forestgreen;'>37 African countries</b>, providing a model to solve the \"<b style='color: forestgreen;'>chicken-and-egg problem</b>,\" showcasing how an evolved financial system doesn't need traditional banks."
        },
        {
            "title": "Decades of Transformation",
            "body": "<b style='color: forestgreen;'>After</b> the growth of electric utilities, by the end of the <b style='color: forestgreen;'>1920s</b>, roughly <b style='color: forestgreen;'>half</b> of US factories used <b style='color: forestgreen;'>distributed electric motors</b>, replacing central steam engines. The incredible rise in <b style='color: forestgreen;'>smartphone</b> usage may lead to accelerated <b style='color: forestgreen;'>creative destruction</b> in industries. Though some rapid changes occur, such as the swift growth of <b style='color: forestgreen;'>M-PESA</b> in <b style='color: forestgreen;'>Kenya</b>, the historical progression suggests that <b style='color: forestgreen;'>platform transformations</b> in industries generally extend over <b style='color: forestgreen;'>decades</b>.\n\nWith multisided <b style='color: forestgreen;'>platforms</b> at the core of today's economy, they will only grow more significant as existing platforms <b style='color: forestgreen;'>expand</b> and new ones <b style='color: forestgreen;'>emerge</b>. Understanding how these <b style='color: forestgreen;'>complex business models</b> function is crucial for anyone involved as a <b style='color: forestgreen;'>consumer</b>, <b style='color: forestgreen;'>entrepreneur</b>, or <b style='color: forestgreen;'>investor</b>. Economists have developed insights since <b style='color: forestgreen;'>2000</b>, helping to dissect the <b style='color: forestgreen;'>mechanics</b> and <b style='color: forestgreen;'>impact</b> of these platforms, showing their potential for <b style='color: forestgreen;'>revolutionary change</b>."
        },
        {
            "title": "The Rise and Fall of MySpace and Lessons for Social Media Platforms",
            "body": "<h3 style='color: forestgreen;'>The Development of <b style='color: forestgreen;'>MySpace</b> and the <b style='color: forestgreen;'>Rise of Social Media Platforms</b></h3>\n\nSocial media platforms like <b style='color: forestgreen;'>MySpace</b> saw rapid growth and amassed millions of users with its unique features and interactive environments. This early social platform allowed individuals to create profiles, interact through messages, and customize their online presence with music and videos. MySpace achieved significant success, becoming a favorite among users, and at one point, outpaced Google in terms of overall web traffic. However, its reliance on user-generated content and minimal control over what was posted led to concerns about <b style='color: forestgreen;'>privacy and security</b>, contributing to its decline. <b style='color: forestgreen;'>Governance challenges and technological changes</b>, along with competitors like <b style='color: forestgreen;'>Facebook</b>, influenced its downward trajectory.\n\n<h3 style='color: forestgreen;'>Business Implications of <b style='color: forestgreen;'>MySpace's</b> Decline</h3>\n\n<b style='color: forestgreen;'>MySpace's</b> story sheds light on the critical importance of <b style='color: forestgreen;'>platform governance</b> and the need to evolve with technological advancements. As social media evolved, platforms that focused on user experience, reliability, and security became more popular among users, with <b style='color: forestgreen;'>Facebook</b> soon dominating the space. <b style='color: forestgreen;'>MySpace's</b> failure to adequately adapt to these changes demonstrates the necessity for businesses to stay ahead of <b style='color: forestgreen;'>technological trends</b> and user preferences. This case highlights the <b style='color: forestgreen;'>volatile nature</b> of tech industries and the speed at which they can shift, necessitating adaptability and strategic foresight for continued success. Companies can learn from this by monitoring market trends and ensuring robust <b style='color: forestgreen;'>user engagement and satisfaction</b> measures."
        }
    ]
}