{
    "meta": {
        "title": "The Science of Likability: Charm, Wit, Humor, and the 16 Studies That Show You How to Master Them",
        "author": "Patrick King",
        "category": "Self-Help",
        "publisher": "Patrick King Consulting",
        "pages": 86
    },
    "parts": [
        {
            "title": "Understanding the Foundation: Psychology's Role in Likability",
            "body": "<b style='color: forestgreen;'>The </b>Science of Likability<b style='color: forestgreen;'> book uses insights from psychology to </b>make you more likable<b style='color: forestgreen;'>. </b>Patrick King<b style='color: forestgreen;'> starts by </b>sharing his experience<b style='color: forestgreen;'> with majoring in psychology and how it provides practical applications in real life. He explains how subconscious decisions shape our interactions and highlights famous experiments like </b>Little Albert's<b style='color: forestgreen;'> fear conditioning and </b>Pavlov's dogs<b style='color: forestgreen;'>. These studies </b>show how our brains associate stimuli<b style='color: forestgreen;'> with reactions, both negative and positive. King employs these insights to propose that likability can be </b>scientifically engineered** through understanding and applying these principles."
        },
        {
            "title": "The Importance of Balance in Relationships",
            "body": "To <b style='color: forestgreen;'>gain likability</b> and <b style='color: forestgreen;'>prevent being taken advantage of</b>, understanding the <b style='color: forestgreen;'>exchange of favors</b> in relationships is key. People naturally <b style='color: forestgreen;'>track exchanges</b> and are happiest when there is <b style='color: forestgreen;'>equality</b>. If a relationship is <b style='color: forestgreen;'>unbalanced</b>, it leads to <b style='color: forestgreen;'>resentment</b> or <b style='color: forestgreen;'>guilt</b>. To enhance likability, <b style='color: forestgreen;'>ensure equality</b> in your interactions by <b style='color: forestgreen;'>calling out imbalances</b> and <b style='color: forestgreen;'>rectifying them</b> publicly. This <b style='color: forestgreen;'>builds trust</b> and makes you appear <b style='color: forestgreen;'>fair</b> and <b style='color: forestgreen;'>stand-up</b> to others."
        },
        {
            "title": "Building Trust through Consistency",
            "body": "<b style='color: forestgreen;'>Just showing up</b> builds trust. <b style='color: forestgreen;'>Visibility</b> helps form bonds. Salespeople use <b style='color: forestgreen;'>constant contact</b> to build trust, and similarly, showing up repeatedly can make people like you better. \n\nIn friendships, proximity and <b style='color: forestgreen;'>frequent exposure</b> often turn acquaintances into friends. The simple act of being <b style='color: forestgreen;'>present</b> and showing up <b style='color: forestgreen;'>consistently</b> is powerful and helps create bonds over time."
        },
        {
            "title": "How to Avoid Judgment and Assumptions",
            "body": "<h3 style='color: forestgreen;'>How to Avoid Judgment and Assumptions</h3>\n\nWhen you don't <b style='color: forestgreen;'>know</b> much about someone, it's natural to fill in the blanks with <b style='color: forestgreen;'>stereotypes</b>. For example, if someone plays tennis and belongs to a <b style='color: forestgreen;'>country club</b>, you might assume they were rich growing up. These assumptions are often inaccurate and usually negative. To <b style='color: forestgreen;'>avoid</b> being judged, provide details about yourself that dilute stereotypes, even if the information seems irrelevant. Hilton and Fein's 1989 study found that providing <b style='color: forestgreen;'>unrelated</b> details about someone can make people more <b style='color: forestgreen;'>trusting</b> and <b style='color: forestgreen;'>likable</b>. \n\nOversharing seemingly <b style='color: forestgreen;'>useless</b> details can also make people feel more <b style='color: forestgreen;'>emotionally</b> invested in you, reducing suspicion and encouraging trust. The more you share, the less <b style='color: forestgreen;'>readily</b> you're judged based on stereotypes. For example, learning that someone from a wealthy background had humble beginnings or achieved success through hardship can change your <b style='color: forestgreen;'>perception</b> of them. In short, reveal more about yourself to avoid snap judgments and help others see you as a <b style='color: forestgreen;'>multi-dimensional</b> person."
        }
    ]
}