{
    "meta": {
        "title": "Wake Up",
        "author": "Piers Morgan",
        "category": "Non-Fiction",
        "publisher": "HarperCollins",
        "pages": 279
    },
    "parts": [
        {
            "title": "The World’s Gone Nuts Overview",
            "body": "In <b style='color: forestgreen;'>\"The World’s Gone Nuts\"</b>, Piers Morgan highlights the <b style='color: forestgreen;'>bizarre happenings</b> that made him realize our world is losing its groundedness. From <b style='color: forestgreen;'>Rachel Dolezal's</b> racial identity claims to schools avoiding the word “<b style='color: forestgreen;'>girls</b>\" and <b style='color: forestgreen;'>James Bond</b> turning female, these absurdities signal a societal drift away from <b style='color: forestgreen;'>common sense</b>. The modern obsession with <b style='color: forestgreen;'>\"wokeness\"</b> reveals an <b style='color: forestgreen;'>intolerant liberalism</b> that stifles <b style='color: forestgreen;'>free speech</b> and conversation. Morgan, a <b style='color: forestgreen;'>self-proclaimed liberal</b>, is critical of this shift and longs for genuine <b style='color: forestgreen;'>freedom and tolerance</b>, values he believes have been lost in the <b style='color: forestgreen;'>illiberal liberalism</b> age."
        },
        {
            "title": "Evolution of Perspectives",
            "body": "<b style='color: forestgreen;'>Summary: Evolution of Perspectives</b>\n\nIn the wake of the <b style='color: forestgreen;'>coronavirus</b>, the author realized the <b style='color: forestgreen;'>profound impact</b> this global crisis had on his and others' <b style='color: forestgreen;'>views on life</b>. Initially, the pandemic <b style='color: forestgreen;'>united people</b> by drawing focus towards family, community, and <b style='color: forestgreen;'>essential workers</b> while sidelining <b style='color: forestgreen;'>'woke' culture</b>. However, the societal shift did not last; after events like George Floyd's killing, a <b style='color: forestgreen;'>'summer of madness'</b> ensued, marked by an explosion in <b style='color: forestgreen;'>illiberal liberalism</b> which the author saw as destructive. This led him to shelve his initial book idea on <b style='color: forestgreen;'>woke culture</b>, as the pandemic's drastic changes prompted him to <b style='color: forestgreen;'>reconsider</b> his thoughts and actions.\n\n<b style='color: forestgreen;'>Impact of the Pandemic on Individuals</b>\n\nThe narrative takes readers through the author's experience as his status shifted from being a <b style='color: forestgreen;'>maligned figure</b> to being <b style='color: forestgreen;'>lauded</b> by those who once criticized him. He now records his observations in a <b style='color: forestgreen;'>diary format</b> to capture <b style='color: forestgreen;'>real-time changes</b>, illustrating how <b style='color: forestgreen;'>coronavirus</b> provided a <b style='color: forestgreen;'>'wake-up moment'</b> globally that must persevere. Despite some societal <b style='color: forestgreen;'>polarization</b>, the crisis forced reflection and adaptation across communities, revealing the necessity for <b style='color: forestgreen;'>more inclusive perspectives.</b>"
        },
        {
            "title": "Controversy Around Race and Royal Decisions",
            "body": "<b style='color: forestgreen;'>Laurence Fox</b> faces backlash after a heated debate about Meghan Markle's media coverage, labeled as racist by some, which Fox dismisses. This exchange, spotlighting the divisive nature of racial discourse in Britain, triggers <b style='color: forestgreen;'>cancellations</b> and questions about <b style='color: forestgreen;'>freedom of speech</b>. The uproar illustrates the tension between acknowledging racism and the <b style='color: forestgreen;'>'cancel culture'</b> that often seeks to silence dissenting voices. \n\nIn the broader context, former US President <b style='color: forestgreen;'>Barack Obama</b> criticizes cancel culture, advocating for more constructive activism. Highlighted here is the risk that <b style='color: forestgreen;'>judgmental attitudes and hypersensitivity</b> can hinder genuine progress and dialogue, resonating with ongoing debates about racism and public criticism. Meanwhile, the Queen makes firm decisions regarding Harry and Meghan, ordering them to repay funds and withdraw from royal duties, marking a significant turning point for the royal family amidst public scrutiny."
        },
        {
            "title": "Society's Divides & Oscars Controversy",
            "body": "<b style='color: forestgreen;'>Society's Divisions and Woke Culture</b>\n\nIn recent events, societal divides seem to be widening over issues like <b style='color: forestgreen;'>Brexit</b>, which has led to polarized opinions, similar to <b style='color: forestgreen;'>Trump's presidency</b> and <b style='color: forestgreen;'>the controversies surrounding Meghan and Harry</b>. Many people find themselves caught in the middle, advocating for democracy and fairness despite the lack of nuance in political debates. Meanwhile, celebrities like <b style='color: forestgreen;'>Nicky Hilton</b> and <b style='color: forestgreen;'>Elizabeth Warren</b> engage in <b style='color: forestgreen;'>virtue signaling</b>, further disconnecting them from the average person. <b style='color: forestgreen;'>Good Morning Britain</b> has become a platform to challenge \"woke\" culture, but I am beginning to question if I sometimes cross the line from being provocative to <b style='color: forestgreen;'>bullying</b>. \n\n<b style='color: forestgreen;'>Oscars and Diversity Discussion</b>\n\nThe Oscars night turned into a display of self-righteousness, focusing on <b style='color: forestgreen;'>diversity issues</b> highlighted by actors like <b style='color: forestgreen;'>Joaquin Phoenix</b>, who condemned systemic racism, yet the problem of lack of diversity persists. Despite the <b style='color: forestgreen;'>Parasite's</b> win offering a nod to diversity, the ceremony often seemed a desperate attempt to appease critics regarding inclusion. Furthermore, <b style='color: forestgreen;'>PETA's</b> campaign to change common phrases deemed offensive showcases how activism sometimes takes counterproductive turns, prompting solid resistance instead of promoting change."
        },
        {
            "title": "Government's Coronavirus Response & Media Accountability",
            "body": "The government <b style='color: forestgreen;'>banned ministers</b> from appearing on <b style='color: forestgreen;'>GMB</b> to avoid accountability during the <b style='color: forestgreen;'>coronavirus</b> crisis. <b style='color: forestgreen;'>Matt Hancock</b> eventually appeared only after the show offered airtime to his rival, <b style='color: forestgreen;'>Jon Ashworth</b>. The crisis shows the importance of having government officials address the public on important issues in order to inform and calm them.\n\nIn the <b style='color: forestgreen;'>US</b>, former candidates drop out leaving <b style='color: forestgreen;'>old white males</b> as the only Democratic presidential candidates, highlighting potential <b style='color: forestgreen;'>hypocrisy</b> in the <b style='color: forestgreen;'>Democratic party</b> regarding their diversity values. With the coronavirus spreading fast and declared a high-level emergency by <b style='color: forestgreen;'>NHS England</b>, Hancock's assurance of following scientific advice seems inadequate, given the virus's swift transmission and the government’s reluctance to enforce measures such as <b style='color: forestgreen;'>lockdowns</b> or <b style='color: forestgreen;'>cancelling mass gatherings</b>."
        },
        {
            "title": "Pandemic Escalation & Feminist Discourse",
            "body": "With fears of a major <b style='color: forestgreen;'>coronavirus</b> outbreak, Boris Johnson appeared relaxed at \nfirst, even shaking hands in a hospital with infected patients. Yet <b style='color: forestgreen;'>WHO</b>’s\nTedros Adhanom Ghebreyesus warned that the <b style='color: forestgreen;'>death rate</b> was rising and we\nwere in \"unchartered territory.\" Significant measures were being taken worldwide such\nas lockdown in Lombardy, yet the UK initially seemed <b style='color: forestgreen;'>complacent</b> in comparison.\nThe public criticism towards events like the Cheltenham Festival proceeding was vocal.\nMedical professionals were urging an <b style='color: forestgreen;'>urgent lockdown</b> to minimize the pandemic’s\nimpact. \n\nAs for <b style='color: forestgreen;'>feminist discussions</b> during the pandemic, while some believed lockdown\nreinforced gender roles, there was criticism for certain celebrities showing \ninconsistencies in their <b style='color: forestgreen;'>feminist principles</b>. For example, Kim Kardashian and Emily \nRatajkowski's nude selfies were criticized as not representing true feminist values.\nInstead, genuine leadership was shown by women like <b style='color: forestgreen;'>Robin Wright</b> fighting for equal pay."
        },
        {
            "title": "Woke Criticism & Celebrity Virtue-Signaling",
            "body": "<b style='color: forestgreen;'>Legend</b> faced criticism for <b style='color: forestgreen;'>tackling</b> 'Baby, It's Cold Outside'. Many, including Dean Martin's daughter, Deana, see it as a fun holiday song. Yet, others argue he's silent on <b style='color: forestgreen;'>misogynistic</b> lyrics in modern music. Some call it a <b style='color: forestgreen;'>woke</b> campaign issue, ignoring that the song in 'Neptune's Daughter' features both a male and female persisting to keep their partner from leaving, a point often <b style='color: forestgreen;'>overlooked</b>. <b style='color: forestgreen;'>Critics</b> argue campaigns against the song don't address real <b style='color: forestgreen;'>gender</b> issues, calling for a focus on offensive contemporary lyrics.\n\nAs the <b style='color: forestgreen;'>coronavirus</b> spread, some hoped celebrities would stop <b style='color: forestgreen;'>virtue-signaling</b>, instead showing <b style='color: forestgreen;'>solidarity</b> with health workers on the frontline. However, instances like <b style='color: forestgreen;'>Gal Gadot's</b> 'Imagine' video, featuring stars singing tunelessly, sparked criticism. The pandemic exposes the <b style='color: forestgreen;'>ritual self-promotion</b> and <b style='color: forestgreen;'>hypocrisy</b> of some celebrities, seen as out of touch from reality, singing about worlds without <b style='color: forestgreen;'>possessions</b> from their <b style='color: forestgreen;'>luxurious homes</b>. This <b style='color: forestgreen;'>tone-deaf</b> move reminds viewers of <b style='color: forestgreen;'>wealth disparities</b>, not aligning with Lennon's intended message."
        },
        {
            "title": "Government Failures & Heroic Acts Amidst Crisis",
            "body": "In the midst of the <b style='color: forestgreen;'>coronavirus</b> pandemic, the UK government is facing backlash for its <b style='color: forestgreen;'>inadequate response</b>, particularly in <b style='color: forestgreen;'>testing</b> and providing <b style='color: forestgreen;'>PPE</b> for NHS workers. As the death toll rises, Piers is incensed by <b style='color: forestgreen;'>irresponsible decisions</b> by public figures, such as <b style='color: forestgreen;'>football clubs</b> seeking taxpayer money despite profits, or <b style='color: forestgreen;'>celebrities</b> promoting themselves rather than offering real help. The narrative highlights a contrast between those exploiting the crisis and individuals like <b style='color: forestgreen;'>Captain Tom Moore</b>, who embodies selflessness, raising millions for the NHS through a simple gesture of walking laps in his garden.\n\nMeanwhile, as Americans protest <b style='color: forestgreen;'>lockdown measures</b>, spurred by <b style='color: forestgreen;'>Trump's rhetoric</b> against expert advice, Piers reflects on the importance of <b style='color: forestgreen;'>truth</b> and sensible action over politically fueled rebellion. He is critical of <b style='color: forestgreen;'>President Trump’s</b> handling of the crisis, noting the dangerous impacts of rhetoric that undermines public health measures. Piers continues to champion the contribution of <b style='color: forestgreen;'>immigrants</b> and NHS workers, advocating for recognition and a reevaluation of their roles and treatment post-crisis."
        },
        {
            "title": "Trump's Reckless COVID-19 Advice and Pandemic Media Reactions",
            "body": "<b style='color: forestgreen;'>President Trump</b> suggested the absurd idea of injecting <b style='color: forestgreen;'>bleach</b> as a COVID-19 cure, sparking reckless public reactions. Despite scientific insights from <b style='color: forestgreen;'>William Bryan</b> at the Department of Homeland Security, Trump's handling of COVID-19 briefings showed a disregard for expert opinions, causing global concern. The <b style='color: forestgreen;'>media briefings</b> have turned into <b style='color: forestgreen;'>self-promotional</b> rallies rather than informative sessions, leading to disastrous consequences. Former President Trump's controversial advice on <b style='color: forestgreen;'>hydroxychloroquine</b> similarly endangered lives and showed his tendency to undermine scientific guidance for personal agendas.\n\nLater, in May, a discussion emerged about the reaction to the <b style='color: forestgreen;'>lockdowns</b> and Trump unfollowing <b style='color: forestgreen;'>Piers Morgan</b> was noted. Meanwhile, OFCOM supported Piers Morgan's robust interview style amidst the pandemic, encouraging <b style='color: forestgreen;'>freedom of speech</b> against government criticism. A further insight on <b style='color: forestgreen;'>British ministers' performances</b> during the crisis highlighted a divide in public opinion, some viewing Morgan as a voice of reason during governmental scrutiny. There was also a segment on the societal divide, addressing the impact of COVID-19 in varying communities and the unrealistic portrayal of body images in the media."
        },
        {
            "title": "Failures & Cummings Scandal",
            "body": "The <b style='color: forestgreen;'>failure</b> of the UK's <b style='color: forestgreen;'>coronavirus</b> response is highlighted with a <b style='color: forestgreen;'>poll</b> showing <b style='color: forestgreen;'>public disapproval</b> for the government. In <b style='color: forestgreen;'>Belgium</b>, healthcare workers <b style='color: forestgreen;'>protested</b> against their government's poor handling. In the UK, <b style='color: forestgreen;'>Matt Hancock</b> falsely claimed a <b style='color: forestgreen;'>protective ring</b> was created around care homes from the start, which was debunked on <b style='color: forestgreen;'>GMB</b> as a lie by family members affected. Government mistakes worsen as they continue to cover their failures with lies.\n\nAmidst political upheaval, <b style='color: forestgreen;'>Captain Tom Moore</b> was knighted, much to his delight. Tensions rise as <b style='color: forestgreen;'>Dominic Cummings</b>, an aide to <b style='color: forestgreen;'>Boris Johnson</b>, was exposed for breaking lockdown rules, triggering public and political backlash. This scandal questions the authority of lockdown laws and causes public defiance. Journalists and the public react as <b style='color: forestgreen;'>Boris Johnson</b> supports <b style='color: forestgreen;'>Cummings</b>, leading to further <b style='color: forestgreen;'>enragement</b>."
        },
        {
            "title": "Increased Division Amid BLM Protests and \"Cancel Culture\" Backlash",
            "body": "Today, <b style='color: forestgreen;'>Black Lives Matter</b> protests are being overshadowed by actions that provoke societal division. Recent clashes, such as between police and protestors, and instances of violent rhetoric, highlight the destructive behavior that distracts from the core issues of <b style='color: forestgreen;'>racial injustice</b> and <b style='color: forestgreen;'>inequality</b>. People like <b style='color: forestgreen;'>Hannah Jane Parkinson</b> are criticized for hypocrisy; they preach mental health awareness but embody cruelty online.\n\nIn other news, <b style='color: forestgreen;'>J.K. Rowling</b> faces backlash for her views on transgender issues, illustrating the culture of \"<b style='color: forestgreen;'>cancel</b>\" prevalent today. Rowling's controversial opinions hit headlines as she defends the concept of \"<b style='color: forestgreen;'>sex is real</b>,\" prompting organizations like <b style='color: forestgreen;'>GLAAD</b> to accuse her of supporting an ideology that misrepresents <b style='color: forestgreen;'>gender identity</b>. The recent focus on \"<b style='color: forestgreen;'>cancel culture</b>\" highlights a growing intolerance for diverse viewpoints, prioritizing uniform agreement over dialogue."
        },
        {
            "title": "The Dilemma of Self-Identification",
            "body": "<b style='color: forestgreen;'>Rachel Dolezal</b> is caught in a web of lies claiming she is <b style='color: forestgreen;'>black</b>, despite being <b style='color: forestgreen;'>born to white parents</b>. Her history includes <b style='color: forestgreen;'>deception</b> about her identity while leading an NAACP chapter, and <b style='color: forestgreen;'>ironically suing a university for racial discrimination as a white person</b>. When confronted, she maintains, <b style='color: forestgreen;'>it's complex</b>, treating her racial claim as valid self-identification.\n\nHer actions highlight the controversial extremes of <b style='color: forestgreen;'>self-identification</b>. Even when exposed, Dolezal continued to <b style='color: forestgreen;'>defend her stance</b> using comparisons to <b style='color: forestgreen;'>gender identification</b>, questioning why race should be treated differently. Her case points to the <b style='color: forestgreen;'>dangers of unchecked self-identification</b> and how it can lead to <b style='color: forestgreen;'>manipulation for personal gain</b>."
        }
    ]
}