{
    "meta": {
        "title": "Woke: A Guide to Social Justice",
        "author": "Titania McGrath",
        "category": "Humor, Satire, Social Justice",
        "publisher": "Constable, an imprint of Little, Brown Book Group",
        "pages": 104
    },
    "parts": [
        {
            "title": "Titania's Woke Journey 🚨✨",
            "body": "<b style='color: forestgreen;'>Titania McGrath</b> introduces herself as a rad ical <b style='color: forestgreen;'>intersectionalist poet</b> with a gift for <b style='color: forestgreen;'>social justice</b>. She claims her <b style='color: forestgreen;'>wokeness</b> is innate, comparing herself to <b style='color: forestgreen;'>Joan of Arc</b>. Titania shares stories of <b style='color: forestgreen;'>performing slam poetry</b> and <b style='color: forestgreen;'>armed peaceful protests</b>, expressing disdain for <b style='color: forestgreen;'>patriarchal constructs</b> in academia. She presents herself as a <b style='color: forestgreen;'>guiding force</b> for those struggling to keep up with <b style='color: forestgreen;'>modern social justice concepts</b>, aiming to <b style='color: forestgreen;'>mold them</b> into more \"woke\" individuals. Her writing style is <b style='color: forestgreen;'>satirical</b>, bold, and touches on themes of <b style='color: forestgreen;'>identity, feminism</b>, and <b style='color: forestgreen;'>privilege</b>."
        },
        {
            "title": "Embracing Social Media Activism",
            "body": "In <b style='color: forestgreen;'>early 2018</b>, I was inspired by online activists to become more active on social media to spread awareness about social justice. The <b style='color: forestgreen;'>internet</b>, the new weapon of choice, is where modern-day \"<b style='color: forestgreen;'>keyboard warriors</b>\" make a greater impact than historical figures like Martin Luther King. My newfound activism led to gaining thousands of followers, whom I prefer to call <b style='color: forestgreen;'>disciples</b>. However, being a woman online exposed me to abuse and criticism, especially regarding my <b style='color: forestgreen;'>poetry</b>. I've been accused of being shrill and humorless, highlighting the <b style='color: forestgreen;'>underlying sexism</b> and resistance to ideas that don't conform to the status quo."
        },
        {
            "title": "Women, Misogyny, and Empowerment",
            "body": "The author discusses their frustrations with <b style='color: forestgreen;'>gender inequality</b> and <b style='color: forestgreen;'>internalized misogyny</b>. They highlight the need for women to make empowering career choices to <b style='color: forestgreen;'>redress imbalances</b>. The text criticizes <b style='color: forestgreen;'>Donald Trump's</b> election victory, attributing it to women who have <b style='color: forestgreen;'>internalized misogyny</b>. They quote <b style='color: forestgreen;'>Linda Sarsour</b> wishing to \"take away\" vaginas from women like <b style='color: forestgreen;'>Brigitte Gabriel</b> who disagree with feminist views. The author encourages ignoring both men and women who oppose feminism as either <b style='color: forestgreen;'>misogynists</b> or have <b style='color: forestgreen;'>internalized misogyny</b>.\n\nCriticism is directed at three influential women – <b style='color: forestgreen;'>Christina Hoff Sommers</b>, <b style='color: forestgreen;'>Camille Paglia</b>, and <b style='color: forestgreen;'>Ella Whelan</b>, whom the author labels as dangerous figures not deserving a platform for their opposition to modern feminist ideals. Each woman provides a quote critiquing <b style='color: forestgreen;'>trigger warnings</b>, <b style='color: forestgreen;'>safe spaces</b>, and the view of women as weak. These quotes reflect their disapproval of current <b style='color: forestgreen;'>feminist movements</b> for being <b style='color: forestgreen;'>infantilizing</b> and weak. The author dismissively calls them <b style='color: forestgreen;'>hateful bitches</b> for questioning feminist doctrines."
        },
        {
            "title": "Intersectional Feminism and Islam",
            "body": "In this segment, <b style='color: forestgreen;'>intersectional feminism</b> and <b style='color: forestgreen;'>Islam</b> are explored. The author emphasizes the importance of treating Muslims with care, especially due to increased stereotypes and biases. They argue that Muslims are often unjustly scapegoated since <b style='color: forestgreen;'>9/11</b>, and highlight the misconception that Islam and <b style='color: forestgreen;'>feminism</b> are incompatible. The piece criticizes the reluctance to accept expressions of Islamic culture like the <b style='color: forestgreen;'>veil</b>, and emphasizes how the West needs to address its own cultural failings, like the refusal of a Belfast bakery to support gay marriage, before judging Islam. The author suggests that Islamophobic opposition to <b style='color: forestgreen;'>hijabs</b> and <b style='color: forestgreen;'>burkas</b> is unfounded.\n\nDespite terrorist acts, the author believes focusing on medieval <b style='color: forestgreen;'>Christian</b> wrongdoings, like the Crusades, is more appropriate than highlighting modern Islamic extremism. The section also notes the author’s view that criticisms of Islam often stem from ignorance of the <b style='color: forestgreen;'>intersectionality</b> theory and the societal backlash following <b style='color: forestgreen;'>jihadist terrorism</b>. Finally, some right-wing groups claim that Islamic countries mistreat women and LGBTQIA+ people, but the author insists these are progressive misunderstandings of Islamic society."
        },
        {
            "title": "The End of Poetry and Rise of Wokeness",
            "body": "This book concludes that poetry and art have reached their zenith with <b style='color: forestgreen;'>Titania McGrath</b>. Despite being frequently admired, they feel the weight of <b style='color: forestgreen;'>being misunderstood</b>, particularly by <b style='color: forestgreen;'>men</b>. They see their work as a tool for <b style='color: forestgreen;'>social justice</b>, <b style='color: forestgreen;'>minority defense</b>, and <b style='color: forestgreen;'>patriarchy dismantling</b> rather than an ego-driven pursuit. McGrath calls for compulsory <b style='color: forestgreen;'>Gender Studies</b> in schools to tackle patriarchal norms, advocating for <b style='color: forestgreen;'>wokeness</b> over criticism like being labeled <b style='color: forestgreen;'>‘Orwellian’</b>. The objective is to eliminate all forms of <b style='color: forestgreen;'>bias</b> and achieve a <b style='color: forestgreen;'>woke utopia</b>."
        }
    ]
}